[
    {
        "Title": "Associate Cloud Computing Engineer",
        "Location": "Bengaluru, Karnataka",
        "Company": "BigSpire Software",
        "Salary": "1000000",
        "Sponsored": "",
        "Description": "Skill Sets: Should have a good communication skills, knowledge in Cloud Computing concepts and basic knowledge in Amazon Web Services, Web Developments in Cloud Qualifications: Any UG or PG Degree\n\nPlease forward your resumes to careers@bigspire.com and we will get back to you if your resume matches our job criteria.\n\nThanks for applying for the job at bigspire",
        "Job Link": "/rc/clk?jk=b5d46e5954b43830&fccid=1e3e186f5f922b89&vjs=3",
        "state": "Karnataka"
    },
    {
        "Title": "Cloud Engineer",
        "Location": "Gurgaon, Haryana",
        "Company": "S&P Global",
        "Salary": "800000",
        "Sponsored": "",
        "Description": "Years of Experience – 3-5 years\n\nPosition summary\n\nThe Managed Services team is responsible for all the infrastructure and automation required to support continuous integration and continuous delivery both for client cloud (UAT and Production) environments and internal environments. This person would work as part of a global team to help manage these environments and ensure that Managed Services requests are actioned within well defined SLAs.\n\nWhat You'll Do\nPlay an integral role in the Managed Services offering providing support and expertise to ensure maximum up-time of environments.\nEnsure that client SLAs are strictly adhered to and their primary focus will be on continuous performant operations.\nBe involved in core team tasks including investigating and resolving environment issues, investigating and implementing automated solutions and analyzing and improving existing SCM tool chain applications.\nBe required to liaise with the other teams in Managed Services to ensure the overall team works together as one. As well as various other groups (e.g. Support, Architecture, IT) to ensure issues are resolved, new tools/trends are analysed, etc.\nBe familiar with operating in a challenging environment supported from different locations and should also have a strong appreciation of Development processes, tool sets and delivery infrastructure, and be comfortable working with multiple differing systems and tools.\nBe required to work within a team structure.\nDemonstrate a willingness to learn new technologies, processes, tool sets and be comfortable working with multiple differing systems.\nDuties & Accountabilities:\nManage client cloud environments (UAT and production)\nOccasional outside support hours will be required as part of an on call rota to provide 24/7 cover\nAction Managed Services requests within defined SLAs,\nOptimize processes around Service Requests, resource reclamation, and monitoring.\nImplement automated solutions for repetitive and manual tasks.\nAnalysis and improvement of existing SCM tool chain applications\nCollaboration with Managed Services stakeholders to refine and continuously improve deliverables and services according to their requirements.\nCollaboration with IT / Technical Architecture in R&D to assess tooling and trends.\nManage internal environments\nWhat You Need to Get the Job Done\nBachelor’s degree in Computer Science or related discipline\n1-2 years of experience in a similar role\nGood knowledge of UNIX/Linux systems and technologies – including shell scripting, OS configuration and troubleshooting\nGood knowledge of the Java eco system, JEE applications and application servers e.g. JBoss, Oracle WebLogic, IBM WebSphere\nPrior experience of Incident Management/Ticketing Systems (e.g. Jira, ServiceNow) and workflows\nGood knowledge of cloud computing concepts\nAbility to work within a team containing geographically disparate people\nAdvantageous Skills:\nUnderstanding of messaging oriented middleware especially JMS (e.g. IBM MQ, Active MQ)\nHands on experience of working in the cloud (AWS preferred)\nExperience of supporting a high uptime/high availability (24x7) system\nUnderstanding of Continuous Integration and Continuous Delivery, concepts and tooling\nFamiliarity with scripting languages (e.g. Python, Groovy, Perl)\nFamiliarity with build automation and dependency management\nFamiliarity with source control systems (e.g. SVN, GIT) – branching, hook scripting, access control, backup & recovery\nSQL and JAVA skills would be an advantage\nGood working knowledge of software development lifecycle\nPersonal Attributes:\nStrong analytical/troubleshooting skills\nExcellent written and verbal English\nProven ability to collaborate in a team environment\nMeticulous attention to detail\nStrong inter-personal skills with practical, can-do approach\nProactive work ethic\nDesire and ability for quick learning of new tools and technologies\nProven documentation skills\n-----------------------------------------------------------\n\nEqual Opportunity Employer\nS&P Global is an equal opportunity employer and all qualified candidates will receive consideration for employment without regard to race/ethnicity, color, religion, sex, sexual orientation, gender identity, national origin, age, disability, marital status, military veteran status, unemployment status, or any other status protected by law. Only electronic job submissions will be considered for employment.\n\nIf you need an accommodation during the application process due to a disability, please send an email to: EEO.Compliance@spglobal.com and your request will be forwarded to the appropriate person.\n\nUS Candidates Only: The EEO is the Law Poster http://www.dol.gov/ofccp/regs/compliance/posters/pdf/eeopost.pdf describes discrimination protections under federal law.\n\n----------------------------------------------------------- 20 - Professional (EEO-2 Job Categories-United States of America), IFTECH202.1 - Middle Professional Tier I (EEO Job Group), SWP Priority – Ratings - (Strategic Workforce Planning)\n\nJob ID: 282434\nPosted On: 2023-06-28\nLocation: Gurgaon, Haryana, India",
        "Job Link": "/rc/clk?jk=b5b1ea6a18b20750&fccid=b716e44d2c6283e7&vjs=3",
        "state": "Haryana"
    },
    {
        "Title": "Cloud Engineer",
        "Location": "Bengaluru, Karnataka",
        "Company": "TruTeam software solutions pvt ltd",
        "Salary": "900000",
        "Sponsored": "",
        "Description": "Job Overview\nHeadway.ai are looking for a skilled and experienced Cloud Engineer to join our team. You will be responsible for creating network architecture diagrams that meet the needs of your clients. You should also be able to provide timely cloud support and have a go-getter attitude. You will also have to work with the CTO to coordinate and analyze cloud architecture and strategies.\nTo qualify for the job, you should demonstrate excellent troubleshooting skills as well as the capacity to work in a competitive environment. Your ability to prioritize work and manage time efficiently will be a plus.\nSend in your application right away if you can fulfill the job requirements.\nResponsibilities\nIdentifying and developing optimal cloud solutions\nExamining and improving existing cloud-based systems\nUnderstanding and implementing new cloud technologies and initiatives\nMaintaining best practices in cloud security\nAnalyzing and resolving any issues with application infrastructure and deployment\nEnsuring efficient functioning of data storage and processing as well as providing timely cloud support\nDefining and documenting strategies and best practices for cloud solutions and systems\nDeveloping and implementing high standards of code quality and thoughtful designs\nUnderstanding and engineering complex Azure cloud infrastructures\nLeveraging in-depth technical knowledge and product expertise when dealing with clients’ requirements\nRequirements\nMaster’s or Bachelor’s degree in Computer Science, Information Technology or a related field\n5 to 8 years of experience as a Cloud Engineer or a similar role in the IT industry\nCertification in Microsoft Azure / AWS is desirable\nComplete knowledge of SCRUM Agile methodologies, API, REST and other cloud computing technologies\nHands-on experience with Azure domains such as Azure Core Platform, AKS or Data Platform\nBasic understanding of the best practices and software security standards followed in the IT industry\nExcellent analytical and troubleshooting skills\nGood sense of prioritization and time management\nAbility to work independently as well as in a team\nGood communication skills\nAbility to work in a competitive environment\nJob Type: Full-time\nSalary: ₹2,000,000.00 - ₹2,500,000.00 per year\nBenefits:\nHealth insurance\nSchedule:\nDay shift\nMonday to Friday\nSupplemental pay types:\nPerformance bonus\nAbility to commute/relocate:\nBangalore City, Karnataka: Reliably commute or planning to relocate before starting work (Required)\nExperience:\n5G: 5 years (Required)\nSpeak with the employer\n+91 8978881483",
        "Job Link": "/company/TruTeam-software-solutions-pvt-ltd/jobs/Cloud-Engineer-825c51abef926d8e?fccid=9b2f9072f07c3ad9&vjs=3",
        "state": "Karnataka"
    },
    {
        "Title": "Jr Cloud Operations Engineer",
        "Location": "India",
        "Company": "Cloud 9 Infosystems",
        "Salary": "600000",
        "Sponsored": "",
        "Description": "Responsibilities\nProvide Technical Support to Customer on Ticketing Issues on a Timely Basis.\nCoordinate with interfacing teams and resolve complex application and server issues.\nMonitors all production environments as a part of a 24x7x365 rotation to ensure availability\nand performance meets our SLAs\nManage and coordinate day to day activities of the Cloud Infrastructure and Support Team\nHands-on experience with minimum 2 Public Cloud environments like AWS/Azure\nAnalytical ability to establish baselines and deviation from baselines in a clear manner\nRequirements\nThis role requires a seasoned, skilled, independent, self-motivated, , who is experienced with\n24×7 mission-critical cloud infrastructure, operations, processes, tools, and best practices.\nThe ideal candidate must possess excellent communication skills, including the ability to interact\nand work with staff and leadership at all levels.\n2+Years of Experience in Cloud operations in AWS/Azure.\nA University graduate with a relevant degree within a computing discipline\nSignificant practical experience managing or supporting on-prem and public cloud\ninfrastructure, including AWS/Azure",
        "Job Link": "/rc/clk?jk=b2b87d393a2ee44d&fccid=e62efd31829fb787&vjs=3",
        "state": "India"
    },
    {
        "Title": "Software Engineer, Security/Privacy, Google Cloud",
        "Location": "Bengaluru, Karnataka",
        "Company": "Google",
        "Salary": "2500000",
        "Sponsored": "",
        "Description": "This role will be remote until October 2022 or when the Google office in Pune opens, (whichever is earlier). After this, you will be required to work from the Google Pune office.\n\nNote: By applying to this position you will have an opportunity to share your preferred working location from the following: Pune, Maharashtra, India; Bangalore, Karnataka, India.\nMinimum qualifications:\nBachelor’s degree or equivalent practical experience.\n1 years of experience with software development in one or more programming languages.\n1 year of experience with data structures or algorithms.\n\n\nPreferred qualifications:\nMaster's degree or PhD in Computer Science or related technical fields.\n1 year of experience building software for data privacy or security (e.g., identity and access management).\nExperience developing accessible technologies.\nAbout the job\nGoogle's software engineers develop the next-generation technologies that change how billions of users connect, explore, and interact with information and one another. Our products need to handle information at massive scale, and extend well beyond web search. We're looking for engineers who bring fresh ideas from all areas, including information retrieval, distributed computing, large-scale system design, networking and data storage, security, artificial intelligence, natural language processing, UI design and mobile; the list goes on and is growing every day. As a software engineer, you will work on a specific project critical to Google’s needs with opportunities to switch teams and projects as you and our fast-paced business grow and evolve. We need our engineers to be versatile, display leadership qualities and be enthusiastic to take on new problems across the full-stack as we continue to push technology forward.\nWith your technical expertise you will manage project priorities, deadlines, and deliverables. You will design, develop, test, deploy, maintain, and enhance software solutions.\nGoogle Cloud accelerates organizations’ ability to digitally transform their business with the best infrastructure, platform, industry solutions and expertise. We deliver enterprise-grade solutions that leverage Google’s cutting-edge technology – all on the cleanest cloud in the industry. Customers in more than 200 countries and territories turn to Google Cloud as their trusted partner to enable growth and solve their most critical business problems.\nResponsibilities\nWrite product or system development code.\nParticipate in, or lead design reviews with peers and stakeholders to decide amongst available technologies.\nReview code developed by other developers and provide feedback to ensure best practices (e.g., style guidelines, checking code in, accuracy, testability, and efficiency).\nContribute to existing documentation or educational content and adapt content based on product/program updates and user feedback.\nTriage product or system issues and debug/track/resolve by analyzing the sources of issues and the impact on hardware, network, or service operations and quality.\nGoogle is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also Google's EEO Policy and EEO is the Law. If you have a disability or special need that requires accommodation, please let us know by completing our Accommodations for Applicants form.",
        "Job Link": "/rc/clk?jk=0a090fcc691a884a&fccid=a5b4499d9e91a5c6&vjs=3",
        "state": "Karnataka"
    },
    {
        "Title": "Cloud computing Instructor",
        "Location": "Remote in Faridabad, Haryana",
        "Company": "Acadbuddy LLP",
        "Salary": "300000",
        "Sponsored": "",
        "Description": "We are looking for a Cloud Computing expert to join our EdTech team as a Instructor. The successful candidate will be responsible for developing, deploying, and managing cloud-based applications and services. The ideal candidate should have a strong understanding of cloud computing technologies, including virtualization, storage, networking, and security.\nResponsibilities:\nDesign, develop, and deploy cloud-based applications and services.\nManage cloud-based applications and services.\nMonitor and optimize cloud-based applications and services.\nTroubleshoot and resolve cloud-based application and service issues.\nDevelop and maintain cloud-based application and service documentation.\nProvide technical support to internal and external customers.\nStay up-to-date on the latest cloud computing technologies.\nServe practical knowledge\nRequirements:\nBachelor’s degree in Computer Science, Information Technology, or related field.\n2+ years of experience in cloud computing.\nStrong understanding of cloud computing technologies, including virtualization, storage, networking, and security.\nExperience with cloud-based application and service development.\nExperience with cloud-based application and service management.\nExcellent problem-solving and troubleshooting skills.\nExcellent communication and customer service skills.\nJob Types: Part-time, Contractual / Temporary\nContract length: 6 months\nSalary: From ₹18,000.00 per month\nBenefits:\nWork from home\nSchedule:\nDay shift\nEvening shift\nWeekend availability\nApplication Question(s):\nMention or Attach Years of teaching experience in the same field.\nMention years of corporate experience.\nMention the tools that you use or will use to teach.\nEducation:\nMaster's (Required)",
        "Job Link": "/company/AcadBuddy-LLP/jobs/Instructor-997a05b555a91471?fccid=bd8fcd7c34082950&vjs=3",
        "state": "Haryana"
    },
    {
        "Title": "Cloud Computing Internship",
        "Location": "Coimbatore, Tamil Nadu",
        "Company": "Sharadha Skill Academy (SSA)",
        "Salary": "700000",
        "Sponsored": "",
        "Description": "Location : Coimbatore\nSalary :\nJob Type : Internship\nEducation : Graduate / Knowledge in System Applications - Diploma\nExperience :\nWe provide internship for Cloud Computing. We are looking for interns who’s eager to learn and make a career in Cloud computing. You will be working on live Cloud Computing projects so that you will be getting maximum of practical knowledge on Cloud Computing. Work with guidance and get practically strong in Cloud Computing.\nSelected interns day to day responsibilities include:\n– Designing solutions and architecture applications for the Cloud (High availability, Fault tolerant, Elastic, Secure. – Participate in solution building for moving existing workloads and/or traditional infrastructure to the Cloud.\n– Designing To-Be architecture for Cloud based solutions covering Identity and Security aspects.\nBenefits of internship: -Domain Knowledge on Cloud Computing – Cloud Computing Project Training and Implementation -Internship Certificate on Cloud Computing\nEligibility: Any graduate\nMore details\nWhatsapp: +91 7397788918",
        "Job Link": "/rc/clk?jk=f296abbac3304538&fccid=c73c1c3e92949622&vjs=3",
        "state": "Tamil Nadu"
    },
    {
        "Title": "Senior Cloud Engineer",
        "Location": "Gurgaon, Haryana+2 locations",
        "Company": "S&P Global",
        "Salary": "600000",
        "Sponsored": "",
        "Description": "S&P Global Market Intelligence\nThe Role: Senior Cloud Engineer\nThe Team: The cloud team is composed of highly skilled infrastructure as code engineers spread across the globe. We help hundreds of development, operational, and other technology teams solve long-standing problems by providing engineering guidance and self-service solutions. We put a strong focus on code quality by performing frequent code reviews, automating tests, and following industry standards.\nThe Impact: The cloud team contributes to a growing library of modules that help enable teams across the organization to leverage new technology in IaC pipeline and deployment pipelines. Additionally, the cloud team develops and maintains a platform to deliver IaC with expanding functionality around security and cost optimizations. S&P is expanding its footprint into the cloud and needs creative and capable engineers to assist in transitioning applications from on-premises to appropriate cloud solutions.\n\nWhat’s in it for you:\nThe opportunity to provide innovative solutions using cloud services.\nExcellent training programs hosted directly by cloud providers.\nHelp a global organization transition to modern cloud solutions.\nContribute to an organic IaC delivery platform responsible for 24/7 service delivery.\n\nResponsibilities:\nCollaborating with engineering and development teams to evaluate and identify optimal cloud solutions.\nEducating teams on the implementation of new cloud technologies and initiatives.\nDesigning, developing and deploying modular cloud platform.\nDeveloping and maintaining cloud solutions in accordance with best practices.\nImplementing security guard rails in accordance with company policies and compliance in cloud security.\nInteracting with clients, providing cloud support, and making recommendations based on client needs .\n\nKey Qualifications:\nBachelor’s degree in computer science or adjacent field.\nAt least 3 years of experience in cloud computing and applied solutions.\nAbility to communicate complex ideas and technological concepts to peers and clients.\nExperience with Terraform 12, Python, Bash and Powershell\n\nAdditional Experience:\nAWS, Azure or cloud related certifications\nExperience running a fully managed, 24/7 cloud platform product\n\nGrade: 10\n\nThe Location: Gurgaon (Gurugram), India\n\nAbout Company Statement:\nS&P Global delivers essential intelligence that powers decision making. We provide the world’s leading organizations with the right data, connected technologies and expertise they need to move ahead. As part of our team, you’ll help solve complex challenges that equip businesses, governments and individuals with the knowledge to adapt to a changing economic landscape.\n\nS&P Global Market Intelligence partners with customers to broaden their perspective and operate with confidence by bringing them leading data sources and technologies that embed insight in their daily work.\n\nEqual Opportunity Employer:\nS&P Global is an equal opportunity employer and all qualified candidates will receive consideration for employment without regard to race/ethnicity, color, religion, sex, sexual orientation, gender identity, national origin, age, disability, marital status, military veteran status, unemployment status, or any other status protected by law. Only electronic job submissions will be considered for employment.\n\nIf you need an accommodation during the application process due to a disability, please send an email to: EEO.Compliance@spglobal.com and your request will be forwarded to the appropriate person.\n\n-----------------------------------------------------------\n\nEqual Opportunity Employer\nS&P Global is an equal opportunity employer and all qualified candidates will receive consideration for employment without regard to race/ethnicity, color, religion, sex, sexual orientation, gender identity, national origin, age, disability, marital status, military veteran status, unemployment status, or any other status protected by law. Only electronic job submissions will be considered for employment.\n\nIf you need an accommodation during the application process due to a disability, please send an email to: EEO.Compliance@spglobal.com and your request will be forwarded to the appropriate person.\n\nUS Candidates Only: The EEO is the Law Poster http://www.dol.gov/ofccp/regs/compliance/posters/pdf/eeopost.pdf describes discrimination protections under federal law.\n\n----------------------------------------------------------- IFTECH202.1 - Middle Professional Tier I (EEO Job Group)\n\nJob ID: 286997\nPosted On: 2023-07-10\nLocation: Gurgaon, Haryana, India",
        "Job Link": "/rc/clk?jk=46f6d845b3670d43&fccid=b716e44d2c6283e7&vjs=3",
        "state": "Haryana"
    },
    {
        "Title": "Software Engineer II, Infrastructure, Google Cloud",
        "Location": "Bengaluru, Karnataka",
        "Company": "Google",
        "Salary": "3000000",
        "Sponsored": "",
        "Description": "Minimum qualifications:\nBachelor’s degree or equivalent practical experience.\n1 year of experience with software development in one or more programming languages (e.g., Python, C, C++, Java, JavaScript).\n1 year of experience with data structures or algorithms.\n\nPreferred qualifications:\nMaster's degree or PhD in Computer Science or related technical field.\n1 year of experience building and developing large-scale infrastructure, distributed systems or networks, and/or experience with compute technologies, storage, and/or hardware architecture.\nExperience developing accessible technologies.\nAbout the job\nGoogle's software engineers develop the next-generation technologies that change how billions of users connect, explore, and interact with information and one another. Our products need to handle information at massive scale, and extend well beyond web search. We're looking for engineers who bring fresh ideas from all areas, including information retrieval, distributed computing, large-scale system design, networking and data storage, security, artificial intelligence, natural language processing, UI design and mobile; the list goes on and is growing every day. As a software engineer, you will work on a specific project critical to Google’s needs with opportunities to switch teams and projects as you and our fast-paced business grow and evolve. We need our engineers to be versatile, display leadership qualities and be enthusiastic to take on new problems across the full-stack as we continue to push technology forward.\nWith your technical expertise you will manage project priorities, deadlines, and deliverables. You will design, develop, test, deploy, maintain, and enhance software solutions.\nGoogle Cloud accelerates organizations’ ability to digitally transform their business with the best infrastructure, platform, industry solutions and expertise. We deliver enterprise-grade solutions that leverage Google’s cutting-edge technology – all on the cleanest cloud in the industry. Customers in more than 200 countries and territories turn to Google Cloud as their trusted partner to enable growth and solve their most critical business problems.\nResponsibilities\nWrite product or system development code.\nParticipate in, or lead design reviews with peers and stakeholders to decide amongst available technologies.\nReview code developed by other developers and provide feedback to ensure best practices (e.g., style guidelines, checking code in, accuracy, testability, and efficiency).\nContribute to existing documentation or educational content and adapt content based on product/program updates and user feedback.\nTriage product or system issues and debug/track/resolve by analyzing the sources of issues and the impact on hardware, network, or service operations and quality.\nGoogle is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also Google's EEO Policy and EEO is the Law. If you have a disability or special need that requires accommodation, please let us know by completing our Accommodations for Applicants form.",
        "Job Link": "/rc/clk?jk=6984ee3e8c822f97&fccid=a5b4499d9e91a5c6&vjs=3",
        "state": "Karnataka"
    },
    {
        "Title": "Cloud Engineer",
        "Location": "Bengaluru, Karnataka",
        "Company": "Infolink Technologies",
        "Salary": "4000000",
        "Sponsored": "",
        "Description": ",Cloud Engineer Responsibilities:\nCollaborating with engineering and development teams to evaluate and identify optimal cloud solutions.\nModifying and improving existing systems.\nEducating teams on the implementation of new cloud technologies and initiatives.\nDesigning, developing and deploying modular cloud-based systems.\nDeveloping and maintaining cloud solutions in accordance with best practices.\nEnsuring efficient functioning of data storage and processing functions in accordance with company security policies and best practices in cloud security.\nIdentifying, analyzing, and resolving infrastructure vulnerabilities and application deployment issues.\nRegularly reviewing existing systems and making recommendations for improvements.\nInteracting with clients, providing cloud support, and making recommendations based on client needs.\nCloud Engineer Requirements:\nDegree in computer science or a similar field.\nAt least 1-2 years of experience in the field of cloud computing.\nExperience with CI/CD systems.\nAzure, AWS, and GCP certifications preferred.\nTroubleshooting and analytical skills.\nGood communication and collaboration skills.\nJob Type: Full-time\nPay: ₹350,000.00 - ₹950,000.00 per year\nBenefits:\nProvident Fund\nSchedule:\nDay shift\nMonday to Friday\nSupplemental pay types:\nPerformance bonus\nYearly bonus\nAbility to commute/relocate:\nBengaluru, Karnataka: Reliably commute or planning to relocate before starting work (Required)\nExperience:\nCloud infrastructure: 1 year (Preferred)\nWillingness to travel:\n100% (Required)\nExpected Start Date: 10/07/2023",
        "Job Link": "/company/Infolink-Technologies/jobs/Cloud-Engineer-cbe8b6c2557ff058?fccid=d369b6e88afdc118&vjs=3",
        "state": "Karnataka"
    },
    {
        "Title": "Cloud Engineer",
        "Location": "Bengaluru, Karnataka",
        "Company": "Hewlett Packard Enterprise",
        "Salary": "4500000",
        "Sponsored": "",
        "Description": "Cloud Engineer\n\nThis role has been designated as ‘Edge’, which means you will primarily work outside of an HPE office.\nJob Description:\n\nWho We Are:\n\nHewlett Packard Enterprise is the global edge-to-cloud company advancing the way people live and work. We help companies connect, protect, analyze, and act on their data and applications wherever they live, from edge to cloud, so they can turn insights into outcomes at the speed required to thrive in today’s complex world. Our culture thrives on finding new and better ways to accelerate what’s next. We know diverse backgrounds are valued and succeed here. We have the flexibility to manage our work and personal needs. We make bold moves, together, and are a force for good. If you are looking to stretch and grow your career our culture will embrace you. Open up opportunities with HPE.\nIntelligent Edge is helping some of the world’s largest and most exciting companies modernize their networks for a digital future. Through Aruba (an HPE Company), we’re providing next-generation network access solutions for the mobile enterprise – creating new customer experiences by building intelligent spaces and digital workspaces.\n\nWhat you’ll do:\nResponsibilities\nUnderstand the overall architecture of the data flow in the data pipeline\nBuild and Maintain data pipelines for PoCs/Analytics/Data Science\nPrepare, maintain and optimize data using automation for easier consumption as per team's dynamic requirements\nResponsible for data reliability, efficiency, and quality\nManage multiple cloud environments\nResearch and Develop tools for cloud infrastructure\nCollaborate with other teams for data pipeline issues and resolution\nFlexible in timings to work with global teams\nProvide guidance and mentoring to less- experienced staff members\nWhat you need to bring:\nEducation and Experience Required\nBachelor's or Master's degree in Computer Science (or equivalent)\n2-4 years of experience\nKnowledge and Skills\nUnderstanding of big data pipelines and distributed computing\nHands-on experience in building or maintaining data solutions using Kafka/Spark/Hadoop/Cassandra or similar technologies in public and hybrid cloud environments.\nExposure to Visualization tools\nExperience working in any of the cloud computing environments such as AWS, Azure and GCP.\nExperience in one or more of programming/scripting languages such as Scala/Java/Python\nExposure to Kubernetes/Docker/Containers, Message queues, NoSQL Databases, Hadoop architecture, ElasticSearch, Cloud platforms (such as AWS Cloud, Azure, GCP, Data Center software) is a plus\nExperience in one or more Deployment tools such as Ansible, Chef, Puppet\nExperience in using CI/CD pipelines\nGood knowledge in Linux and shell scripting\nGood understanding of networking technologies and agile software development\nAbility to learn new technologies quickly\nStrong analytical thinking, logical reasoning and problem-solving skills\nStrong written and verbal communication skills\nWhat we can offer you:\nA competitive salary and extensive social benefits\nDiverse and dynamic work environment\nWork-life balance and support for career development\nAn amazing life inside the element!\nWant to know more about how you can make your mark with us?\nThen let’s stay connected!\nhttps://www.facebook.com/HPECareers\nhttps://www.instagram.com/HPECareers/\nhttps://twitter.com/HPE_Careers\n#India #aruba\nHPE is an Equal Employment Opportunity/Veterans/Disabled/LGBT and Affirmative Action employer. We are committed to diversity and building a team that represents a variety of backgrounds, perspectives, and skills. Our goal is to be one global diverse team that is representative of our customers, in an inclusive environment where we can continue to innovate and grow together.\nJob:\nEngineering\nJob Level:\nIntermediate\n\nHewlett Packard Enterprise is EEO F/M/Protected Veteran/ Individual with Disabilities.\n\nHPE will comply with all applicable laws related to employer use of arrest and conviction records, including laws requiring employers to consider for employment qualified applicants with criminal histories.",
        "Job Link": "/rc/clk?jk=90bc1454254edec8&fccid=216eb700022de6f6&vjs=3",
        "state": "Karnataka"
    },
    {
        "Title": "Cloud Engineer - Azure",
        "Location": "Remote in Noida, Uttar Pradesh",
        "Company": "Noventiq",
        "Salary": "600000",
        "Sponsored": "",
        "Description": "Noventiq is hiring!\n\nNoventiq’s story is one of change. We grew, expanded, and adapted, learning more at each step. Now effecting change is at the heart of everything we do. And that doesn't just apply to our customers, it’s how we feel about everyone who works with us.\n\nNoventiq (the brand name of Cyprus-registered Softline Holding plc) is a leading global solutions and services provider in digital transformation and cybersecurity, headquartered and listed in London. The company enables, facilitates, and accelerates digital transformation for its customers’ businesses, connecting 75,000+ organizations from all sectors with hundreds of best-in-class IT vendors, alongside its services and solutions.\nWith a turnover of US$ 1.1 billion in the fiscal year of 2021, Noventiq is currently one of the fastest-growing companies in the sector. In October 2021, the company \"Softline Holding plc\" got its primary listing on the London Stock Exchange (LSE: SFTL). Noventiq’s growth is underpinned by its three-dimensional strategy to expand its geography, portfolio, and sales channels. The strategy is supported by Noventiq's active approach to M&As, enabling the company to take advantage of the ongoing consolidation in the industry. Since the start of the calendar year 2022, Noventiq has announced the acquisition of 5 companies in India, Turkey, and the UAE, covering various aspects of digital transformation.\nNoventiq's 3900 employees work in almost 60 countries throughout Asia, Latin America, Eastern Europe, and Africa—markets with significant growth potential.\n\nJob Overview\nAs an Azure Cloud Engineer, you will be responsible for designing, implementing, and managing cloud-based solutions using Microsoft Azure cloud platform. You will work closely with cross-functional teams, including development, operations, security, and architecture, to design and deploy scalable, secure, and reliable cloud infrastructure and services. You will also be responsible for optimizing and troubleshooting cloud environments, implementing best practices for cloud architecture and operations, and ensuring the availability and performance of cloud-based applications and services.\n\nWhat you'll do:\n\nDesign, implement, and manage cloud-based solutions using Microsoft Azure cloud platform, including virtual machines, virtual networks, storage accounts, databases, and other Azure services.\n\nCollaborate with development, operations, security, and architecture teams to design and deploy scalable, secure, and reliable cloud infrastructure and services for various applications and workloads.\n\nImplement and manage Azure networking services, such as virtual networks, load balancers, VPN gateways, ExpressRoute, and Azure DNS, to ensure optimal connectivity and performance.\n\nOptimize and troubleshoot cloud environments, including identifying and resolving performance, security, and availability issues, and implementing best practices for cloud architecture and operations.\n\nImplement and manage cloud security measures, including access controls, network security groups, virtual network service endpoints, firewalls, encryption, and other security features, to protect cloud-based applications and data.\n\nMonitor and manage Azure resources and services using Azure Monitor, Azure Log Analytics, Azure Automation, and other Azure management tools to ensure proactive monitoring, alerting, and automation of cloud operations.\n\nImplement and manage backup and disaster recovery strategies for cloud-based applications and services, including Azure Backup, Azure Site Recovery, and other Azure disaster recovery services.\n\nCollaborate with development teams to implement CI/CD pipelines for deploying applications and services to Azure, using Azure DevOps, GitHub Actions, or other CI/CD tools.\n\nProvide technical expertise and guidance to other team members and stakeholders on Azure cloud platform, services, and best practices.\n\nStay up-to-date with the latest cloud computing technologies, trends, and best practices, and provide recommendations for improving cloud architecture and operations.\n\nDocument cloud architecture, processes, procedures, and best practices, and create operational documentation, including runbooks and standard operating procedures (SOPs).\n\nProvide 24x7 support for cloud-based applications and services, including participating in on-call rotation and responding to incidents and outages in a timely manner.\n\nWhat we offer:\nInsurance – Group Medical Coverage, Group Personal Accident, Group Term Life Insurance\nRewards and Recognition Program, Employee Referral Program, Wellness Program, and CSR Initiatives\nMaternity and Paternity Leaves\nCompany Sponsored Certification Program\nLearning/Development Courses, Cross Skill, Mentorship, and Leadership Programs\nQuarterly Performance Feedback Sessions\nSavings, Investments, and Retirement Benefits\nFlexible Work Hours, Work from Home, Remote Working, Hybrid Working\nCompany Onsite / Fun Events.\nDon’t forget to include your CV and cover letter. We receive a lot of applications, but we try to notice each of our potential candidates.",
        "Job Link": "/rc/clk?jk=044b9c062c492e1c&fccid=0496db2528882d73&vjs=3",
        "state": "Uttar Pradesh"
    },
    {
        "Title": "Full Stack Developer",
        "Location": "Gurgaon, Haryana",
        "Company": "Indigo Airlines",
        "Salary": "400000",
        "Sponsored": "",
        "Description": "Position Summary\nAt Indigo, cloud computing continues to allow us to modernize and consolidate IT infrastructure, automate workloads, and pursue next-generation innovation. To continue this transformation, we’re seeking an full stack developers who will be part of our Cloud COE and perform cloud native development. The ideal candidate should be skilled in full lifecycle development and well versed with modern software development toolset, strategies. and ability to customize them to help our App innovation and modernization goals.\nObjectives of this Role\nWork in tandem with Cloud Engineering team to identify, refactor and migrate application workloads in the most optimal cloud-based platforms.\nEnsure application performance, uptime, and scale, maintaining high standards of code quality and thoughtful design.\nDevelop cloud native applications for new business requirements.\nJob Key Responsibilities\nDevelop and implement technical design for building and deployment applications, including large-scale data processing, computationally intensive statistical modelling, and advanced analytics\nParticipate in all aspects of the software development life cycle for Cloud solutions, including planning, requirements, development, testing, and quality assurance\nAutomating Deployment and Scale of IaaS/PaaS/SaaS based Solution, automate CI/CD pipeline, and scale workload deployments.\nRefactoring a monolith-based application to microservices.\nDefine best in class standards to aid in guiding microservices based architectural decisions.\nTest, evaluate and recommend technologies to improve our overall solutions.\nEmploy exceptional problem-solving skills, with the ability to see and solve issues before they affect business productivity\nRequired Skills and Qualifications\n3+ years of experience / training in developing and implementing solutions on full lifecycle software development.\nUnderstanding of and experience with the five pillars of a well-architected frameworks\nUnderstanding of 12 factor app methodology for building distributed applications that runs in the cloud and delivered as a service.\nExperience in several of the following areas:\nImplementation of low-latency, high-availability, highly scalable and performant applications.\nIntegrate software components into a fully functional software system\nImplementation of security and data protection\nDocument and maintain software functionality",
        "Job Link": "/rc/clk?jk=b43ce969338adb45&fccid=4993995581bf84f9&vjs=3",
        "state": "Haryana"
    },
    {
        "Title": "Technijian seeks a seasoned and capable IT Support Engineer",
        "Location": "Panchkula, Haryana",
        "Company": "Technijian Inc.",
        "Salary": "4000000",
        "Sponsored": "",
        "Description": "If these words resonate with you keep reading: Analytical - Problem Solver - Disciplined - Serious - Formal - Inquiring - Accountable - Introspective\nAbout us\nTechnijian has been offering Managed IT Services for nearly 22 years. We have clients throughout the USA and are based in Irvine and India to offer 24/7 support. We provide our customers with cloud computing, cybersecurity, server/networking consultation, and implementation. We pride ourselves on being an employee-focused company that promotes upper mobility, and a friendly, learning, and welcoming environment that can foster your skillset.\nSummary\nThe duties of this job require a high degree of specialized expertise and skill in maintaining established standards of quality and accuracy. Drive, determination and a self-disciplined approach to achieving results that meet these established criteria are necessary for successful job performance. The job environment is structured, and job expectations are clear. While the pace of the work is faster than average, quality is never compromised. The focus of communication and organizational relationships is based on technical expertise. The work requires specialized technical problem solving and ingenuity while working within approved organizational systems and technology, and the demonstration of the values of integrity, quality and caution. New ideas and concepts are also important but will be carefully analyzed and tested before communication and adoption. If the job involves managing others, there is a need for someone who can exercise the necessary authority to assure policies and procedures are followed and time frames are met. At the same time, it will be necessary to give subordinates structured opportunity to develop their own expertise and capability for quality work to assure effective delegation and shared responsibility for work output. It is expected that coaching and training support for achieving effective delegation will be required. The position encompasses a defined span of control and opportunity for someone who engenders trust, demonstrates a sense of urgency and assures consistent achievement of quality standards. The work requires making decisions that support company guidelines authoritatively and quickly.\nJOB CHARACTERISTICS\nVaried activities Multiple, simultaneous projects Fast-paced environment\nTechnical, analytical focus Work within established standards and guidelines Expertise-based problem solving.\nAuthoritative, quick decision making within defined span of control Based on accepted quality standards, policies and procedures Important to also train others to make correct decisions.\nCommunication is task based, technically oriented Team roles are clearly defined Need for collaboration is minimal, when necessary, it is focused on specific tasks or problems.\nLeadership based on specialty expertise Directive leadership to assure quality standards are met Delegation infrequently required, and when required, close follow-up is essential.\nRequirements:\nExperience with troubleshooting and deploying Windows 2012, 2016 & 2019 Servers\nInstalling, troubleshooting, and managing Microsoft products (Windows 10, and MS Office application suite) as well as Macs\nExperience with Office 365 and G-Suite\nExperience troubleshooting email related issues.\nImplementing client/server applications architecture\nExperience in Networking / Routing / TCP-IP\nExperience VMWare\nExperience in Administration of Exchange and SQL Server\nImplementing network software and hardware upgrades (Cisco Meraki; Sophos)\nConfiguration, management, and troubleshooting skills for routers, switches, and firewalls.\nImplementing and migrating legacy infrastructures to AWS/AZURE\nPlease also tell us about yourself with this short survey (takes about 16 minutes)\nhttps://assessment.predictiveindex.com/bo/DG63/Level3\nJob Type: Full-time\nPay: ₹20,000.00 - ₹35,000.00 per month\nBenefits:\nHealth insurance\nPaid time off\nSchedule:\nMonday to Friday\nSupplemental pay types:\nShift allowance\nAbility to commute/relocate:\nPanchkula, Haryana: Reliably commute or planning to relocate before starting work (Required)\nExperience:\nIP networking: 5 years (Required)\nVMWare: 5 years (Required)\nMicrosoft Windows Server: 5 years (Required)\nActive Directory: 5 years (Required)\nLicense/Certification:\nCCNA (Required)\nWork Location: In person",
        "Job Link": "/pagead/clk?mo=r&ad=-6NYlbfkN0D4RYeO-worQkdzX-SZzfDRUdWWv2n9_h5NrcafzUFHmSE77u2GPftunxBW4jTYE3KyxbxtOE8so6wSjJKk9gw3wf7evvlSaV48eL49sshoF-_JciufoV6EMuIPJDUUYgxgh7XlCxtX5lCsTS0OK71XjOZIs2J25EjojG0o3QZnErKTkllCs5G9PUqp0u6r-BVGNOe3awAUc7PwgGsd3dVhPV3xcPwWgDQceIcjuV2Ga462QQlXyF9AZMdMvRlrgKgb2RGeMmo6wpvZIDFaBfyJ0cn6jxCSWaBRCvF5Y6AFyBkwJoiQh3npfnQxbAfQL-ZMmPQpO3Kl7uwq7NgYDbYHe15QOJ603PGLuvI8c_2ukZUUOWtHf65Vre_cFWIzJDLNlqG3xoD2BcJpnfAvDsekY1HGt6mqcjN2WSv3cTSlJXDj972bs8Vx_ZvBWX2UGlQVtEp6Sil1DNrl-PZ7q0NCOXi8CShns94whflZodWPvpMK2vdb_sALFUOTgACJpOzOFLm93lzG8HhM2WAXqAMY7b5wSBHlOjrPFiN_E8LThETmJa9SaAlV-klBq3UfDBU=&xkcb=SoBI-_M3NjYm8BgMIb0GbzkdCdPP&p=13&fvj=1&vjs=3",
        "state": "Haryana"
    },
    {
        "Title": "Cloud Application Development Engineer",
        "Location": "Hybrid remote in Bengaluru, Karnataka",
        "Company": "INTEL",
        "Salary": "200000",
        "Sponsored": "",
        "Description": "Job Description\n\nDevelops applications that work in and on industry or hybrid cloud environments using capabilities and frameworks from internal and external cloud providers. Develops and coordinates cloud architecture over various areas, including application development, identity and access management, network and data management, and security. Defines the initial DevSecOps solution and links it to the cloud platform. Utilizes DevOps processes, automation, culture, and target platforms. Leverages expertise in cloud platforms including Amazon Web Services, Google Cloud, Azure, building and designing web services in the cloud, orchestrating and automating cloudbased platforms, as well as frontend development of the user interface that typically run over various form factors including mobile and PC. Utilizes HTML, JavaScript libraries, responsive, and/or AWS frameworks.\nQualifications\n\nBS in CS with 2+ years of experience and MS in CS with 3+ years of experience Skillset: Programming language (ex: GO, Java, C/C++, Python); Scripting languages (Java Script, type Script); Familiarity with UX frameworks like Angular, Vue, React. Microservices architecture design and concepts, including cloud computing infrastructure and understanding of large-scale IaaS, PaaS, SaaS Security concepts: Cryptography, Key/certificate management, Identity and Access management Additional: Cloud-native application development platforms such as Kubernetes, Docker, Open Stack; Agile and Test driven development (Git, CI/CD, Jira) Strong interpersonal, communication and results-oriented skills\nInside this Business Group\n\nIntel Security Architecture and Engineering (SAE) is chartered with developing a comprehensive understanding of current and future security threats, guiding research, and developing solutions and mitigations. SAE develops security architecture and implementation across Intel products.\nPosting Statement\n\nAll qualified applicants will receive consideration for employment without regard to race, color, religion, religious creed, sex, national origin, ancestry, age, physical or mental disability, medical condition, genetic information, military and veteran status, marital status, pregnancy, gender, gender expression, gender identity, sexual orientation, or any other characteristic protected by local law, regulation, or ordinance.\nBenefits\n\nWe offer a total compensation package that ranks among the best in the industry. It consists of competitive pay, stock, bonuses, as well as, benefit programs which include health, retirement, and vacation. Find more information about all of our Amazing Benefits here: https://www.intel.com/content/www/us/en/jobs/benefits.html\n\nIt has come to our notice that some people have received fake job interview letters ostensibly issued by Intel, inviting them to attend interviews in Intel’s offices for various positions and further requiring them to deposit money to be eligible for the interviews. We wish to bring to your notice that these letters are not issued by Intel or any of its authorized representatives. Hiring at Intel is based purely on merit and Intel does not ask or require candidates to deposit any money. We would urge people interested in working for Intel, to apply directly at https://jobs.intel.com/ and not fall prey to unscrupulous elements.\nWorking Model\n\nThis role will be eligible for our hybrid work model which allows employees to split their time between working on-site at their assigned Intel site and off-site. In certain circumstances the work model may change to accommodate business needs.\n\nJobType\nHybrid",
        "Job Link": "/rc/clk?jk=b8d9f444fa13ff68&fccid=936367796261bd6e&vjs=3",
        "state": "Karnataka"
    },
    {
        "Title": "Cloud Developer",
        "Location": "Pune, Maharashtra+1 location",
        "Company": "Hewlett Packard Enterprise",
        "Salary": "",
        "Sponsored": "",
        "Description": "Cloud Developer\n\nThis role has been designated as ‘Edge’, which means you will primarily work outside of an HPE office.\nJob Description:\n\nWho We Are:\nHewlett Packard Enterprise is the global edge-to-cloud company advancing the way people live and work. We help companies connect, protect, analyze, and act on their data and applications wherever they live, from edge to cloud, so they can turn insights into outcomes at the speed required to thrive in today’s complex world. Our culture thrives on finding new and better ways to accelerate what’s next. We know diverse backgrounds are valued and succeed here. We have the flexibility to manage our work and personal needs. We make bold moves, together, and are a force for good. If you are looking to stretch and grow your career our culture will embrace you. Open up opportunities with HPE.\nHPE GreenLake Platform Cloud (GLCP) team allows you the opportunity to collaborate with both creative and engineering types to build HPE’s next generation cloud platform. Combining agile methodologies and a continuous integration and delivery pipeline, the GreenLake Cloud Platform partners with all of HPE and powers HPE’s transformation as a true cloud-native provider. It’s the cloud that comes to you!\nOn the GLCP team you will build innovative cloud platform capabilities that enables the delivery of rich HW and SW aaS solutions to customers.\nWhat you’ll do:\nContributes to the building products from the ground up to meet the needs of mission-critical applications, and seeks innovative approaches to deliver end-to-end technical solutions to solve customer problems.\nResearch and apply technical concepts to break down complex data and to engineer new ideas and methods for solving, prototyping, designing, and implementing cloud-based solutions.\nCollaborate with project managers and development partners to ensure effective and efficient delivery, deployment, operation, monitoring, and support of Cloud engagements.\nContributes business value knowledge to help the project teams drive the development of innovative service offerings that enrich HPE's Cloud Services portfolio across multiple systems, platforms, and applications.\nWork closely with Quality Assurance counterparts to provide code coverage and help enable testing automation.\nWork on some aspects of distributed scale out computing and storage, working with upcoming technology trends such as File systems, Volume management, data copy solutions, AWS/ GCP/ Azure, container technologies and handling deployment models across on-premise and cloud.\nContributes to the automation of build, test, and deployment processes to reduce errors and increase efficiency.\nSupport management of build and release infrastructure, including tools and servers.\nManaging and resolving build and release issues in a timely manner, or escalating appropriately.\nCreate and maintain build and release scripts within skills and capabilities to ensure the smooth and efficient delivery of software products.\nReviews and evaluates designs and project activities with senior cloud engineer or manager for compliance with systems design and development guidelines and standards\nSupports acceleration of innovation and integration of new technologies into projects and activities in the software systems design organization.\nWhat you need to bring:\nBachelor's or Master's degree in Computer Science, Information Systems, or equivalent.\nTypically 4-6 years experience in building system software.\nKnowledge and Skills:\nExperience with multiple software systems design tools and languages.\nStrong analytical and problem solving skills, and the ability to work independently are essential.\nExperience in overall architecture of software systems for products and solutions.\nDesigning and integrating software systems running on multiple platform types into overall architecture.\nEvaluating and selecting forms and processes for software systems testing and methodology, including writing and execution of test plans, debugging, and testing scripts and tools.\nStrong written and verbal communication skills; mastery in English and local language. Ability to effectively communicate product architectures, design proposals and negotiate options at business unit and executive levels.\nSome experience in implementing and debugging multithreaded data structures and algorithms.\nWhat we can offer you:\nA competitive salary and extensive social benefits\nDiverse and dynamic work environment\nWork-life balance and support for career development\nAn amazing life inside the element!\nWant to know more about how you can make your mark with us?\nThen let’s stay connected!\nhttps://www.facebook.com/HPECareers\nhttps://www.instagram.com/HPECareers/\nhttps://twitter.com/HPE_Careers\n#india #greenlakecloudplatform\nHPE is an Equal Employment Opportunity/Veterans/Disabled/LGBT and Affirmative Action employer. We are committed to diversity and building a team that represents a variety of backgrounds, perspectives, and skills. Our goal is to be one global diverse team that is representative of our customers, in an inclusive environment where we can continue to innovate and grow together.\nJob:\nEngineering\nJob Level:\nSpecialist\n\nHewlett Packard Enterprise is EEO F/M/Protected Veteran/ Individual with Disabilities.\n\nHPE will comply with all applicable laws related to employer use of arrest and conviction records, including laws requiring employers to consider for employment qualified applicants with criminal histories.",
        "Job Link": "/rc/clk?jk=389b8d8a7705526a&fccid=216eb700022de6f6&vjs=3",
        "state": "Maharashtra"
    },
    {
        "Title": "SoC Design for Test Engineer, Google Cloud",
        "Location": "Bengaluru, Karnataka",
        "Company": "Google",
        "Salary": "",
        "Sponsored": "",
        "Description": "Minimum qualifications:\n5 years of experience in DFT using electronic design automation (EDA) test tools.\nExperience working with ATE engineers (e.g., silicon bring-up, patterns generation, debug, validation on automatic test equipment, and debug of silicon issues, etc.).\nExperience with ASIC DFT synthesis, simulation, and verification flow.\nExperience in DFT specification definition architecture and insertion.\n\nPreferred qualifications:\nMaster's degree in Electrical Engineering. Experience in IP integration (e.g., memories, test controllers, Test Access Point (TAP), and Memory Built-In Self Test (MBIST)).\nExperience in SoC cycles, including silicon bring-up and silicon debug activities.\nExperience in fault modeling.\nAbout the job\nOur computational challenges are so big, complex and unique we can't just purchase off-the-shelf hardware, we've got to make it ourselves. Your team designs and builds the hardware, software and networking technologies that power all of Google's services. As a Hardware Engineer, you design and build the systems that are the heart of the world's largest and most powerful computing infrastructure. You develop from the lowest levels of circuit design to large system design and see those systems all the way through to high volume manufacturing. Your work has the potential to shape the machinery that goes into our cutting-edge data centers affecting millions of Google users.\nAs a SoC Design for Test Engineer, you will be responsible for defining, implementing and deploying advanced design-for-test (DFT) methodologies for digital and/or mixed-signal chips and/or IPs. You will define silicon test strategies, DFT architecture, and create DFT specifications for next generation SoCs. You will design, insert, and verify the DFT logic.You will prepare for post silicon and co-work/debug with test engineers. You will be responsible for reducing test cost, increasing production quality, and enhancing yield.\n\nBehind everything our users see online is the architecture built by the Technical Infrastructure team to keep it running. From developing and maintaining our data centers to building the next generation of Google platforms, we make Google's product portfolio possible. We're proud to be our engineers' engineers and love voiding warranties by taking things apart so we can rebuild them. We keep our networks up and running, ensuring our users have the best and fastest experience possible.\nResponsibilities\nOwn DFT logic, Pre-silicon verification and work with test engineers post silicon. Develop DFT strategy and architecture, including hierarchical DFT/MBIST and ATPG.\nComplete all Test Design Rule Checks and Design changes to fix TDRC violations to achieve high test quality.\nInsert DFT logic, including boundary scan, scan chains, DFT Compression, Logic BIST, TAP controller, Clock Control block, and other DFT IP blocks.\nInsert and hook up MBIST logic including test collar around memories, MBIST controllers, eFuse logic and connect to core and TAP interfaces.\nDocument DFT architecture and test sequences, including boot-up sequence associated with test pins.\nGoogle is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also Google's EEO Policy and EEO is the Law. If you have a disability or special need that requires accommodation, please let us know by completing our Accommodations for Applicants form.",
        "Job Link": "/rc/clk?jk=6dda0078dd9bebf9&fccid=a5b4499d9e91a5c6&vjs=3",
        "state": "Karnataka"
    },
    {
        "Title": "Software Engineer Intern",
        "Location": "Gurgaon, Haryana",
        "Company": "GroundTruth",
        "Salary": "",
        "Sponsored": "",
        "Description": "A bit about us\n\nGroundTruth is a media company that turns real-world behavior into marketing that delivers real business results. Using observed real-world consumer behavior, like location and purchase data, it creates targeted advertising campaigns across all screens for advertisers. GroundTruth then measures how consumers respond to the campaigns – including if they physically show up to a location or website – to understand the real business results generated by a brand's advertising. GroundTruth's proprietary Location, Place, and Visitation data sets are accredited by the Media Ratings Council and trusted by thousands of brands and their agencies.\nLearn more at GroundTruth.com.\nWe believe that innovative technology starts with the best talent and have been ranked one of Ad Age's Best Places to Work for three years in a row (2021, 2022 & 2023). Learn more about the perks of joining our team here.\n\n***Pre Placement Offers for candidates who successfully complete the internship and performs well***\n***This internship will start from January 2024 till May 2024 (NOC from the college is mandatory)\n***All the devices (Laptop, etc) will be provided by GroundTruth with best in the industry stipend of 32K to 35K per month***\n\nDay-to-day responsibilities:\nImplementing features and services for our product\nWorking / shadowing in on-going project development\nUnderstanding the requirements & implement accordingly\nGetting in touch with peers and mentors\nActive participation in providing innovative ideas and inputs\nSkill(s) required:\nData Structures and Algorithms\nOOPS Concept\nDatabase Fundamentals\nSQL\nOS Fundamentals\nNetworking Fundamentals\nGood with any one programming language: Python/C++/ Java\nBasics of HTML, CSS and JS\nCS Fundamentals\nTechnologies:\nGood to Have:\nExperience with Git and Github\nBasics of Cloud Computing\n\nQualification Required :\nB-Tech / BE / MCA Computer Science and other fields welcome 2023 & 2024 Passouts\nWe are an equal opportunity employer and value diversity, inclusion and equity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.\nApplicants with disabilities may be entitled to reasonable accommodations under applicable federal, state and/or local laws. If you need reasonable accommodations in the application process, please reach out to us at hr@groundtruth.com.",
        "Job Link": "/rc/clk?jk=2e92792f52bd6a69&fccid=455fe76584d8930b&vjs=3",
        "state": "Haryana"
    },
    {
        "Title": "Network Engineer L1",
        "Location": "Noida, Uttar Pradesh",
        "Company": "GlobalXperts",
        "Salary": "",
        "Sponsored": "",
        "Description": "Position: Network Engineer\nLocation: NCR, India\nJob Status: Full-Time\nDuration: Permanent\nLocation: 902, Tower B, Urbtech Trade Center, Sector 132, Noida, Uttar Pradesh\nAbout GlobalXperts:\nGlobalXperts is a worldwide solutions provider dedicated to supporting their customers with all phases of the solution lifecycle for advanced technologies. From small businesses to Fortune 500 companies, our customers leverage their partnership with GlobalXperts as an extension of their professional services, managed services, and field services capabilities in areas such as Data Center, Cloud, DevOps, Security, Collaboration, Contact Centers, and Enterprise Networking.\nFor more information about GlobalXperts, visit our website at www.globalxperts.net or follow us on LinkedIn.\nSummary of Position:\nThe Engineer position is a team member responsible for monitoring and managing customer internal infrastructures and their platforms under direct supervision of the Engineering Manager. The engineer will be the primary point of contact for all incidents assigned to them and retain ownership until resolution unless otherwise advised. The position is subject to shift work and a candidate would be expected to move to different shifts as needed. The Engineer will be expected to interact with customers, peers and management via phone, IM, video, and email to ensure customer issues are resolved per contracted SLA’s while documenting all actions and communication in the ticketing system, ServiceNow.\nResponsibilities:\nRemote management and proactive monitoring of Network Monitoring Tool\n24*7 NOC support to Large Global clients that have a distributed LAN, WAN setup\nshould have knowledge of ITIL standards.\nLevel 2 support for Incident Management / ticket resolution\nCreation of MOP/ SOP and planning Change management process\nPerformance tuning of network devices and creation of SOP\nWork with Telecommunication Service Providers to resolve escalated circuit problems to resolution.\nPlanning and Perform upgrade of network and security devices.\nWork with Hardware/ Software Vendors to resolve problems.\nTrain and Mentor team members\nProvide technical inputs for weekly/ monthly customer service review reports.\nWorking experience of NOC is highly appreciable.\nTechnology/Area of Specialization:\nHands on troubleshooting experience in Enterprise LAN and WAN environment.\nStrong Technical subject matter expertise on Cisco Platform Network solutions\nTechnical expertise with routing protocols (RIP, EIGRP, OSPF, BGP) and switching (VLAN, Trunking, Dot1x, various flavors of STP) protocols.\nKnowledge of MPLS and QoS , Basic knowledge of security technologies\nUnderstanding on IPSec, VPNs, GRE, NAT/ PAT over varied platforms\nExperience of working on circuit T1/ E1, T3/ E3, Ethernet) troubleshooting would be preferred.\nRouting, Switching, troubleshooting, and monitoring of network issues.\nTroubleshoot network issues (LAN & WAN) and provide corrective actions to restore the customer services\nTroubleshoot and resolve highly complex WAN issues in coordination with carriers & suppliers.\nKnowledge of Routing & Switching Protocol, Network Monitoring, and remote management tools\nKnowledge in MPLS and VPN networks.\nRequired Skills:\nBachelor’s Degree or equivalent experience\nCCNA/CCNP Certification\n6+ months working in a Network Operations Center\n6+ months experience troubleshooting infrastructure devices applicable to engineering vertical.\nA drive for Achievement and Effort, Adaptability/Flexibility, Attention to Detail, Analytical Thinking, Teamwork, Dependability, Initiative, Integrity, Persistence, Stress Tolerance.\nA history of successfully managing and operating multi-vendor environments.\nStrong interpersonal skills and expert level relationship management abilities – showcasing the ability to work well with many levels of client engineering and management.\nThe ability to function in a team environment and recognize and take on tasks with self-direction.\nPassion to continue learning and expanding your knowledge.\nGlobalXperts is a global information and communications technology company with an impeccable record for providing comprehensive, integrated Managed Services and Professional Services and excelling in Network Infrastructure Management Services (Voice, Data & Video) and other IT Infrastructure Services (End User Computing, Applications, Storage and Virtualization)\nJob Type: Full-time\nSalary: Up to ₹700,000.00 per year\nBenefits:\nFood provided\nHealth insurance\nLeave encashment\nPaid sick time\nPaid time off\nProvident Fund\nSchedule:\nNight shift\nRotational shift\nSupplemental pay types:\nJoining bonus\nOvertime pay\nShift allowance\nYearly bonus\nAbility to commute/relocate:\nNoida, Uttar Pradesh: Reliably commute or planning to relocate before starting work (Required)\nEducation:\nBachelor's (Required)",
        "Job Link": "/company/Globalxperts/jobs/Network-Engineer-e12ad96c2c9b4a2d?fccid=41d3bfedc30905bd&vjs=3",
        "state": "Uttar Pradesh"
    },
    {
        "Title": "Desktop Support Engineer",
        "Location": "Chandigarh, Chandigarh",
        "Company": "AJS Cloud India",
        "Salary": "",
        "Sponsored": "",
        "Description": "Addressing user tickets for issues regarding hardware, software, and networking.\nAssisting customers through installing applications and computer peripherals.\nProviding technical support through remote-access systems.\nProviding IT networks and customer services to users inside the company.\nGuide users with step-by-step instructions to resolve the issues.\nCustomising the desktop applications as per the needs of users and clients.\nAdvising on software and hardware upgrades.\nMaintaining a log of job tickets and maintenance tasks.\nSend the unresolved issues to the next level of the support team.\nEnsuring that the client systems are working fine.\nCreating technical reports and manuals.\nKeep up with current breakthroughs in computing technology and research its reviews.\nAbility to perform remote troubleshooting and provide clear instructions\nExcellent problem-solving and multitasking skills\nCustomer-oriented attitude\nJob Type: Full-time\nSalary: ₹20,000.00 - ₹35,000.00 per month\nBenefits:\nFlexible schedule\nPaid time off\nDay range:\nMonday to Friday\nWeekend availability\nShift:\nNight shift\nAbility to commute/relocate:\nChandigarh, Chandigarh: Reliably commute or planning to relocate before starting work (Required)\nEducation:\nDiploma (Preferred)\nExperience:\nIT (Preferred)\ntotal work (Preferred)\nSpeak with the employer\n+91 9557278862",
        "Job Link": "/company/AJS-Cloud-India/jobs/Desktop-Support-Technician-4dcbcebecb18df2b?fccid=25bb1a9f85e3be53&vjs=3",
        "state": "Chandigarh"
    },
    {
        "Title": "Cloud Setup & Support Engineer - Application Services",
        "Location": "Gurgaon, Haryana",
        "Company": "Swaran Soft Support Solutions",
        "Salary": "",
        "Sponsored": "",
        "Description": "Experience:- 2 to 3 yrs.\nAnnual Salary:- INR 5,00,000 - 10,00,000 P.A\nIndustry:- IT Software, Software Services\nLocation:- Gurgaon\nEducation:- Graduate/ BE/ B.Tech\nShift:- 09.00 AM - 06.00 PM\nJob Description:-\nAs a member of the AWS Support team, you will be at the forefront of Cloud technologies interacting with the full breadth of AWS services. Provides technical support to a wide range of customers as they build mission-critical applications on top of AWS services. Customer service experience and strong customer focus is desired.\nBasic Qualifications:-\nStrong Linux or Windows system administrator skills\nExperience with web-based applications and HTTP\nExperience operating and troubleshooting email services and SMTP\nKnowledge of client/server and distributed systems architectures\nKnowledge of large-scale storage architectures and backup/DR strategies\nOpen to working 1 weekend day in lieu of Weekday Off.\nPreferred Qualifications & Experience:-\nExperience in setting up EC2, SNS, Database Instances\nPrior 1 year working experience with AWS EC2, S3, CloudFront, SES, Storage Gateway, SQS, SNS, CloudSearch, Elastic\nTranscoder, Appstream, WorkMail\nExperience developing against and working with REST API based services\nUnderstanding of Content Delivery Networks\nUnderstanding of streaming video (H264, MP4, WEBM, HLS, Smooth Streaming)\nExperience with search engines (solr / lucene)\nExperience with Cloud architecture patterns and distributed computing concepts\nExposure to Mobile application development (iOS / Android)\nMessaging and Queueing experience\nDetailed knowledge of networking protocols: DNS, HTTP, SSL, SMTP, TCP\nExposure to security concepts / best practices\nExpertise with iperf, MTR, traceroute, dig\nExperience troubleshooting filesystem, block and object storage\nDetailed knowledge of storage protocols: iSCSI, NFS, CIFS, SMB\nExperience managing full application stacks from the OS up through custom applications\nPhysical & Mental Requirements:-\nStrong written and verbal communication\nStrong analytical skills\nDemonstrated ability to analyze a problem and identify potential causes and solutions\nDemonstrated ability to take a defined problem and develop an algorithmic solution",
        "Job Link": "/rc/clk?jk=049ee6eafcd4c10f&fccid=764096f8cb43f411&vjs=3",
        "state": "Haryana"
    },
    {
        "Title": "Senior Cloud Engineer",
        "Location": "Gurgaon, Haryana+2 locations",
        "Company": "S&P Global",
        "Salary": "",
        "Sponsored": "",
        "Description": "S&P Global Market Intelligence\nThe Role: Senior Cloud Engineer\nThe Team: The cloud team is composed of highly skilled infrastructure as code engineers spread across the globe. We help hundreds of development, operational, and other technology teams solve long-standing problems by providing engineering guidance and self-service solutions. We put a strong focus on code quality by performing frequent code reviews, automating tests, and following industry standards.\nThe Impact: The cloud team contributes to a growing library of modules that help enable teams across the organization to leverage new technology in IaC pipeline and deployment pipelines. Additionally, the cloud team develops and maintains a platform to deliver IaC with expanding functionality around security and cost optimizations. S&P is expanding its footprint into the cloud and needs creative and capable engineers to assist in transitioning applications from on-premises to appropriate cloud solutions.\n\nWhat’s in it for you:\nThe opportunity to provide innovative solutions using cloud services.\nExcellent training programs hosted directly by cloud providers.\nHelp a global organization transition to modern cloud solutions.\nContribute to an organic IaC delivery platform responsible for 24/7 service delivery.\n\nResponsibilities:\nCollaborating with engineering and development teams to evaluate and identify optimal cloud solutions.\nEducating teams on the implementation of new cloud technologies and initiatives.\nDesigning, developing and deploying modular cloud platform.\nDeveloping and maintaining cloud solutions in accordance with best practices.\nImplementing security guard rails in accordance with company policies and compliance in cloud security.\nInteracting with clients, providing cloud support, and making recommendations based on client needs .\n\nKey Qualifications:\nBachelor’s degree in computer science or adjacent field.\nAt least 3 years of experience in cloud computing and applied solutions.\nAbility to communicate complex ideas and technological concepts to peers and clients.\nExperience with Terraform 12, Python, Bash and Powershell\n\nAdditional Experience:\nAWS, Azure or cloud related certifications\nExperience running a fully managed, 24/7 cloud platform product\n\nGrade: 10\n\nThe Location: Gurgaon (Gurugram), India\n\nAbout Company Statement:\nS&P Global delivers essential intelligence that powers decision making. We provide the world’s leading organizations with the right data, connected technologies and expertise they need to move ahead. As part of our team, you’ll help solve complex challenges that equip businesses, governments and individuals with the knowledge to adapt to a changing economic landscape.\n\nS&P Global Market Intelligence partners with customers to broaden their perspective and operate with confidence by bringing them leading data sources and technologies that embed insight in their daily work.\n\nEqual Opportunity Employer:\nS&P Global is an equal opportunity employer and all qualified candidates will receive consideration for employment without regard to race/ethnicity, color, religion, sex, sexual orientation, gender identity, national origin, age, disability, marital status, military veteran status, unemployment status, or any other status protected by law. Only electronic job submissions will be considered for employment.\n\nIf you need an accommodation during the application process due to a disability, please send an email to: EEO.Compliance@spglobal.com and your request will be forwarded to the appropriate person.\n\n-----------------------------------------------------------\n\nEqual Opportunity Employer\nS&P Global is an equal opportunity employer and all qualified candidates will receive consideration for employment without regard to race/ethnicity, color, religion, sex, sexual orientation, gender identity, national origin, age, disability, marital status, military veteran status, unemployment status, or any other status protected by law. Only electronic job submissions will be considered for employment.\n\nIf you need an accommodation during the application process due to a disability, please send an email to: EEO.Compliance@spglobal.com and your request will be forwarded to the appropriate person.\n\nUS Candidates Only: The EEO is the Law Poster http://www.dol.gov/ofccp/regs/compliance/posters/pdf/eeopost.pdf describes discrimination protections under federal law.\n\n----------------------------------------------------------- IFTECH202.1 - Middle Professional Tier I (EEO Job Group)\n\nJob ID: 286997\nPosted On: 2023-07-10\nLocation: Gurgaon, Haryana, India",
        "Job Link": "/rc/clk?jk=46f6d845b3670d43&fccid=b716e44d2c6283e7&vjs=3",
        "state": "Haryana"
    },
    {
        "Title": "Azure Cloud Engineer",
        "Location": "Ahmedabad, Gujarat",
        "Company": "Techcronus",
        "Salary": "",
        "Sponsored": "",
        "Description": "Experience :5+ Years\nJob Location : Ahmedabad\nKey skills expected:\nAzure VM, App Services, Resource Groups, Subscriptions, Blob Storage, Security, Backup and Disaster Recovery\nAzure DevOps, Docker, and Terraform, CI/CD Pipeline\nContainerization and container orchestration, such as Kubernetes\nWorking knowledge of SQL databases\nExperience with automation tools, cloud computing platforms, and scripting languages\nJob description:\nExperience in Azure infrastructure setup, configuration and management.\nExperience in CI/CD pipelines development (YAML or Classic). Solid understanding of continuous integration and continuous delivery (CI/CD) pipelines.\nHands-on experience with automation tools, cloud computing platforms, and scripting languages.\nStrong knowledge of automation tools and technologies, such as Azure DevOps, Docker, and Terraform.\nKnowledge of containerization and container orchestration, such as Kubernetes.\nExperience with version control systems and GIT workflows.\nExperience with monitoring and logging tools.\nWorking knowledge of SQL databases.\nBasic understanding of networking concepts.\nThe ideal candidate will have a strong background in implementing and managing development tools and infrastructure, automating processes, and ensuring system security. In this role, you will be responsible for understanding stakeholder requirements, collaborating with software developers and engineers, and actively participating in project management decisions.\nKey Objectives:\nBuild and implement new development tools and infrastructure to streamline processes and improve efficiency.\nUnderstand stakeholder needs and effectively communicate them to developers.\nAutomate and enhance development and release processes to minimize errors and optimize customer experience.\nEnsure the security and integrity of systems against cybersecurity threats.\nIdentify technical issues and develop software updates and fixes to resolve them.\nCollaborate with software developers and engineers to ensure that development follows established processes and works as intended.\nPlan projects and actively participate in project management decisions.",
        "Job Link": "/rc/clk?jk=eefcbe27f763ece7&fccid=5f845d563f28a3c6&vjs=3",
        "state": "Gujarat"
    },
    {
        "Title": "Jr Cloud Operations Engineer",
        "Location": "India",
        "Company": "Cloud 9 Infosystems",
        "Salary": "",
        "Sponsored": "",
        "Description": "Responsibilities\nProvide Technical Support to Customer on Ticketing Issues on a Timely Basis.\nCoordinate with interfacing teams and resolve complex application and server issues.\nMonitors all production environments as a part of a 24x7x365 rotation to ensure availability\nand performance meets our SLAs\nManage and coordinate day to day activities of the Cloud Infrastructure and Support Team\nHands-on experience with minimum 2 Public Cloud environments like AWS/Azure\nAnalytical ability to establish baselines and deviation from baselines in a clear manner\nRequirements\nThis role requires a seasoned, skilled, independent, self-motivated, , who is experienced with\n24×7 mission-critical cloud infrastructure, operations, processes, tools, and best practices.\nThe ideal candidate must possess excellent communication skills, including the ability to interact\nand work with staff and leadership at all levels.\n2+Years of Experience in Cloud operations in AWS/Azure.\nA University graduate with a relevant degree within a computing discipline\nSignificant practical experience managing or supporting on-prem and public cloud\ninfrastructure, including AWS/Azure",
        "Job Link": "/rc/clk?jk=b2b87d393a2ee44d&fccid=e62efd31829fb787&vjs=3",
        "state": "Delhi"
    },
    {
        "Title": "Software Engineer III, Front End, Google Cloud",
        "Location": "Bengaluru, Karnataka",
        "Company": "Google",
        "Salary": "",
        "Sponsored": "",
        "Description": "Note: By applying to this position you will have an opportunity to share your preferred working location from the following: Bangalore, Karnataka, India; Hyderabad, Telangana, India.\nMinimum qualifications:\nBachelor’s degree or equivalent practical experience.\n2 years of experience with software development in one or more programming languages, or 1 year of experience with an advanced degree.\n2 years of experience with data structures or algorithms in either an academic or industry setting.\n\n\nPreferred qualifications:\nMaster's degree or PhD in Computer Science or related technical field.\n2 years of experience with front-end frameworks, full-stack development, and/or API development.\nExperience developing accessible technologies.\nAbout the job\nGoogle's software engineers develop the next-generation technologies that change how billions of users connect, explore, and interact with information and one another. Our products need to handle information at massive scale, and extend well beyond web search. We're looking for engineers who bring fresh ideas from all areas, including information retrieval, distributed computing, large-scale system design, networking and data storage, security, artificial intelligence, natural language processing, UI design and mobile; the list goes on and is growing every day. As a software engineer, you will work on a specific project critical to Google’s needs with opportunities to switch teams and projects as you and our fast-paced business grow and evolve. We need our engineers to be versatile, display leadership qualities and be enthusiastic to take on new problems across the full-stack as we continue to push technology forward.\nBehind everything our users see online is the architecture built by the Technical Infrastructure team to keep it running. From developing and maintaining our data centers to building the next generation of Google platforms, we make Google's product portfolio possible. We're proud to be our engineers' engineers and love voiding warranties by taking things apart so we can rebuild them. We keep our networks up and running, ensuring our users have the best and fastest experience possible.\n\nWith your technical expertise you will manage project priorities, deadlines, and deliverables. You will design, develop, test, deploy, maintain, and enhance software solutions.\nGoogle Cloud accelerates organizations’ ability to digitally transform their business with the best infrastructure, platform, industry solutions and expertise. We deliver enterprise-grade solutions that leverage Google’s cutting-edge technology – all on the cleanest cloud in the industry. Customers in more than 200 countries and territories turn to Google Cloud as their trusted partner to enable growth and solve their most critical business problems.\nResponsibilities\nWrite product or system development code.\nParticipate in, or lead design reviews with peers and stakeholders to decide amongst available technologies.\nReview code developed by other developers and provide feedback to ensure best practices (e.g., style guidelines, checking code in, accuracy, testability, and efficiency).\nContribute to existing documentation or educational content and adapt content based on product/program updates and user feedback.\nTriage product or system issues and debug/track/resolve by analyzing the sources of issues and the impact on hardware, network, or service operations and quality.\nGoogle is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also Google's EEO Policy and EEO is the Law. If you have a disability or special need that requires accommodation, please let us know by completing our Accommodations for Applicants form.",
        "Job Link": "/rc/clk?jk=77d8653fd4218eac&fccid=a5b4499d9e91a5c6&vjs=3",
        "state": "Karnataka"
    },
    {
        "Title": "Process Analyst",
        "Location": "Remote in New Delhi, Delhi",
        "Company": "Henson Group",
        "Salary": "",
        "Sponsored": "",
        "Description": "Company Overview:\nThe Henson Group is an award-winning Azure Expert Managed Service solutions company focused on selling and deploying Microsoft technologies for U.S. and international companies. For over 20 years, Microsoft and its partners have recommended the Henson Group for licensing, consulting, and managed services to corporations large and small. The company also offers competitive pay, health insurance, paid maternity & parental leave, fitness allowances, and generous Paid time off.\nAt Henson Group, we aim to unleash the potential of people and technology. Our company was built around the idea that there is only success with team success. We foster a culture of inclusion and fairness where diverse interests, experiences, and backgrounds are celebrated. We strive to empower and unleash the potential of everyone to ensure that every employee has a path to success. We're in it together to make life better for each other, our customers, our partners, and our communities.\nSpecifically, the Process Analyst will:\nHave exceptional written and verbal communication skills.\nHave worked on ITSM Ticketing Tool (ServiceNow/Jira/BMC/Autotask)\nHave 2- 4 years of working experience.\nFlexible to work in a 24x7 work environment.\nHave good knowledge of MS Word, MS Excel, and MS PowerPoint\nHave Knowledge of the ITIL Framework\nHave Knowledge of Cloud Computing (Azure Fundamentals AZ-900 Certification shall be an add-on)\nHave ITSM Process Knowledge of Handling Incidents, Problem Tickets & Change Requests.\nWork on timely follow-ups, co-ordination, and MIS/Reporting\nHave high-level problem-solving skills.\nHave strong customer focus & multi-tasking skills.\nQualifications and Requirements:\nBSc IT/BTech/MCA/MSc IT\nMS Word, MS Excel, MS PowerPoint\nMIS Reporting,\nITIL Foundation Certified\nAZ 900 Certified is preferred.\nIncident/Problem/Change Management/Service Assets & Configuration Management\nHenson Group is an equal-opportunity employer committed to Diversity, Inclusion & Belonging. Individuals seeking employment at Henson Group are considered without regard to any protected category, including but not limited to race, color, religion, national origin, age, sex, marital status, ancestry, disability, veteran status, gender identity, or sexual orientation.\nJob Type: Full-time\nSalary: ₹500,000.00 - ₹800,000.00 per year\nBenefits:\nCell phone reimbursement\nHealth insurance\nPaid sick time\nPaid time off\nProvident Fund\nWork from home\nSchedule:\nRotational shift\nUS shift\nSupplemental pay types:\nShift allowance\nApplication Question(s):\nDo you have knowledge of ITSM Ticketing Tool (ServiceNow/Jira/BMC/Autotask)\nDo you have Knowledge of the ITIL Framework?\nDo you have ITSM Process Knowledge of Handling Incidents, Problem Tickets & Change Requests?\nDo you have Knowledge of Cloud Computing?\nLicense/Certification:\nITIL Certification (Preferred)\nShift availability:\nOvernight Shift (Required)\nApplication Deadline: 27/07/2023",
        "Job Link": "/company/Henson-Group/jobs/Business-Process-Analyst-c001cf680f990cb7?fccid=255837356c852f4d&vjs=3",
        "state": "Delhi"
    },
    {
        "Title": "Senior Staff Software Engineer, Google Cloud",
        "Location": "Bengaluru, Karnataka",
        "Company": "Google",
        "Salary": "",
        "Sponsored": "",
        "Description": "Minimum qualifications:\nBachelor's degree or equivalent practical experience.\n8 years of experience in software development, and with data structures/algorithms.\n5 years of experience with design and architecture; and testing/launching software products.\n\n\nPreferred qualifications:\nMaster’s degree or PhD in Engineering, Computer Science, or a related technical field.\n5 years of experience in a technical leadership role leading project teams and setting technical direction.\n3 years of experience working in a complex, matrixed organization involving cross-functional, and/or cross-business projects.\nAbout the job\nGoogle's software engineers develop the next-generation technologies that change how billions of users connect, explore, and interact with information and one another. Our products need to handle information at massive scale, and extend well beyond web search. We're looking for engineers who bring fresh ideas from all areas, including information retrieval, distributed computing, large-scale system design, networking and data storage, security, artificial intelligence, natural language processing, UI design and mobile; the list goes on and is growing every day. As a software engineer, you will work on a specific project critical to Google’s needs with opportunities to switch teams and projects as you and our fast-paced business grow and evolve. We need our engineers to be versatile, display leadership qualities and be enthusiastic to take on new problems across the full-stack as we continue to push technology forward.\n\nWith your technical expertise you will manage project priorities, deadlines, and deliverables. You will design, develop, test, deploy, maintain, and enhance software solutions.\nGoogle Cloud accelerates organizations’ ability to digitally transform their business with the best infrastructure, platform, industry solutions and expertise. We deliver enterprise-grade solutions that leverage Google’s cutting-edge technology – all on the cleanest cloud in the industry. Customers in more than 200 countries and territories turn to Google Cloud as their trusted partner to enable growth and solve their most critical business problems.\nResponsibilities\nProvide technical leadership on high-impact projects.\nInfluence and coach a distributed team of engineers.\nFacilitate alignment and clarity across teams on goals, outcomes, and timelines.\nManage project priorities, deadlines, and deliverables.\nDesign, develop, test, deploy, maintain, and enhance large scale software solutions.\nGoogle is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also Google's EEO Policy and EEO is the Law. If you have a disability or special need that requires accommodation, please let us know by completing our Accommodations for Applicants form.",
        "Job Link": "/rc/clk?jk=ffee1ec996b4aa8d&fccid=a5b4499d9e91a5c6&vjs=3",
        "state": "Karnataka"
    },
    {
        "Title": "Software Engineer III, Networks, Google Cloud",
        "Location": "Bengaluru, Karnataka",
        "Company": "Google",
        "Salary": "",
        "Sponsored": "2000000",
        "Description": "Minimum qualifications:\nBachelor’s degree or equivalent practical experience.\n2 years of experience with software development in one or more programming languages, or 1 year of experience with an advanced degree.\n2 years of experience with data structures or algorithms.\n\nPreferred qualifications:\nMaster's degree or PhD in Computer Science or related technical fields.\n2 years of experience building networking components and products (e.g., load balancers, firewalls, NAT, SDN, switches/routers, CDN, network protocols, or caching).\nExperience developing accessible technologies.\nAbout the job\nGoogle's software engineers develop the next-generation technologies that change how billions of users connect, explore, and interact with information and one another. Our products need to handle information at massive scale, and extend well beyond web search. We're looking for engineers who bring fresh ideas from all areas, including information retrieval, distributed computing, large-scale system design, networking and data storage, security, artificial intelligence, natural language processing, UI design and mobile; the list goes on and is growing every day. As a software engineer, you will work on a specific project critical to Google’s needs with opportunities to switch teams and projects as you and our fast-paced business grow and evolve. We need our engineers to be versatile, display leadership qualities and be enthusiastic to take on new problems across the full-stack as we continue to push technology forward.\nWith your technical expertise you will manage project priorities, deadlines, and deliverables. You will design, develop, test, deploy, maintain, and enhance software solutions.\nGoogle Cloud accelerates organizations’ ability to digitally transform their business with the best infrastructure, platform, industry solutions and expertise. We deliver enterprise-grade solutions that leverage Google’s cutting-edge technology – all on the cleanest cloud in the industry. Customers in more than 200 countries and territories turn to Google Cloud as their trusted partner to enable growth and solve their most critical business problems.\nResponsibilities\nWrite and test product or system development code.\nParticipate in, or lead design reviews with peers and stakeholders to decide amongst available technologies.\nReview code developed by other developers and provide feedback to ensure best practices (e.g., style guidelines, checking code in, accuracy, testability, and efficiency).\nContribute to existing documentation or educational content and adapt content based on product/program updates and user feedback.\nTriage product or system issues and debug/track/resolve by analyzing the sources of issues and the impact on hardware, network, or service operations and quality.\nGoogle is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also Google's EEO Policy and EEO is the Law. If you have a disability or special need that requires accommodation, please let us know by completing our Accommodations for Applicants form.",
        "Job Link": "/rc/clk?jk=06ab25a289ae4a01&fccid=a5b4499d9e91a5c6&vjs=3",
        "state": "Karnataka"
    },
    {
        "Title": "Principal Architect, Google Cloud",
        "Location": "Mumbai, Maharashtra",
        "Company": "Google",
        "Salary": "6000000",
        "Sponsored": "",
        "Description": "Note: By applying to this position you will have an opportunity to share your preferred working location from the following: Mumbai, Maharashtra, India; Bangalore, Karnataka, India; Gurgaon, Haryana, India.\nMinimum qualifications:\nBachelor's degree in Computer Science or equivalent practical experience.\n14 years of experience in promoting industry relevant solutions to enterprises in the banking, financial services, and insurance verticals.\nExperience in cloud computing, cloud market, and engaged dynamics.\n\nPreferred qualifications:\nExperience in structured enterprise architecture practices, hybrid cloud deployments, and on-premise-to-cloud migration deployments/roadmaps.\nExperience in enterprise technology buying, evaluation process, building, architecting, designing and implementing global cloud-based systems.\nKnowledge of computing solutions for a particular industry (e.g., building e-commerce capabilities for a brick and mortar retailer, or building an unassisted lending platform in Banking).\nKnowledge of technology solutions.\nAbility to learn, understand, and work quickly with new emerging technologies, methodologies, and solutions in the Cloud/IT technology space.\nAbout the job\nThe Google Cloud Platform team helps customers transform and build what's next for their business — all with technology built in the cloud. Our products are engineered for security, reliability and scalability, running the full stack from infrastructure to applications to devices and hardware. Our teams are dedicated to helping our customers — developers, small and large businesses, educational institutions and government agencies — see the benefits of our technology come to life. As part of an entrepreneurial team in this rapidly growing business, you will play a key role in understanding the needs of our customers and help shape the future of businesses of all sizes use technology to connect with customers, employees and partners.\nAs a Principal Architect, you will facilitate the conversation and direct the execution of the business team by combining both technical goal and business insight. You will partner with Value Engineering in order to articulate the true total value of each technical solution and the overall business partnership with Google Cloud.\nGoogle Cloud accelerates organizations’ ability to digitally transform their business with the best infrastructure, platform, industry solutions and expertise. We deliver enterprise-grade solutions that leverage Google’s cutting-edge technology – all on the cleanest cloud in the industry. Customers in more than 200 countries and territories turn to Google Cloud as their trusted partner to enable growth and solve their most critical business problems.\nResponsibilities\nEngage with individuals in a trusted advisory capacity, leveraging industry expertise and technology goals, to influence their approach of solving business and technology issues.\nCollaborate with Customer Engineers, Delivery, Product Management, and Specialist teams.\nOwn the technical account plan for prioritized and strategic accounts, and develop a technology roadmap with Google Cloud through recommendations on enterprise architecture, integration, application infrastructure, analytics.\nPromote Google Cloud at conferences, events, and digital media.\nProvide the Account team and sales leadership with direction and guidance on account strategy and opportunity qualification.\nGoogle is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also Google's EEO Policy and EEO is the Law. If you have a disability or special need that requires accommodation, please let us know by completing our Accommodations for Applicants form.",
        "Job Link": "/rc/clk?jk=cd8d593dad89c383&fccid=a5b4499d9e91a5c6&vjs=3",
        "state": "Maharashtra"
    },
    {
        "Title": "Solutions Engineer, Google Cloud",
        "Location": "Gurgaon, Haryana",
        "Company": "Google",
        "Salary": "5000000",
        "Sponsored": "",
        "Description": "Minimum qualifications:\n10 years of experience with VMware technologies (e.g. vSphere, NSX,vSAN, HCX, etc) and their architecture and infrastructure needs.\n10 years of experience as a technical sales engineer in a cloud computing environment or in a customer-facing role including working as a member of a professional services or systems engineering team.\n\nPreferred qualifications:\nExperience in infrastructure modernization, such as it relates to big data trends and issues within businesses.\nExperience working in cloud migration, such as it relates to infrastructure and application modernization trends and issues within businesses.\nExperience with hybrid cloud deployments, and on-premises-to-cloud migration deployments.\nAbility to work with new emerging technologies, methodologies, and solutions in the Cloud/IT technology space.\nAbout the job\nThe Google Cloud Platform team helps customers transform and build what's next for their business — all with technology built in the cloud. Our products are engineered for security, reliability and scalability, running the full stack from infrastructure to applications to devices and hardware. Our teams are dedicated to helping our customers — developers, small and large businesses, educational institutions and government agencies — see the benefits of our technology come to life. As part of an entrepreneurial team in this rapidly growing business, you will play a key role in understanding the needs of our customers and help shape the future of businesses of all sizes use technology to connect with customers, employees and partners.\nGoogle Cloud accelerates organizations’ ability to digitally transform their business with the best infrastructure, platform, industry solutions and expertise. We deliver enterprise-grade solutions that leverage Google’s cutting-edge technology – all on the cleanest cloud in the industry. Customers in more than 200 countries and territories turn to Google Cloud as their trusted partner to enable growth and solve their most critical business problems.\nResponsibilities\nAssist and support Google Cloud field teams to identify and qualify business opportunities, identify key customer technical objections, and develop the strategy to resolve technical blockers.\nSupport the technical relationship with Google customers, including managing product and solution briefings, proof-of-concept work, and the coordination of any additional technical resources, including product management, engineering, and more.\nOversee delivery of published materials across the complete portfolio of Google Cloud solutions and use cases.\nHelp reflect the voice of the field to influence a data-driven vision and direction for Solutions and Use Case Definition at Google Cloud.\nPartner closely with Engineering directors, Product leaders, Sales strategy, and executive leadership to ensure solutions alignment with engineering, product priorities, and GTM priorities.\nGoogle is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also Google's EEO Policy and EEO is the Law. If you have a disability or special need that requires accommodation, please let us know by completing our Accommodations for Applicants form.",
        "Job Link": "/rc/clk?jk=7b7933f737d1f1e6&fccid=a5b4499d9e91a5c6&vjs=3",
        "state": "Haryana"
    }
]