[
    {
        "Title": "Sr. Software Developer/PHP Developer/ Software Developer/ Laravel Developer",
        "Location": "Sahibzada Ajit Singh Nagar, Ludhiana, Punjab",
        "Company": "Cyemptive Technologies India Pvt Ltd",
        "Salary": "428751",
        "Sponsored": "",
        "Description": "Required Skills:\n· Master’s and/or bachelor’s degree in computer science or equivalent.\n· Minimum of 2+ years’ experience developing PHP applications through all phases of software engineering.\n· Integration of user-facing elements developed by front-end developers\n· Build efficient, testable, and reusable PHP modules.\n· Should be able to write unit test cases for their code.\n· Solve complex performance problems and architectural challenges.\n· Integration of data storage solutions MySQL, PostgreSQL etc.\nDesired Skills:\n· Strong knowledge of PHP MVC/HMVC frameworks. Laravel is must.\n· Understanding the fully synchronous behavior of PHP.\n· Understanding of MVC/HMVC design patterns.\n· Basic understanding of front-end technologies, such as jQuery, HTML and CSS\n· knowledge of object oriented PHP programming\n· Integration of multiple data sources and databases into one system\n· Familiarity with limitations of PHP as a platform and its workarounds\n· Creating database schemas that represent and support business processes\n· Familiarity with SQL/NoSQL databases and their declarative query languages\n· Proficient understanding of code versioning tools, such as Git.\nJob Type: Full-time\nSalary: ₹428,750.74 - ₹1,432,929.64 per year\nBenefits:\nHealth insurance\nProvident Fund\nSchedule:\nDay shift\nAbility to commute/relocate:\nSahibzada Ajit Singh Nagar, Punjab: Reliably commute or planning to relocate before starting work (Required)\nEducation:\nBachelor's (Preferred)\nWork Location: In person",
        "Job Link": "/pagead/clk?mo=r&ad=-6NYlbfkN0Cu5_WWLj8rKgN00z2c6Ufipho9B5OKbBiULa1Qth1Dn1dBScNE-5ee2h3EnT-fILG8k-EsVIumPFwpehu4YZike8jAUd2yIcrJt1jUGwrYc_tihEz_pzITjOTGGnKSi7qd-4LRoTr8nqtpu0jzr4AuLhbvRP9eInWTVsHeKbku1VQ6WdVXAtEpR_GWH6NzA8EtJKX_8VpxYc8WSWCywpzSJw_7F3zfzVnmj-2DhQTIt2MoOYMsBgSBRtMUBVtI_Qpf6ssLlUkkFUeeKEfQOjFlR0PbhxfG0SmMle2q4DkBLKMshpxt0QMzFIZa6ZaHp2kmFnVuHJ-lklth_Gog6MtmM-OOOkAwmicaSdYGLzrDhZS_gdY6rseocjOAFWESq2iOK_XtNLLFQgP2eO6kiOXsb2DHGSZy1rWhFYGoYPR9SqDw-K_ExsATA7bzqdwFOsN8seMuQYPHAQ9fLhJIIlHQBO1YL96bpB3fFwD6oy8ir1SwPtOk7Q6eH0_jJoZjh86W4Dnd3OeEtskaGDCEMcKb5ZS-u8kqEo9u0mpB3H8gLAP4Q7kDLL9kvtXkkXcWCtFdsLjbaEzAeM1vULesDWvXC6Ru4ivp7Rs=&xkcb=SoBK-_M3NnQTCayS9h0LbzkdCdPP&p=0&fvj=1&vjs=3",
        "state": "Punjab"
    },
    {
        "Title": "Software Engineer, Client Ops - X Delivery",
        "Location": "New Delhi, Delhi+1 location",
        "Company": "Boston Consulting Group",
        "Salary": "500000",
        "Sponsored": "",
        "Description": "Who We Are\n\nBoston Consulting Group partners with leaders in business and society to tackle their most important challenges and capture their greatest opportunities. BCG was the pioneer in business strategy when it was founded in 1963. Today, we work closely with clients to embrace a transformational approach aimed at benefiting all stakeholders—empowering organizations to grow, build sustainable competitive advantage, and drive positive societal impact.\n\nOur diverse, global teams bring deep industry and functional expertise and a range of perspectives that question the status quo and spark change. BCG delivers solutions through leading-edge management consulting, technology and design, and corporate and digital ventures. We work in a uniquely collaborative model across the firm and throughout all levels of the client organization, fueled by the goal of helping our clients thrive and enabling them to make the world a better place.\n\nBCG X\n\nBCG X is the tech build & design unit of BCG. Turbocharging BCG's deep industry and functional expertise, BCG X brings together advanced tech knowledge and ambitious entrepreneurship to help organizations enable innovation at scale. With nearly 3,000 technologists, scientists, programmers, engineers, and human-centered designers located across 80+ cities, BCG X builds and designs platforms and software to address the world's most important challenges and opportunities. Teaming across our practices, and in close collaboration with our clients, our end-to-end global team unlocks new possibilities. Together we're creating the bold and disruptive products, services, and businesses of tomorrow.\n\nPractice Area Profile\n\nWhat You'll Do\n\nAs a part of BCG X’s Operate, you will work closely with consulting teams while supporting and maintaining software analytical projects. You will have the opportunity to leverage analytical methodologies to deliver value to BCG's Clients, Consulting (case) teams and Practice Areas (domain) through providing analytics subject matter expertise, and accelerated execution support and maintenance.\n\nYou will collaborate with case teams/clients to support and maintain analytic solutions serving client's needs. You will provide technical support through deeper understanding of relevant data analytics solutions and processes to build high quality and efficient analytic solutions.\n\nYOU’RE GOOD AT\nAnalytical technologies, Web Application Delivery and Maintenance Support\nBeing involved in all aspects of web-development maintenance by playing a critical role in design, planning, development, deployment and maintenance; help develop best practices for continual improvements\nMaintains a strong knowledge base of new tech stacks, applications, techniques, and skills\nMaintenance of Single or multi page applications for interactive Visualization or general layouts for user inputs\nMaintenance of the overall web architecture, built for speed and scalability\nEnsuring bug fixes and enhancement developments as per the requirements\nEnsuring, designing and developing APIs and ensuring that all the functional requirements are met\nOptimizing components for maximum performance across a vast array of web-capable devices and browsers\nEnsuring the technical feasibility of UI/UX designs\nIntegration of UI with the API(s)\nDevelop/Maintain code using development best practices, and an emphasis on security best practices.\nLeverage technologies to support business needs to attain high reusability and maintainability of current and newly developed system\n\nTechnical Skills (Must have):\nMinimum 1 years of Experience in React\nDemonstrated knowledge and hands on experience on projects undertaken in React\nExperience with state management libraries - Redux, Vuex, Redux-Saga/ Redux-thunk\nExpertise in JavaScript, OOPs concepts and design patterns\nExpertise in React.js and TypeScript\nExpertise in HTML5 and CSS3\nResponsive web design\nKnowledge of Bootstrap or Material UI or And Design\nKnowledge of UI component libraries to produce high-quality production apps following a high-fidelity design and a specification\nTrack record of designing, developing and supporting highly scalable, responsive web applications and services\nIntegrate UI with REST APIs to make the app production-ready\n\nTechnical Skills (Good to have):\nKnowledge of Angular 2+\nKnowledge of backend concepts e.g. Python Django, Flask or Node.js\nKnowledge of DB e.g. PostgreSQL, MySQL, MongoDB and MSSQL\nKnowledge of PWA or Hybrid Mobile app development using React Native or Ionic\nKnowledge of charting libraries like HighCharts, D3.js and Recharts\nKnowledge of cloud platform (Azure/AWS) and containerization (Docker, Kubernetes)\nKnowledge of UI design and basic wireframing skills\nPerformance Management and collaboration\nProvide exceptional support service to the case teams, product teams and to the end clients while following the best practices and highest quality standards. Assist in the overall support readiness and maintenance of the projects.\nDefining and explaining expected software outcome; defining approach and technical solution\nDelivering original analysis and insights to case teams, typically owning all or part of a project and integrating with case teams\nEstablishing credibility by thought partnering with case teams on the topics; drawing conclusions on a range of external and internal issues related to their problem\nCommunicating technical insights through sophisticated synthesis and packaging of results (including PPT slides and charts) with consultants, collects, synthesizes, analyses case team learning & inputs into new best practices and methodologies\nAbility to properly sign off and code reviews. Able to generate project work for self via connects\n\nTeam requirements:\nContribute as ‘Voice of the Team’ while working with stakeholders.\nComfortable with analytical methodologies and platforms.\nCustodian of the knowledge base; document resolutions or problem fixes and promotes IP development; creates/validate and approve the knowledge articles created by the junior colleagues/peers.\nImparts technical trainings to team members (and client IT If required)\nOperates/supports clients during European/American time zones during weekdays and weekends when required.\n\nFunctional Skills:\nEnsures the decisions are thoughtful, logical and in the best interest of the team. Ability to take calculated risks to put a conscious intent into actions. Ensures high quality deliverables from the team, validation via auditing the executions. Takes ownership of the escalations, assist in finding the root cause and implementation of the mitigation steps\nSupports and lead implementation of projects; process or automations; focussing on improvement initiatives. Manage and execute the defined tasks as per agreed timelines. Clearly communicates the updates, risks, dependencies, and closures to the stakeholders\nImplementing technical solutions(s) across on-premise and cloud architectures\nMonitoring performance and advising any necessary infrastructure changes\nCommunicating with confidence and ease:\nYou will be a clear and confident communicator, able to deliver messages in a concise manner with strong and effective written and verbal communication.\nEnsures the decisions are thoughtful, logical and in the best interest of the team. Ability to take calculated risks to put a conscious intent into actions. Ensures high quality deliverables from the team, validation via auditing the executions. Takes ownership of the escalations, assist in finding the root cause and implementation of the mitigation steps.#LI-RA1\n\nWhat You'll Bring (Experience & Qualifications)\n\nBachelor's / Master's degree in computer science engineering/technology or equivalent\n2+ years of relevant experience\nExperience of DevOps implementation across the full stack cycle\nEnd to end experience in code, deploy, manage and monitoring for enterprise solutions.\nExcellent Python coding skills and understanding of best practices, frameworks such as Django and Flask. (PEP8)\nExcellent understanding of JavaScript React\nStrong database skills in Snowflake, Azure, SQL server\nProficient with version control tools such as GitHub\nKnowledge of Big data, Apache Hadoop, Spark, Scala, PySpark, Amazon S3 and R would be considered as a big plus\nUnderstanding and desire to work in an Agile fast pace environment\nStrong problem-solving skills and willingness to deep dive to get the desired output\nExcellent troubleshooting skills required for resolution of production issues quickly\nExcellent written and verbal communication skills. Able to work effectively with cross functional teams and with senior stakeholders\nConsulting experience will be considered a plus\nUnderstanding of prevalent cloud ecosystems and its associated services AWS, Azure, Google Cloud, IBM Cloud. Expertise in at least one",
        "Job Link": "/pagead/clk?mo=r&ad=-6NYlbfkN0Ad1FFWZOsBBwBZDGouyCcICeLSd3pQct3wJ1q5dPO7JF-E5bbmw2zZCEeKO5Ucz0lZIsgeq7KFFZIcqVLoGeYUEEA7GMcEqriuzUy6EGAkcMmhi_jg-jgRW_P9R4h72WE_2QimO2c9ITlEIHKUONvsT0saHjnuflPSbCaRYpS5WJf3f_UeUMFDuCYjv1WaqSrScJze4_ov1VMqPXuCmZk32_sDlsOCPDZ-HnfFVe9B5b8cBNWZwixB9moIZgH7nBrOXOY-h7hTcbTA1KgDuxSsGEjXqqKLj4-L2zmfecAy1rSKZyKX417O6gFthMgYzMBFFVwATnfJpVn5tVLa4A_0P4bGF3Xbfx6138ZQOWWLc7Pww8f3SWIo_VgyWoSV37BgHWjCULpGWh7zbgNJG24ZVxU_D-0oeqvWhw9ptlPTYX-qkdhQep0t8SqpYTHiKV2FMAYKwALBnJIf5QxkFQOoUvl3yeWnEQy3AvZdpbAqeUYhTrlxxuYoDw1lakaz5Q5g71zSFMsUXH_1fsOcL3uXMWBN6EOuykCf-2zFNRVEn2hqXn8vIaPVYe_WK0BcinfpMzTH5ZIfWQ35PfjacvqsHyGN8oge8ldO4M6_Oo27DOKN0TdSv7V2YwODO3wROEamxLs71yw8c65KaXtOU_X_FUa3XL1cX7C7bABIQs4IphqYvXhpk5gvxnG6LsnyoZxYDZJen3o-ChlQ7WN8ijNaLsyKXbLYbezGDhPxq2g4qwnSR43b7JNx5RF8Ed2EJgaNC4EWEiV2YTbMjulCyRWUOz8Ks3kYBwjkbvi8j1zUNutjpjQ1wV_RyzbMBcIuiv7fo8o2PgOmwh1P6qjxrIEmZKjZv0IBuaXRrtVew74gyRKfzbv-R9NDDr5iQ7QPrcPJSHPhMdvHvWw-3ergFD_ktXlCMaXXtV4JfJX8RBKpTTOXbvYTlvVgtIx8ySJXk0QuOkN9gPlCaGQMpYHdH2n4OFeFkMqns6u1w90YKVq8b46nt4CvRlGrcS23Sf3kH7nkl6lgcYv03nyC0BBgnrOQaKsV0YQVQmCwP7xQ1rwyMzOlOuw43Ru8aPbrjl90rUMrzTfHPjvDk41heSIHh5tP-BKam9Kvhnmg9wCiF2oLonKBVL4U6HJdUWFF9CIG-WptYtRKqbM3pRDe9XQCCFMzjSJfObnJE9zBF35RPqnOJg==&xkcb=SoD--_M3NnQTCayS9h0KbzkdCdPP&p=1&fvj=0&vjs=3",
        "state": "Delhi"
    },
    {
        "Title": "SAS Analyst",
        "Location": "Jalandhar, Punjab",
        "Company": "ProgramWare",
        "Salary": "700000",
        "Sponsored": "",
        "Description": "Full Job Description\nLocation: Jalandhar, Punjab\nHours: Monday – Friday (9:30 PM – 5:30 AM)\nSalary: Negotiable\nStart Date: ASAP\nSummary:\nThe SAS Analyst is responsible for ensuring the programming deployment of our data collection\nmeets all requirements and is error free. The successful candidate will primarily use SAS to audit\ndata, uphold data quality and partially process data, however a wide array of skills is needed to do\nthis effectively. Due to variability and complexity of surveys, the SAS Analyst needs to be a fast and\nadaptable learner, being able to juggle between programming languages and proprietary tools\nefficiently.\nJob Description:\n Learn and develop a thorough understanding of the market research processes and tools\nused in conducting the research from a technical standpoint\n Translate the logic involved in a project into SAS codes in a timely fashion\n Generate test data and ensure its validity using SAS in accordance to the project\nspecifications\n Test, identify and resolve all the issues in the projects which can affect the collection of valid\ndata on a day-to-day basis\n Maintain the written SAS codes and the respective project documentation\n Other duties as assigned\nThe Successful Applicant:\n Absolute attention to detail and excellent follow-through\n A bachelor’s degree or higher (in Computer Science, Statistics/Mathematics, Computing or\nequivalent) with strong academic performance\n Working knowledge in SAS (SAS Base, SAS/GRAPH), Python and R\n [Plus] Knowledge in other programming languages is valued e.g. VBA, JavaScript, HTML, CSS\n Proficient in Excel and Power Point Competencies\n Good analytical abilities, ability to interrogate and model data\n Creativity and ability to think 'outside the box'\n Ability to prioritise competing demands and organise work flows clearly\n Ability to work well under pressure and meet deadlines\n Effective communication skills at all levels, able to build excellent working relationships with\nteam members\n Proved fast and keen learner - willing to ask questions when necessary\n Curious, flexible and learning-oriented\nBenefits:\n A Global Team of Individuals to help you reach your potential\n Opportunities for Career Advancement\n Training and development\n Higher than average pay\nSchedule:\n 8-hour night shift\nAbility to commute/relocate:\n Jalandhar, Punjab: reliably commute or plan to relocate before starting work (required)\nEducation:\n Bachelor's Degree\nExperience:\n Entry-level position (up to 3 years experience)\nJob Type: Full-time\nSalary: ₹174,758.60 - ₹700,000.00 per year\nBenefits:\nPaid time off\nSchedule:\nMonday to Friday\nNight shift\nWeekend availability\nSupplemental pay types:\nShift allowance\nAbility to commute/relocate:\nJalandhar, Punjab: Reliably commute or planning to relocate before starting work (Required)\nExperience:\ntotal work: 1 year (Required)\nWork Location: In person",
        "Job Link": "/pagead/clk?mo=r&ad=-6NYlbfkN0CFz5Pqm4EqVsNxd4injW_qtmgzluNMv1tj3uufpKQr_AlitJDxOX9B9Eoe3B9x0CLM5c0FGnsnRY4o3MotxapU2kh_rDtCWZfY1iAx-ZJ5hBqNukj2kqLFdT7f2TiWQfgELq4ZVAnoKOXt1NvDlR4QwE2RC4Uxibr92WoFSlitfSahr4wb1Iqm72Rqrd3bHQUI0lLIqOvMv10zLh84HdEvuNKrhoIPsCPWDnynfYJ9HlqwkdtwY3erlB7f0thu1CtTRe2Fle0s1_QE2P377cAhnY4uuzZN-b27ehXlgY110V-upLSA5HbPWbWYoK6ALRl7IH-cURI3P-VESXTVfAinnlJdGy_0Zd97JS9fngXfrviS7V7z2WipdKRTr7coPPyfTxBGkOd3qqdzR-pKz-T-HO3pMSc7v_JpXLNVGESHsDxzrJYoYrjE5fRcvasd--1mkb849zCp9CAj01oOKVT8ZNL2aCMPew-_uQto-lH4MtdLArkODMMM&xkcb=SoBj-_M3NnQTCayS9h0JbzkdCdPP&p=2&fvj=1&vjs=3",
        "state": "Punjab"
    },
    {
        "Title": "Developer, Marketing Business Intelligence",
        "Location": "Yelahanka Satellite Town, Karnataka",
        "Company": "Giant Eagle",
        "Salary": "500000",
        "Sponsored": "",
        "Description": "Job Summary\nYou will be empowered to take campaign concepts from idea to execution by developing the necessary data solutions and integrations across Giant Eagle’s Marketing Technology stack. As an expert in MarTech solutions, this technical and strategic specialist will work seamlessly across product managers, technology teams, analysts, marketing operations specialists, and business partners to understand capability requirements and bring campaign solutions to life for Giant Eagle’s 4M+ customers. The ideal candidate will have experience working within multiple marketing automation platforms (e. g. Engagement Platform, Customer Data Platform, etc.) while providing the vision and design for integrated customer engagement campaigns\nJob Description\nPrimary Job Responsibilities\nTranslate end-customer campaign brief into technical solutions and dataflows within Giant Eagle’s MarTech infrastructure\nClean, transform, and aggregate data to feed campaigns that Marketing can easily use for analysis and campaign execution\nAbility to build data models for analytic projects activities that include design, curation, and management of large datasets\nImplement scalable dataflows from multiple systems into and out of data lake and customer data platform in support of customer marketing campaigns (e. g., events-driven campaigns, personalized modules, etc.)\nWork concurrently on multiple campaigns and projects driving accuracy through all phases of the development lifecycle\nMove, enhance, govern, and enrich data from Customer Data Platform for use across cross-channel marketing campaigns and analytics\nWork collaboratively with IT teams, eCommerce teams, analytics teams, and business leaders to ensure actionable is provided key stakeholders\nBachelor's degree in Computer Science, Mathematics, or other technical field or equivalent work experience. Advanced degree a plus\nExpertise with relational databases (Oracle, SQL Server) experience with schema design and dimensional data modeling\nExperience with Retail Media Networks and Ad Tech preferred\nRole Requirements\nDesign, implement and deploy data visualization applications and mechanisms using big data technology\n2 years of experience with programming languages: python and SQL\n2+ years of experience building data visualization tools Tableau, PowerBI, and Looker with data modeling and Looker ML preferred\n2+ years of experience working in a digital marketing environment; working in Email Marketing / Lifecycle or Marketing / Sales Operations. Braze, mParticle, TradeDesk, and Google .\nUse expertise to apply various analytic methods to discover and interpret information about customer behavior from multiple data sources to implement analytics solutions\nAbility to analyze new and existing data sources and resolve data quality issues\nExperience working in developing and consuming RESTful API's\nExperience working with customer data, understanding of relational data and or has worked with databases\nExperience in delivering and launching campaigns on an integrated timeline\nExperience working in a process-driven environment and with tools such as Asana, Jira, Trello\nAssist with QA efforts for both code and logic used within templates, campaigns, and workflows\nExperience with agile or other rapid application development methods a plus\nRetail industry experience a plus\nBachelor’s degree (computer science preferred)\nAbout the Company\nSince our founding in 1931, Giant Eagle, Inc. has evolved into one of the top 40 largest private corporations in the U. S. and one of the country’s largest food retailers and distributors. With more than 37,000 Team Members and $9.7 billion in revenue, we are committed to investing in people, technology, and data to elevate our customer’s experience across multiple touchpoints. It helps us follow on our commitment to serving others and improving our communities.\nAbout Giant Eagle Bangalore\nThe Giant Eagle GCC in Bangalore is our global capability center. Our team of more than 370 members at the GCC enables us to expand internal capabilities in the areas such as data analytics, merchandising and eCommerce, quality engineering, and automation to generate insights for faster decision-making and helping us accelerate our business strategy. Our team in India plays a pivotal role in helping the company transition to new ways of working by redefining the food and grocery shopping experience for over 4.6 million customers.\nAbout Us\nAt Giant Eagle Inc., we’re more than just food, fuel and convenience. We’re one giant family of diverse and talented Team Members. Our people are the heart and soul of our company. It’s why we strive to create a nurturing environment that offers countless career opportunities to grow. Deep caring and solid family values are what makes us one of the top work places for jobs in the Greater Pittsburgh, Cleveland, Columbus and Indianapolis Areas. From our Warehouses to our GetGo’s, our grocery Stores through our Corporate home office, we are working together to put food on shoppers' tables and smiles on their faces. We’re always searching for the best Team Members to welcome to our family. We invite you to join our Giant Eagle family. Come start a lasting career with us.",
        "Job Link": "/pagead/clk?mo=r&ad=-6NYlbfkN0B9Z5kUrYpJSl1jY-NmjPX7HlwbyZlOtE5lNuYxyWYp6wH4w4oCjnyWj2mpoyouuSbZ8vDwAgB78oOMiH66oJDve_SQhK4Qm8maQABqus7Z_ZgTqyMKwSd8NIaaklkwngU4WSwS0P_KKhgFfHCGDGSIU500ED0E9FFcM42j06T6iWkiv7EooVnUnoGKeodrKTuvNe-FYFoWK_q3kokcMGBPmJkwm_2I2WAxG3ps0jp1PyzN-UymlaKR-31a2Dh0BXcw1Z5loKcj8sEAHOt276SmHxe99j2vyrD4Wx92FXx4Rt6mwLX2BOLlF8_bs-BBhtTY5Z-tCI0MQ14mMcPs2Fgo3dIC8n4ymwEoMa3x95VZzphufku2Y66c1kOt-pl_vd7YH2VEzbdwLJg1pMHseUOsnph3iVpU2wYfvLBuFdAkNqrs5VdvBd3BIZP2g8RG7FEmsBZFT73Ru4NH_w9muYuVacnc0wLUrxYFdcZ-6roB6BAvYR1mHsOM8_cUjZemIDKfzgZAkBUbQA==&xkcb=SoDX-_M3NnQTCayS9h0IbzkdCdPP&p=3&fvj=0&vjs=3",
        "state": "Karnataka"
    },
    {
        "Title": "PHP Developer",
        "Location": "Remote in Delhi, Delhi",
        "Company": "DigiOptimizer",
        "Salary": "45000",
        "Sponsored": "",
        "Description": "The Job Overview (Night Shift)\nWe are seeking a dedicated full-stack developer to join our growing company. You will be tasked with taking website template files from a designer and creating fully functional websites from them, including developing all of the necessary functionality. Responsibilities include ensuring all relevant website functionality works as expected and that the website displays well on a range of screen resolutions, from mobile to desktop.\nAs a full-stack developer, you will work as part of a team to implement new features, as well as make modifications and fix bugs in existing code. Your duties will include designing and developing layouts, writing code to power the underlying functionality of the website, and developing tests for the code you write.\nResponsibilities\nBelow are some of the responsibilities a full-stack developer is expected to assume in their position:\nArchitect brand-new software solutions to fulfill project requirements\nCreate, design, and implement layouts for new and existing web pages\nCreate and maintain database designs for data storage and processing\nMaintain legacy code written by other developers, including bug fixes\nIntegrate external software libraries and APIs into existing projects\nJob Qualifications and Skill Sets\nBelow are the qualifications and skills that are expected of a full-stack developer:\nBachelor’s degree in computer science, engineering, or a related technical field\nExcellent knowledge of front-end web programming languages, such as HTML, CSS, JavaScript, and AngularJS, with ability to render server-side and client-side content\nExcellent knowledge of one or more back-end programming languages (PHP, Java, jQuery, C#)\nFamiliarity with common programming design patterns and best practices\nExperience with common web development tools and services, such as version control software, package managers, and CI/CD pipelines\nExcellent written and verbal communication skills\nStrong attention to detail and problem-solving skills\nJob Type: Full-time\nSalary: ₹25,000.00 - ₹45,000.00 per month\nBenefits:\nWork from home\nSchedule:\nNight shift\nWeekend availability\nSupplemental pay types:\nPerformance bonus\nApplication Question(s):\nAre you comfortable working at Night shift? If not, dont apply\nWhat is your salary expectation? Without this question, your application will be rejected automatically.\nHow quickly can you join if got selected?\nEducation:\nBachelor's (Preferred)\nExperience:\nPHP: 5 years (Preferred)\ntotal work: 8 years (Preferred)\nCSS: 6 years (Preferred)\nShift availability:\nNight Shift (Preferred)\nWork Location: Remote",
        "Job Link": "/pagead/clk?mo=r&ad=-6NYlbfkN0C6ssHW2Z0D56kGhKPgxcV7nX9kLvUHsx_WjMQZODkP456FTI3Wm2w8gXLpu6kQkCSCSNrNqEpJlmW5-icUewFUdj8dWgoD7faQ2BUt4neVUTeKywmoLJW3waIyKbEodHjUZ5EHfESsZoLAmpMS65Vl-r7oHs1hnbc5Bvlty-cVXoTBZIbYqg91hKLq8ifJprShIP2x__ZvhBZfVzASKc2B1vV3SKPc82Uy6TKtK4tGsNiU7bFg6H-gQG3zjeuLmoDCgGfZthggotVcbbYEk-MWM8eLG41uu5cmTE7t-P7mkKj6PUGK3ZyRl1jReu7rQEZ9g-Pq1WzrkSacKCSz9hxYfeemvTrvZKX3LYICPQvs0FtvWMwCqalldn5aBkp_s4dKaTIBLWz88QZDgzvr8AjFztBHuCu75Lc8_muw-GCgXphUbTuv7_GhZYzPKT2hfbIKkbXWO18fV4q-EG--bQEnWXBXNoPN9ypVfDJuyvleCRezXBvwxDxepnroan2ScNg=&xkcb=SoBZ-_M3NnQTCayS9h0PbzkdCdPP&p=4&fvj=1&vjs=3",
        "state": "Delhi"
    },
    {
        "Title": "Lead Engineer",
        "Location": "Hybrid remote in Bengaluru, Karnataka",
        "Company": "Corestrat Capital PTE. LTD.",
        "Salary": "220000",
        "Sponsored": "",
        "Description": "Job Description for: LEAD ENGINEER\nEmployment Type: Full Time\nLocation: Bangalore, India.\n++++\nOUR MISSION\nCorestrat is a business services analytics company which helps businesses gather, simplify and utilize data to become more competitive through faster innovation and smarter capital investment. We are committed to the mission of helping our clients realize their full potential.\nCorestrat’s holistic decision management platform integrates advanced solutions across the risk management spectrum for primarily the banking and financial industry. We aim to create a paradigm shift by building end-to-end analytical driven risk decision solutions to optimize balanced risk reward management.\nCorestrat integrates in-depth experience in risk management with strong working knowledge in analytics, to provide value added decision analytics solutions. The company leverages an aggregated 100+ years of global business and risk analytics experience across the financial industry. Corestrat develops powerful and integrated analytical solutions that mosaics structured and unstructured data to enable a radical shift in data driven decisions.\nOUR CULTURE\nTo put it bluntly its about getting it done and owning what you do. We don’t hide behind fancy job titles or set up bureaucratic processes. Instead we treat our people equally, fairly and give them a ton of freedom and autonomy to create something unique and awesome.\nWe make mistakes, we learn from them,and we back everything up with data and logic.\nWe believe in delegating responsibility with clear expectation alignment from the outset. Our team members are accountable for delivering results commensurate to their responsibility.\nFrom engineers to marketers, were on the hunt for exceptional talent to help us scale our business and build sustainable, exciting solutions for the future.\nJOB DESCRIPTION\nResponsibilities\nWorking independently with little supervision and lead a team of full stack developers.\nTaking responsibility for own work and the dev team.\nMaking decisions that are moderate in impact; errors may have financial impact or effect on projects, operations, or customer relationships. Such errors may require involvement beyond immediate work group to correct.\nUsing verbal and written communication skills to convey information that may be complex to others who may have limited knowledge of the subject in question. Role requires negotiation and influence, cooperation, tact, and diplomacy.\nHaving an influence over key organizational decisions (e.g., is consulted by senior leadership to provide input on key decisions).\nUsing deductive and inductive problem solving; multiple approaches may be taken/necessary to solve the problem; often information is missing or incomplete; intermediate data analysis/interpretation skills may be required.\nExercising substantial creativity to innovate new processes, procedures, or work products within guidelines or to achieve established objectives. Taking responsibility for own work and the dev team.\nRequired Competencies\nKnowledge of Python, Data Structure, and algorithms.\nExperience as a backend developer with Flask, Django, etc frameworks.\nExperience in developing REST APIs and a good understanding of MVC concepts.\nExperience in system design, database design, and technologies, including web architecture. Preferably experience with Azure SQL, MS SQL Server, and Cosmos DB.\nStrong experience in working with Azure DevOps and a solid understanding of the Agile development life cycle.\nSolid understanding of software testing practices.\nCreating High-level architectures for projects, including creating/updating business requirements documentation for the product or feature ideation.\nExperience with GIT CI/CD, Azure Cloud, and Azure DevOps, including writing functional specifications and creating sprints and timelines.\nPreferred Competencies\nKnowledge of frontend (Html/CSS/Javascript/React) and application development.\nKnowledge of C# and .Net\nKnowledge of Python libraries pandas and NumPy.\nKnowledge of banking and finance.\nGraduation in Computer Science.\nQUALIFICATIONS\nWe are looking for people with the following character traits:\nYou are relentless about pursuing new knowledge and expertise. This is a core quality that all your teammates share!\nHumble yet confident in collaborating with teammates. Working together should be a pleasure, not a battle, and we can learn from each other!\nYou are a problem solver - Thrives on being able to solve some of the most complex problems in simple and elegant ways.\n· You are a thought leader –You have successfully designed solutions involving latest and greatest technologies. You are known for your attention to detail without losing the big picture and have embraced concepts of Designs and Development programming system long before they became popular. You are respected by your peers, customers, and industry.\n· You are cloud-ready – You are familiar with various aspects of cloud technologies and have successfully helped customers adopt the usage of the cloud. You have advised on and architected solutions that involve industry-leading IaaS and PaaS solutions.\n· You are a great listener - Our goal is to build solutions that last for years and continuously adapt to changing needs of the industry. You are a great listener to your customers, peers, industry trends and are receptive to what the market needs.\n· You are a collaborator - You enjoy working with multi-cultural teams, both domestic and international and find ways to get the best out of your people. You also work well with a variety of roles including core development, design, operations, and support.\n· You believe in continuous learning - Things change in our industry continuously, and you always love to learn both the underlying technology and the business motivations of our customers, constantly finding new ways to improve our solution, processes to add value for our clients.\nYou are ready to contribute to rapid growth within a dynamic, small company culture! We currently have institutional clients in India, US, UK and Singapore, and we continue to expand our horizon.\nADDITIONAL INFORMATION\nJob location options: We have offices in Singapore and Bangalore; hybrid work mode. We are looking for an independent self-starter who takes initiative and is not afraid of video calls at odd hours to accommodate our global business footprint!\nSALARY\nCompetitive and commensurate to experience\nBENEFITS\nLearning: Training reimbursement\nTime Off: Generous vacation\nWe are proud to be an equal opportunity workplace. We do not discriminate based upon race, religion, color, national origin, sex, sexual orientation, gender identity/expression, age, status as an individual with a disability, or any other applicable legally protected characteristics.\nJob Type: Full-time\nSalary: From ₹2,200,000.00 per year\nBenefits:\nFlexible schedule\nHealth insurance\nPaid sick time\nPaid time off\nProvident Fund\nSchedule:\nDay shift\nSupplemental pay types:\nPerformance bonus\nAbility to commute/relocate:\nBangalore City, Karnataka: Reliably commute or planning to relocate before starting work (Required)\nExperience:\ntotal work: 5 years (Preferred)\nExpected Start Date: 15/07/2023",
        "Job Link": "/pagead/clk?mo=r&ad=-6NYlbfkN0AdIuWnebtZMFsynnr4yvyclkA7nqAzDe2p4IWrpz64RL3jyIV5WvvHU0G2M__8FJuARxZEGYsLLBoXIVsZwO0DfPSVGSmaqldPgawHRkSE0hsLuRggbwRBvm7qCeeDumcMmX_IY6oM6dqRJZr8cbkeusjI4cEpoCuHTNNA7xLGNYohwXqne9j_lHnVcKbDDtcWkJcf3y3WLFaINGsFTKG6r0TgT6-C3tSAaYMWcyV5pi7uK3C02aZ71e2WyQylkcxPIb8Pi3YOpnK-aA_7Qoc6d1Uwc4kDqpHHJike6LwEL3uEjK2erJdDRfYaUQpZw8E560JUf7NUSVumIMuCjJyPlHEz2zy0TSX2MVoJJzY0A50YyJKTaYCXrdm0xPIMuAsc9NQlDgJp6xD5RrP3S62J-joaF1YHQp90Sb-xfxDBYpjGmZThfE6pMowg1KOeqs3z37KifIyr7JUN82-tCgUOguKQl0xIrZXZJX8m_Mz0ZTueLwheMvmo&xkcb=SoDt-_M3NnQTCayS9h0ObzkdCdPP&p=5&fvj=1&vjs=3",
        "state": "Karnataka"
    },
    {
        "Title": "Software Engineering - Internship Opportunities",
        "Location": "Pune",
        "Company": "Microsoft",
        "Salary": "500000",
        "Sponsored": "",
        "Description": "Come build community, explore your passions and do your best work at Microsoft with thousands of university graduates from every corner of the world. This opportunity will allow you to bring your aspirations, talent, potential—and excitement for the journey ahead.\n\nAt Microsoft, Interns work on real-world projects in collaboration with teams across the world, while having fun along the way. You’ll be empowered to build community, explore your passions and achieve your goals. This is your chance to bring your solutions and ideas to life while working on cutting-edge technology.\n\nMicrosoft’s mission is to empower every person and every organization on the planet to achieve more. As employees we come together with a growth mindset, innovate to empower others, and collaborate to realize our shared goals. Each day we build on our values of respect, integrity, and accountability to create a culture of inclusion where everyone can thrive at work and beyond.\nResponsibilities\nSoftware engineers (SWEs) work with teammates to solve problems and build innovative software solutions. You are passionate about customers and product quality, and you provide technical guidance to Technical Program Managers and Product Managers they consider user needs and product requirements. You will also be expected to demonstrate an ability to learn and adopt relevant new technologies, tools, methods and processes to leverage in your solutions. As a SWE, you are dedicated to design, development and testing of next-generation software which will empower every person and organization on the planet to achieve more.\n\nApplies engineering principles to solve complex problems through sound and creative engineering.\nQuickly learns new engineering methods and incorporates them into his or her work processes.\nSeeks feedback and applies internal or industry best practices to improve his or her technical solutions.\nDemonstrates skill in time management and completing software projects in a cooperative team environment.\nQualifications\nPursuing a bachelor's or master's degree in engineering, computer science or related field.\nMust have at least one additional quarter/semester of school remaining following the completion of the internship.\nOne year of programming experience in an object-oriented language.\nAbility to demonstrate an understanding of computer science fundamentals, including data structures and algorithms.\nVisit our Careers FAQ Page to learn more about the interview process and answers to commonly asked questions.\n\nMicrosoft is an equal opportunity employer. Consistent with applicable law, all qualified applicants will receive consideration for employment without regard to age, ancestry, citizenship, color, family or medical care leave, gender identity or expression, genetic information, immigration status, marital status, medical condition, national origin, physical or mental disability, political affiliation, protected veteran or military status, race, ethnicity, religion, sex (including pregnancy), sexual orientation, or any other characteristic protected by applicable local laws, regulations and ordinances. If you need assistance and/or a reasonable accommodation due to a disability during the application process, read more about requesting accommodations.",
        "Job Link": "/rc/clk?jk=44a60e0472a0ec8f&fccid=734cb5a01ee60f80&vjs=3",
        "state": "Pune"
    },
    {
        "Title": "Data Science Intern",
        "Location": "Gurgaon, Haryana",
        "Company": "Instaspaces Realtech Private Limited",
        "Salary": "500000",
        "Sponsored": "",
        "Description": "Job Description of Data Scientist Intern\nAs a Data Science Intern, you will have the opportunity to apply your analytical and problem-solving skills to real-world data challenges.\nAbout the Company:\nInstaSpaces is the biggest booking platform for professional workspaces and meeting rooms bookable hourly. InstaSpaces is the biggest provider of virtual offices for GST/business registration & mailing address in the country with a presence in all 29 states. InstaSpaces is a platform to efficiently utilize the commercial real estate of the economy through collaborative consumption. InstaSpaces offers professional workspaces with flexibility and transparency. One can book from 1 hour to months just at the tap of a button, without any lock-in periods or hefty security deposits. Each InstaSpace comes with its standard brand promises and service guarantees.\nDuties and Responsibilities:\n1. Assist in collecting, cleaning, and analyzing large datasets from various sources to ensure data quality and integrity.\n2. Research and Experimentation: Stay up-to-date with the latest data science techniques, tools, and methodologies to suggest innovative approaches and solutions and explore their application to improve existing models and processes.\n3. Data Privacy and Security: Adhere to data privacy regulations and maintain the confidentiality and security of sensitive data throughout the internship.\n4. Recover the data that has been lost.\n5. Has to make process around no data loss.\n6. Makes system/software around data management.\n7. Has to study the reason of data loss.\nRequirements:\n1. Pursuing a bachelor's or master's degree in a quantitative field such as Data Science, Computer Science, Statistics, Mathematics, or a related discipline.\n2. Proficient in data manipulation, analysis, and interpretation.\n3. Data visualization\n4. Excellent verbal and written communication skills to present findings and insights to both technical and non-technical audiences.\n5. Strong organizational skills to manage multiple tasks and prioritize work effectively while maintaining accuracy and attention to detail.\n6. Continuous Learning: Eagerness to learn and adapt to new technologies, tools, and methodologies in the field of data science.\nPerks:\nCertificate\nLetter of recommendation\nFlexible working hours\nInformal dress code\n6 days a week\nStipend - Rs 5000/month\nDuration - 3 months\nLocation - Gurgaon\nJob Type: Full-time\nSalary: ₹5,000.00 per month\nSchedule:\nDay shift\nAbility to commute/relocate:\nGurgaon - 122001, Haryana: Reliably commute or planning to relocate before starting work (Required)\nEducation:\nBachelor's (Preferred)",
        "Job Link": "/company/Instaspaces-Realtech-Private-Limited/jobs/Data-Science-Intern-777aa21c8ef4c544?fccid=8ad3d2a0d3408f9d&vjs=3",
        "state": "Haryana"
    },
    {
        "Title": "We are Hiring – Data Science / ML Engineer",
        "Location": "New Delhi, Delhi",
        "Company": "Akscellence Info Solutions",
        "Salary": "600000",
        "Sponsored": "",
        "Description": "Key Responsibilities\nBe part of teams developing Data Science / ML solutions in the areas of NLP\nCode and program at module level using languages like Python\nDevelop code at the module level with complete unit level testing and test cases\nWrite code and scripts to cleanse data and stage it for purposes of training models\nQualifications\nBachelor’s degree in Computer Science or allied discipline\nMinimum experience required is 3+ years.\nSpecialisation in areas of AI, ML, Data Science is an added advantage\nGood understanding and coding ability in at least one programming language\nDesired Qualities\nPassionate about new technology trends in managed services & aviation industry\nInquisitive and analytical mindset\nStrong and quick learnability with minimal intervention from seniors\nAbility to work collaboratively with team members, client, and OEMs\nInterested candidates please share your updated CV in MS Word format at career@akscellenceinfo.com…\nThanks in Advance…\n\nTo apply for this job email your details to career@akscellenceinfo.com",
        "Job Link": "/rc/clk?jk=0d824c8a5207bf56&fccid=10f669f326d9d7c3&vjs=3",
        "state": "Delhi"
    },
    {
        "Title": "Associate Software Engineer",
        "Location": "Bengaluru, Karnataka",
        "Company": "BOEING",
        "Salary": "700000",
        "Sponsored": "",
        "Description": "At Boeing, we innovate and collaborate to make the world a better place. From the seabed to outer space, you can contribute to work that matters with a company where diversity, equity and inclusion are shared values. We’re committed to fostering an environment for every teammate that’s welcoming, respectful and inclusive, with great opportunity for professional growth. Find your future with us.\nBoeing is the world’s largest aerospace company and a leading provider of commercial airplanes, defense, space, and security systems, and global services. Building on a legacy of over a century of innovation and leadership, Boeing continues to lead the way in technology and innovation, customer delivery, and investment in its people and future growth of aerospace.\nIn India, Boeing has been a strong partner to the Indian aerospace and defense sectors for more than 75 years. People at Boeing have been supporting mission readiness and modernization of India’s defense forces, and enabling connected, safer, and smarter flying experiences, in the sky, in the seas, and in space.\nTechnology for today and tomorrow\nThe Boeing India Engineering & Technology Center (BIETC) is a 3000+ diverse engineering workforce that contributes to global aerospace growth. Our engineers deliver cutting-edge R&D, innovation, and high-quality engineering work in global markets, and leverage new-age technologies such as AI/ML, IIoT, Cloud, ModelBased Engineering, and Additive Manufacturing, shaping the future of aerospace.\nPeople-driven culture\nAt Boeing, we believe creativity and innovation thrives when every employee is trusted, empowered, and has the flexibility to choose, grow, learn, and explore. We offer variable arrangements depending upon business and customer needs, and professional pursuits that offer greater flexibility in the way our people work. We also believe that collaboration, frequent team engagements, and face-to-face meetings bring diverse perspectives and thoughts – enabling every voice to be heard and every perspective to be respected. No matter where or how our teammates work, we are committed to positively shaping people’s careers and being thoughtful about employee wellbeing.\nAt Boeing, we are inclusive, diverse, and transformative.\nWith us, you can create and contribute to what matters most in your career, community, country, and world. Join us in powering the progress of global aerospace.\nBoeing ecommerce team is currently looking to hire Associate Software Engineer for Boeing India Engineering (BIE) Software to join their team in Bengaluru, India. This position will focus on supporting the Boeing Global Services (BGS) IT organization. The selected individual will work in the Boeing India Engineering and Technology Center (BIETC) in Bangalore, India. As an Associate Software Engineer, the selected individual will work with the Boeing India teams and its partners and stakeholders to develop, maintain and improve the ecommerce applications.\nPosition Responsibilities:\nAs an Experienced Application Development Engineer, the selected individual will work in the\nBIETC Boeing Global Services (BGS) engineering team to develop, maintain and improve Aviation software products.\nThe position involves aligning / integrating / streamlining a range of product support, maintenance and enhancement requirements and will drive technology leadership for critical design considerations and drive future integrated product roadmap.\nThe selected individual will maintain and improve application software related to aircraft and air traffic management and potentially integrate with other products to provide a world-class modeling and simulation tool suite for Boeing customers globally.\nThe selected individual will work with cross-functional teams spread across multiple products and locations within Boeing and external partners.\nThe selected individual work in an Agile Scrum team following the best practices on Software Craftsmanship such as Test-driven development and Pair Programming/Peer Reviews.\nThe selected individual will work in close cooperation - actively aligns the technical roadmap, APIs and Interaction Design, with teams based in international locations.\nThe selected individual will be responsible to create and maintain necessary software design and architecture documentation.\nThe selected individual will actively support in reducing technical debt.\nThe selected individual will be a skilled, highly professional engineer, work collaboratively with an international team comprising software development, product management, and business analysis.\nThe selected individual will also be responsible to provide support to the development of internal competency and resources for critical skill sets and be a sought-after expert that other developers can benefit from.\nThe selected individual is highly passionate about creating beautiful things with software.\nThe selected individual owns a problem until it’s solved.\nThe selected individual lays equal emphasis on testing and generating error-free software.\nThe selected individual will be responsible for coordinating and communicating regularly with experts in Boeing organizations around the world.\nSelected individual will need to support initiatives of the Boeing India organization related to engineering excellence, employee development, mentoring, customer engagement, etc…\nThe selected individual should be available to travel domestically and internationally, as required.\nEmployer will not sponsor applicants for employment visa status.\nBasic Qualifications (Required Skills/Experience): (5-8 years)\nBachelor, Master or equivalent degree preferably in Computer Science or Engineering\n5+ years of experience with last 3 years as Application developer (C, C++ or C#)\nFluent in programming languages (C, C++, VC++ [MFC], C#, Python .NET 4.0, Visual Studio IDE)\nFluent in Web Technologies (HTML, CSS, Asp.net (MVC), JQuery, JSON, AJAX, JavaScript, SQL\nServer, IIS, Bootstrap 3.0, Web services, REST API)\nFluent in Version Control systems (Subversion [SVN], GITLAB)\nExposure to QT (GUI Framework) is added advantage\nHaving experience in the Avionics Domain with evidence of a thorough understanding of requirements to solve problems and actively participates in software development is an added advantage.\nExperience and knowledge in modeling and simulation is an added advantage.\nIt would be good to have experience in developing functional requirements specification and hands-on experience using simulation model development tools.\nStrong data-oriented design, standard template library and architecture skills.\nExperience with code and data optimization.\nAble to rapidly learn and understand software by reading source code and stepping through code under a debugger.\nStrong interpersonal and communications skills.\nPassion for avionics and software development.\nCollaborate effectively with a team of engineers, QA, Build, UI, Doc, and Project Management.\nUnderstanding of Scrum/Agile development. Extensive experience in collaborating within an Agile team setting, working as a group to drive Epic/Feature/Story creation as well as solution design and architecture.\nSolid foundation in the deployment of scalable, low-latency, and highly available distributed systems.\nThe candidate must be a self-starter with a positive attitude, high ethics, and strong analytical and creative problem-solving skills and, a track record of working successfully under pressure in a timeconstrained environment.\nAbility to independently execute & deliver on the backlog without dependency or hand-holding.\nMust be an excellent team player.\nResponsibilities include but not limited to\nDevelop tools and applications by producing clean, efficient code.\nReview and debug code.\nPerform validation and verification testing.\nIntegrate software components into a fully functional software system.\nAutomate tasks through appropriate tools and scripting.\nCollaborate with internal teams and vendors to fix and improve products.\nDocument development phases and monitor systems.\nEnsure software is up-to-date with the latest technologies.\nIntegrate software components into a fully functional software system.\nEnsure software is up-to-date with the latest technologies.\nTypical Education & Experience:\nBachelor, Master or equivalent degree preferably in Computer Science or Engineering\n5+ years of experience with last 3 years as Application developer (C, C++ or C#)\nCandidates with Aviation related application development background will be preferred.\nRelocation:\nThis position offers relocation based on candidate eligibility.\n\nExport Control Requirements: Not an export control position\n\nEqual Opportunity Employer:\nWe are an equal opportunity employer. We do not accept unlawful discrimination in our recruitment or employment practices on any grounds including but not limited to; color, religion, national origin, gender, sexual orientation, gender identity, age, physical or mental disability, genetic factors, military and veteran status, or other characteristics covered by applicable law.\nWe have teams in more than 65 countries, and each person plays a role in helping us become one of the world’s most innovative, diverse and inclusive companies. Applicants are encouraged to share with our recruitment team any accommodations required during the recruitment process.",
        "Job Link": "/pagead/clk?mo=r&ad=-6NYlbfkN0D63QRoR8NHes0BU6XF05SdLAJ2qRn_ksMIVtdRlLGFB9iUONA4FrCC6w33WEuBxmbev-gWnYpwD-p_RYFR1kW8UJo9UXG5Sd3D6eRp4emGFtm17ToGHuf_NDBHG9FXKwjQM-fDMG3ZgMlsklMgm3i1lBa6dDcnlTTjgrGQzKndN4ooyZds2d87Eoc_XWtTkmXWdajeR2gKWNF_k4S8F5Xcoq9exo83D0JvJs11wGJXRTobot35zvWp-SCOJsVWmYizejMpwh72HH7dRbBuGyfzJj6576ti7LjI5jbbShRibJmS1FfSJvQBbWQCYJx5LpEmgOQNiSFeKoDQ3JSt54SYbE9qaAbdX7alHitZlawRbw-jUG5qK5KAznpuEtyaQAbYLnmJJxGgom2eINWutVQ2Ntl9REpUi3_mrxG20AYdOonmp1zfw6kT-Vka7SGnE44uM9dunbcyYOIAxiInbe9h2-ATN2IE1IOSwgsT_mVcZTgW2xNurhVXuAIEtXsLri05JEs28dnsCWiZxxrVMGogKTkWv-HL_ez3Kzi4WYpjeD4i0CMmGFT0cTqgPzkX4H4BLr-9YUcFkP9JmVwV0_DlAJVoaoJdAaYyX6_zR2zAMLKfehGIXdkupH1EO3F1DSyPK52OswVFC1qGfiikcx0c03IeOxM4sh7Sd2J9OSrFgtU1XF0M6DyG-bjLChFFGxqKsga2-lyKy4sCYJXCzmbAMlRueBM-UuM=&xkcb=SoCZ-_M3NnQTCayS9h0CbzkdCdPP&p=9&fvj=0&vjs=3",
        "state": "Karnataka"
    },
    {
        "Title": "Data Science - 51878295",
        "Location": "India",
        "Company": "Sage IT India",
        "Salary": "400000",
        "Sponsored": "",
        "Description": "Data Science:\nA Data Scientist is a proficient specialist who applies mathematical, problem-solving, and coding skills to manage big data, extracting valuable insights. They design tailor-made solutions from this data, aiding organizations in achieving their unique objectives and goals.",
        "Job Link": "/rc/clk?jk=cbe2878c961b9407&fccid=159914c2b3cfd876&vjs=3",
        "state": "Karnataka"
    },
    {
        "Title": "Pharmacovigilance",
        "Location": "Gurgaon, Haryana",
        "Company": "DDReg Pharma",
        "Salary": "600000",
        "Sponsored": "",
        "Description": "Ddreg Pharma Pvt. Ltd\nFull Time\nGurgaon\nPosted 2 days ago\nJob Title: PV – Trainee\nDepartment: PV\nJob Type: Full Time, Internship, Fresher\nResponsibilities:\n\nEvaluates every article to check its validity/non- Validity.\nEnsures Data entry of valid cases in PV Edge databa Coding of Events/Medical history/Laboratory test while using medical dictionary for regulatory activities (Med DRA).\nBrowse the MedDRA to code the provided term as nearest as p\nPerforms the narrative writing of ca\nTo perform random and weekly searches on every Monday of the week and share random and weekly searches with team.\nCommon trackers must be updated on daily basis and master tracker after every molecule evaluation on weekly basis\nAll virtual, one-on-one, group trainings and self-read training must be completed within time\nAll training signoffs must be signed and placed in training folder.\nAble perform write-up for PV related topic\n\nQualification:\nPharmacy or pharmaceutical science at the graduate or postgraduate level.\nMedicine at the graduate or postgraduate level.\nLocation: Gurgaon\nApplication Deadline:\nJuly 20, 2023",
        "Job Link": "/rc/clk?jk=2f8cdc6a75ee8b5c&fccid=1d5146fd6303fb3b&vjs=3",
        "state": "Pune"
    },
    {
        "Title": "Data Engineer",
        "Location": "Bengaluru, Karnataka",
        "Company": "MUFG Global Service (MGS)",
        "Salary": "700000",
        "Sponsored": "",
        "Description": "About MUFG Global Service (MGS)\nMUFG Enterprise Solutions India Private Limited (MUFG Global Service) is the Global Capabilities Centre (GCC) of Mitsubishi UFJ Financial Group (MUFG), the world's fifth largest financial institution by assets. Launched in 2020, our operations has expanded to a team of over 400 employees across three offices in Bengaluru and Mumbai. We are a global integrated centre of excellence for strategic cross-functional business solutions by offering and creating value, including: IT performance: Development for applications and middleware, support for infrastructure, cyber security and network monitoring, architecture support for supply chain finance and payments products Risk Advisory: KYC Quality Assurance and Control, AML & KYC Advisory, Governance , Issue Management, Conformance Global Business Services: Business Administration and Credit Analysis support.\nJob Description\nJob Profile\nPosition details:\nCloud Data Engineer with a strong technology background and hands-on experience working in an enterprise environment, designing, and implementing data warehouses, data lakes, and data marts for large financial institutions. In this role you will work with technology and business leads to build or enhance critical enterprise applications both on-prem and in the cloud (AWS). Successful candidates will possess in-depth knowledge of current and emerging technologies and demonstrate a passion for designing and building elegant solutions and for continuous self-improvement.\nRoles and Responsibilities:\nManage data analysis and data integration of disparate systems.\nWork with business users to translate functional specifications into technical designs for implementation and deployment.\nExtract, transform, and load large volumes of structured and unstructured data from various sources into AWS data lakes or data warehouses.\nWork with cross functional team members to develop prototypes, produce design artifacts, develop components, perform, and support SIT and UAT testing, triaging and bug fixing.\nOptimize and fine-tune data pipelines jobs for performance and scalability.\nImplement data quality and data validation processes to ensure data accuracy and integrity.\nProvide problem-solving expertise and complex analysis of data to develop business intelligence integration designs.\nConvert physical data integration models and other design specifications to source code.\nEnsure high quality and optimum performance of data integration systems to meet business solutions.\nJob Requirements:\nBachelors Degree (or foreign equivalent degree) in Information Technology, Information Systems, Computer Science, Software Engineering, or a related field. Experience in the financial services or banking industry is preferred.\n2+ Years of experience working as a Data Engineer, with a focus on building data pipelines and processing large datasets.\n2+ Years of Strong proficiency in AWS services/GCP/Azure, including AWS Glue, Redshift, EMR, RDS, Kinesis, S3, Athena, DynamoDB, Step Functions and Lambda\n2+ Years of Expertise in Hive QL, Python programming, experience with Spark,Python, Scala and Sparkfor big data processing and analysis.\nSolid understanding of data modeling, database design, and ETL principles.\nExperience working with data lakes, data warehouses, and distributed computing systems.\nFamiliarity with data governance, data security, and compliance practices in cloud environments.\nStrong problem-solving skills and the ability to optimize and fine-tune data pipelines and Spark jobs for performance.\nExcellent communication and collaboration skills, with the ability to work effectively in a team environment.\nAWS certifications on Data related specialties are a plus.\n\n4-8 years\nETL / Data Analysis / Data Integration / Data Engineering / Java / Python / C# / Node / AWS / Azure / GCP / Google Cloud Platform / SQL / Oracle / DB2 / Hive / Spark",
        "Job Link": "/pagead/clk?mo=r&ad=-6NYlbfkN0D5mXFGwCT9lo97i3gsfTR9iTAPBTm16RjVfbVH6M8QHLBEL5WYTIbi2SMoRK5m8ansgfz7fvtVHg4tQv7vWTkec5fNnZKOJYU4kD3l_kD-N5UzQznB8ynUyM3rzpEBFTx_wdc3PAEGQ8Pz45CpKmdYfcMH-bOiaUCEVAocjNF27bggDTXMUFYIa4_YNmtsWDGF022EUnX7Hp0Jhva7Xi1zb10rAflMmTAUrCBphKR-5PAEiQKaGQzqjEq5xVX9vH7kyvEl2S4gPGeH9SIQ8H8wWruiiwRgJ3zX5PfV9S_ZmMuflkI0umaQsR3RkLySJlY3mf-LbiQthgdmI9cZNL0V_33qN0JsVj839ecdM6-1pfeqrYcliXmsaWif1TDdvaYTo-Zzn8ynmA5nrBZ9O9xtb9OLmkUF_r1HD93LGH18YPdLZMjgDHsQq6XKkSDtGkpNTyB5sMc9i-Y9R2QVrZFNXfeZy1tc2JH-DQ41Jca1pf1PgUDQ8X80Uc89siDGQEMN3YzdKRmaTFxJw-5a6FXv2uBJGZa_NhA=&xkcb=SoA--_M3NnQTCayS9h0HbzkdCdPP&p=12&fvj=0&vjs=3",
        "state": "Karnataka"
    },
    {
        "Title": "Python and DAta SCIENCE Developer",
        "Location": "Mohali, Punjab",
        "Company": "A2IT",
        "Salary": "400000",
        "Sponsored": "",
        "Description": "A2IT is a leading software development company in Mohali Chandigarh with expertise in both Cloud-based Applications and Web applications. Coding experience in Python, should be able to produce high quality code. worked on requests, pillow, scrapy, nump",
        "Job Link": "/rc/clk?jk=4b223e861dda7ddc&fccid=74ff4c4aa7a6d8fb&vjs=3",
        "state": "Punjab"
    },
    {
        "Title": "Data Science Intern",
        "Location": "India",
        "Company": "Brave AI Lab",
        "Salary": "600000",
        "Sponsored": "",
        "Description": "We are looking for Data Science Interns to optimize one of the most complex Algo Trading systems in the world. Academic and/or practical background in Computer Science, Engineering, Operations Research, or Process Control is particularly relevant for this position. Experience in the integration of model-based engineering tools and/or multidisciplinary analysis & optimization is also a plus.\n\nMajor Responsibilities\nUse data analyses and statistical techniques to develop solutions and to guide business decision making\nIdentify predictors and causes of business-related problems and implement novel approaches related to forecasting and prediction\nIdentify, develop, manage, and execute analyses to uncover areas of opportunity and present written business recommendations\nCollaborate with multiple teams as a leader of quantitative analysis and where you develop solutions that utilize the highest standards of analytical rigor and data integrity\nAnalyze and solve business problems at their root\n\nBasic Qualifications\nPursuing Bachelors or equivalent degree from a top tier Technology school\nRecord of doing Projects\nMinimum 6 months of Experience in Python\nProblem-solving ability and passion for data\nExcellent communication and data presentation skills\nFluent written and spoken English\n\nPreferred Qualifications\nHands-on experience and project-based learning in computer science, engineering, or mathematics are preferred.\nAcademic experience in manipulating/transforming data, model selection, model training, cross-validation, and deployment at scale.\nAcademic or Project Experience with Machine and Deep Learning toolkits such as TensorFlow and PyTorch.\nFamiliarity with data processing with Python & SQL.\n\nBenefits\n1. Stipend of Rs 7000 and above (Depending on your performance)\n2. Onsite working\n3. Pet-Friendly offices\n4. Exam Leaves are given\n5. Flexible working Hours",
        "Job Link": "/rc/clk?jk=3d05dd5d02183025&fccid=f126c0eccc0e9a22&vjs=3",
        "state": "Karnataka"
    },
    {
        "Title": "We are Hiring – Data Science / ML Engineer",
        "Location": "New Delhi, Delhi",
        "Company": "Akscellence Info Solutions",
        "Salary": "500000",
        "Sponsored": "",
        "Description": "Key Responsibilities\nBe part of teams developing Data Science / ML solutions in the areas of NLP\nCode and program at module level using languages like Python\nDevelop code at the module level with complete unit level testing and test cases\nWrite code and scripts to cleanse data and stage it for purposes of training models\nQualifications\nBachelor’s degree in Computer Science or allied discipline\nMinimum experience required is 3+ years.\nSpecialisation in areas of AI, ML, Data Science is an added advantage\nGood understanding and coding ability in at least one programming language\nDesired Qualities\nPassionate about new technology trends in managed services & aviation industry\nInquisitive and analytical mindset\nStrong and quick learnability with minimal intervention from seniors\nAbility to work collaboratively with team members, client, and OEMs\nInterested candidates please share your updated CV in MS Word format at career@akscellenceinfo.com…\nThanks in Advance…\n\nTo apply for this job email your details to career@akscellenceinfo.com",
        "Job Link": "/rc/clk?jk=0d824c8a5207bf56&fccid=10f669f326d9d7c3&vjs=3",
        "state": "Delhi"
    },
    {
        "Title": "Manager, Clinical Data Reporting & Analytics",
        "Location": "Hyderabad, Telangana",
        "Company": "Bristol Myers Squibb",
        "Salary": "500000",
        "Sponsored": "",
        "Description": "Working with Us\nChallenging. Meaningful. Life-changing. Those aren’t words that are usually associated with a job. But working at Bristol Myers Squibb is anything but usual. Here, uniquely interesting work happens every day, in every department. From optimizing a production line to the latest breakthroughs in cell therapy, this is work that transforms the lives of patients, and the careers of those who do it. You’ll get the chance to grow and thrive through opportunities uncommon in scale and scope, alongside high-achieving teams rich in diversity. Take your career farther than you thought possible.\nBristol Myers Squibb recognizes the importance of balance and flexibility in our work environment. We offer a wide variety of competitive benefits, services and programs that provide our employees with the resources to pursue their goals, both at work and in their personal lives. Read more: careers.bms.com/working-with-us.\nBMS Hyderabad is an integrated global hub where our work is focused on helping patients prevail over serious diseases by building sustainable and innovative solutions. This important science, technology, and innovation center will support a range of technology and drug development activities that will help us usher in the next wave of innovation.\nFunctional Area Description\nCDR&A is responsible for the ingestion, transformation and delivery of clinical data to internal stakeholders, primarily to Biometrics and Data Sciences. CDR&A also acts as the study interface for delivery of reports and analytics to enable effective data review, trial status and risk identification. Engagement of clinical trial functions for reporting and analytic needs. Technical SMEs to ensure expert consultation on data modeling, transformation, and best-fit reporting tools.\nPosition Summary / Objective\nThis position is dedicated to the Reporting & Analytics Delivery function within Clinical Data Reporting & Analytics. The Manager, Clinical Data Reporting & Analytics will contribute to the improvement of clinical data review and cleaning efficiency by providing innovative and forward thinking reporting solutions. Inspire new and creative ways to meet data review objectives. Serve as a primary report delivery contact for stakeholders including data management, clinical data reviewers and physicians. Identify opportunities for analytic support within the data review community. Interpret and translate business needs into tangible reporting solutions. Drive the development and implementation of new reporting tools as applicable.\nPosition Responsibilities\nCan interpret and translate a business data review need into a tangible report/visualization\nInterface/liaise with end users\nLeverage technical expertise to define feasible solutions and understand limitations\nWill contribute to discussions to define new opportunities for data review tools\nCan translate requirements/specifications to programmers\nMay provide support and training to the user community regarding the use and implementation of new reports/visualizations, including the development of any applicable training material\nManage the report development lifecycle from inception through production delivery and post-production change\nContribute to the development of reporting prototypes for new solutions as applicable\nDegree Requirements BS computer science, programming, data management, scientific or analytic discipline\nExperience Requirements 3 years’ experience in a reporting/analytic capacity within the Pharmaceutical Industry focused in the clinical trial space\nKey Competency Requirements\nExperience with varied reporting and analytic tools such as Spotfire, Tableau, Qlik, JReview, SAS, and/or SQL\nStrong analytic and problem solving skills\nSolution oriented\nStrong understanding of relational databases and clinical trial data\nAble to communicate technical information in a non-technical fashion\nAble to work independently and in a team environment\nExperience interacting with Informatics on large scale projects\nEmphasis in Biostatistics a plus\nTravel Required Not expected\n\n#HYDDD #LI-Hybrid\nIf you come across a role that intrigues you but doesn’t perfectly line up with your resume, we encourage you to apply anyway. You could be one step away from work that will transform your life and career.\nUniquely Interesting Work, Life-changing Careers\nWith a single vision as inspiring as “Transforming patients’ lives through science™ ”, every BMS employee plays an integral role in work that goes far beyond ordinary. Each of us is empowered to apply our individual talents and unique perspectives in an inclusive culture, promoting diversity in clinical trials, while our shared values of passion, innovation, urgency, accountability, inclusion and integrity bring out the highest potential of each of our colleagues.\nOn-site Protocol\nPhysical presence at the BMS worksite or physical presence in the field is a necessary job function of this role, which the Company deems critical to collaboration, innovation, productivity, employee well-being and engagement, and it enhances the Company culture.\nBMS is dedicated to ensuring that people with disabilities can excel through a transparent recruitment process, reasonable workplace accommodations/adjustments and ongoing support in their roles. Applicants can request a reasonable workplace accommodation/adjustment prior to accepting a job offer. If you require reasonable accommodations/adjustments in completing this application, or in any part of the recruitment process, direct your inquiries to adastaffingsupport@bms.com. Visit careers.bms.com/eeo-accessibility to access our complete Equal Employment Opportunity statement.\nBMS cares about your well-being and the well-being of our staff, customers, patients, and communities. As a result, the Company strongly recommends that all employees be fully vaccinated for Covid-19 and keep up to date with Covid-19 boosters.\nBMS will consider for employment qualified applicants with arrest and conviction records, pursuant to applicable laws in your area.\nAny data processed in connection with role applications will be treated in accordance with applicable data privacy policies and regulations.",
        "Job Link": "/pagead/clk?mo=r&ad=-6NYlbfkN0C8DhssTksZ4tAWhh8LVIFF2qionQVVpONm6qYGpiaOiXgUd5OxlJfCx1ICNBKkGIXqCNwZHrRJKf3FsHzA_-e43aSSq9fCtLuDQuAhfNKOlzRPa8XMl_C7xtA-9QUqxYefwGaZ0mGln9CzSxFiD81r-0WzyuG1DzeVe187I_h7oU5V55noQ4h0yc4XmTTNSt46wjptmBhKMfgBUn0HX4kDY8acvJ7SP1-uomjPCR0N5-SFbXx5WW9I0R6DBGtikpaCKFnAq-F5oI2TFraqJ7O5rwFv6pPc9JzVgsEIwOdzpCtdGPtjpKTetzjzeKkH2iyLMpmeKjc_K8X4nfu3YIXLB20vtlu8QZKzgasV6jeuMhN-L0e2fOiBOxplhgWv2r-Kx_AqnsMlsJz-Jt_dnskrgxdtmgVFgdknFxXOL1c5lO4tl_mrnZ8UGcUBG4oQfoiJgJ8yJLqxJD0WRVE0-8D5sFhLirvFxtUqNPEyuRkOwjNtBMeXexREySSItjhjQUK_mTVui_8Fyjce7sCbfIICgAC23u4-V97rpQNbmPkrPrcdmgiNppYb9zc76pk0xaOXBsF8jgrMvmjb_nKXtisJ6C-MM4urulLnZ0-RDHfyUYoMoDEpZfT0GkymAXVZPAoTda1psYdK7fpe9kTqdz4BaR4ga8QAhqc=&xkcb=SoD2-_M3NnQvDZQHNZ0KbzkdCdPP&p=1&fvj=0&vjs=3",
        "state": "Telangana"
    },
    {
        "Title": "Data Analyst",
        "Location": "Remote in Delhi, Delhi",
        "Company": "Rudrateck Solution",
        "Salary": "800000",
        "Sponsored": "",
        "Description": "RESPONSIBILITIES:\n1. Organising data related to sales numbers, market research, telecalling activities and telecaller behaviour\n2. Developing and maintaining databases and data systems- reorganising data in readable format\n3. Using statistical tools to identify, analyze, and interpret patterns and trends in complex data sets-helpful for the diagnosis and prediction; Creating business dashboards for EDA\n4. Filter data by reviewing reports and performance indicators to identify and correct MIS/Process/Code problems\n5. Analyzing numbers of essential business channels so that business performance can be assessed & compared over period of time\n6. Assist and provide support to Business Strategist and Analyst for all the data related work and analysis\n7. Provide strong reporting and analytical information support to Sales Channel heads, Zonal heads\n8. Preparing dashboards and reports for the management stating trends, patterns, and predictions using relevant data\n9. Working with Programmers, Engineers and management heads to assist in data mining, data preparation, quality assurance, process improvement opportunities and data governance strategies\n10. Gather, understand and document detailed business requirements using appropriate tools and techniques\nREQUIREMENTS:-\nBachelor's or Master's degree in Mathematics/Statistics/Engineering- Computer Science,IT: strong hold on Analytics concepts\nAdd-on Certification/Diploma courses in data analytics would be a plus\nMinimum 1.5 years of work experience as data Analyst with working knowledge of Dashboards/BI tools- Proficient in MS-Excel- including formulas, pivot tables and vlookups & MS- Office Tools- Word, PowerPoint\nThorough knowledge of 1. database language-SQL 2. Programming language- Python for data analysis and visualizations\nWorking knowledge of Google Suit Tools- Preparing data/forms using Excel and Google Sheets, Forms- Good explanation and communication skills, Should be able to read, write and speak- English, Hindi, Marathi (optional)\nHybrid work culture\nInterview process\n- 04 level of interviews\n- HR Round\n- Assessment Round\n- Hiring Manager Round\n- Final round with management team\nWFH\nJob Type: Full-time\nPay: Up to ₹800,000.00 per year\nSchedule:\nMonday to Friday\nMorning shift\nApplication Question(s):\nHow many years of experience as data Analyst with working knowledge of Dashboards/BI tools- Proficient in MS-Excel- including formulas, pivot tables and vlookups & MS- Office Tools- Word, PowerPoint?\nHave you completed your Bachelor's or Master's degree in Mathematics/Statistics/Engineering- Computer Science,IT?\nWhat is your current CTC and expected CTC?\nWhat is your notice period and current location?\nDo you have the knowledge of 1. database language-SQL 2. Programming language- Python for data analysis and visualizations?\nDo you have working knowledge of Google Suit Tools- Preparing data/forms using Excel and Google Sheets, Forms?\nFor this job all attending all these questions is compulsory. other you will be marked as not shortlisted.",
        "Job Link": "/company/Rudrateck-Solution/jobs/Data-Analyst-6bbf890e2881f590?fccid=807b8153d9bcdc37&vjs=3",
        "state": "Delhi"
    },
    {
        "Title": "PMO Project Controller - Sr. Analyst",
        "Location": "Hyderabad, Telangana",
        "Company": "Deloitte",
        "Salary": "500000",
        "Sponsored": "",
        "Description": "Sr. Analyst – PMO Project Controller - Deloitte Support Services India Private Limited\n\nUSI DT Canada MF is an integral part of the Information Technology Services group. The principle focus of this organization is the development and maintenance of technology solutions that e-enable the delivery of Function and Marketplace Services and Management Information Systems.\nSolutions Delivery group develops and maintains solutions built on varied technologies like Siebel, PeopleSoft Microsoft technologies, SAP, Hadoop, ETL, BI and Lotus Notes. Solutions Delivery Canada has various groups which provide the best of the breed solutions to the clients by following a streamlined system development methodology. Solutions Delivery comprises of groups like Usability, Application Architecture, Development and Quality Assurance and Performance.\nRole Specific Responsibilities / Work you’ll do\nWorking with a small dynamic team to ensure the ITS (Internal Technology Services) organization has a clear view on project management framework.\nDeveloping, maintaining and implementation of project management standards, processes and best practices.\nGathering and analyzing projects data to monitor project compliance and identify non-compliance areas.\nLiaising with project managers and providing suggestions or solutions to non-compliance and off-track check points when needed.\nAnalyzing and producing metrics and reporting on project costing; project governance & compliance and project health and overall performance.\nSupporting project managers in tracking their project budget and providing cost control related metrics and reports.\nOverseeing projects’ RAID logs to ensure defined processes of Risk/Issue and Change Request are followed and proper communication to the relevant stakeholders have been established.\nDocumenting and reporting on all project compliance with TOM and PMO requirements.\nFacilitating discussions with senior IT leaders on regular project status and health.\nAdministration of “Projects” module of ServiceNow and maintaining Power BI Project Management data models.\nBe backup supporter for the resource management function of PMO in effective management and utilization of enterprise resources.\n\nThe team\nEDC Canada is the Canada CIO’s IT department which manages an end-to-end portfolio of Canada business applications and technology infrastructure that supports business processes common to Deloitte Canada member firm.\nCutting Edge Technologies: At USI DT Canada MF, you will be part of an exciting journey that will keep you ahead of the curve. Be it our innovative delivery model for agile or our Communities of Practices, we are constantly investing in leading edge technologies to give our practitioners a world class experience. We have programs and projects spanning across a multitude of technologies and always abreast on evolving technologies and emerging industry leading practices such as agile.\nApplication Development and Solutions Delivery: Start from Architecture and User Experience and evolve into design, develop, transform, re-platform, or custom-build systems in complex business scenarios. We manage a portfolio of enterprise scale applications and solutions used by practitioners in Canada. Offerings include Custom Development, Packaged Application Development, Application Architecture and Testing Advisory Services. Technologies include Business Analytics, Business intelligence, Cloud Development, Mobile, .Net, SharePoint, SAP HANA, Manual, Automated, and Performance testing.\n\nLocation: Hyderabad\nWork shift Timings: 11 AM to 8 PM\n\nQualifications\n\nEssential\nA Computer Science University degree and/or equivalent work experience\nA strong commitment to professional client service excellence\nExcellent interpersonal relations and demonstrated ability to work with others effectively in teams\nGood verbal and written communications skills\nExcellent Analytical Skill\nTop Keywords: PMO, Project coordinator,\nTechnical Skills and Qualifications\nComputer Science University degree or equivalent work experience\nAt least 4 -5 years’ years of project management experience, preferably in a PMO\nMinimum of 3+ years of reporting experience.\nDemonstrates an understanding and knowledge of project management and governance principles and frameworks.\nDemonstrates solid analytical/problem solving skills.\nStrong verbal and written communication skills.\nAdvanced Microsoft Office proficiency with Excel, PowerPoint, Word, SharePoint.\nKnowledge of Power BI ETL, Semantic Layer definition and Visualization would be an asset.\nKnowledge of ServiceNow’s ITBM product would be an asset.\n\nHow you'll grow\nAt Deloitte, we’ve invested a great deal to create a rich environment in which our professionals can grow. We want all our people to develop in their own way, playing to their own strengths as they hone their leadership skills. And, as a part of our efforts, we provide our professionals with a variety of learning and networking opportunities—including exposure to leaders, sponsors, coaches, and challenging assignments—to help accelerate their careers along the way. No two people learn in exactly the same way. So, we provide a range of resources including live classrooms, team-based learning, and eLearning. DU: The Leadership Center in India, our state-of-the-art, world-class learning Center in the Hyderabad offices is an extension of the Deloitte University (DU) in Westlake, Texas, and represents a tangible symbol of our commitment to our people’s growth and development. Explore DU: The Leadership Center in India\n\nBenefits\nAt Deloitte, we know that great people make a great organization. We value our people and offer employees a broad range of benefits. Learn more about what working at Deloitte can mean for you.\n\nDeloitte’s culture\nOur positive and supportive culture encourages our people to do their best work every day. We celebrate individuals by recognizing their uniqueness and offering them the flexibility to make daily choices that can help them to be healthy, centered, confident, and aware. We offer well-being programs and are continuously looking for new ways to maintain a culture that is inclusive, invites authenticity, leverages our diversity, and where our people excel and lead healthy, happy lives. Learn more about Life at Deloitte.\n\nCorporate citizenship\nDeloitte is led by a purpose: to make an impact that matters. This purpose defines who we are and extends to relationships with our clients, our people and our communities. We believe that business has the power to inspire and transform. We focus on education, giving, skill-based volunteerism, and leadership to help drive positive social impact in our communities. Learn more about Deloitte’s impact on the world.\n\nRecruiting tips\n\nFrom developing a stand out resume to putting your best foot forward in the interview, we want you to feel prepared and confident as you explore opportunities at Deloitte. Check out recruiting tips from Deloitte recruiters.\nBenefits\n\nAt Deloitte, we know that great people make a great organization. We value our people and offer employees a broad range of benefits. Learn more about what working at Deloitte can mean for you.\nOur people and culture\n\nOur diverse, equitable, and inclusive culture empowers our people to be who they are, contribute their unique perspectives, and make a difference individually and collectively. It enables us to leverage different ideas and perspectives, and bring more creativity and innovation to help solve our client most complex challenges. This makes Deloitte one of the most rewarding places to work. Learn more about our inclusive culture.\nOur purpose\n\nDeloitte’s purpose is to make an impact that matters for our clients, our people, and in our communities. We are creating trust and confidence in a more equitable society. At Deloitte, purpose is synonymous with how we work every day. It defines who we are. We are focusing our collective efforts to advance sustainability, equity, and trust that come to life through our core commitments. Learn more about Deloitte's purpose, commitments, and impact.\nProfessional development\n\nFrom entry-level employees to senior leaders, we believe there’s always room to learn. We offer opportunities to build new skills, take on leadership opportunities and connect and grow through mentorship. From on-the-job learning experiences to formal development programs, our professionals have a variety of opportunities to continue to grow throughout their career.\nRequisition code: 151942",
        "Job Link": "/pagead/clk?mo=r&ad=-6NYlbfkN0DIXU_djF9v0NrX_xbLRwj6RWFeuMEgTY6VvwKgvleOVEMH6N8XB8ugTc3UeC9e-vJDnaT1dAihbxQ6nQ3WfsGo0GCPgsjDoEg3Src5UKPl-t8faEy9NjoraC0C6U03R2FMc9k5JT5sHZcJuptnAlpiDgkBz1thiZ2sLlmNliIYD9MPlIyR1-ju9dtIV44kzP8Lsm5TqTtXTRCCVN53FxktBSzIf_nTCxNkxAiwFczBLwUsL7WV1UGabTVHX00Mzzd2hRWSEHXW_iVzGef63rUm5O4UpyHF4mTjUvnyzhrVNYX5FfQ_6bnhziwYkFec63GwNBa9n8iLxOhDXoFwmASuHy2gYI0u174Mr6J7CMm8dNtrltQqt8cUJuaBYP21o22LtH7TlJ_jAE10ml13sZX2JMzUd-40z8zOJGu02dvT9FavfOgE1NrhO1fM8s9O3KV6pSxammJ2sa5J-iw8Opm7eg8hwFeDbUlKQkd2uGw65M9crUYKwpx5FV59VrkonfrIXq33XvjZnqwx6G3EiebYF2Dw38qPOMhm7DVnogqsoOrp6TPB2LujdiGalHEC3ZAKL3h31-TqcPz7XrMSob_GGviiYMhhtoStZ9W6sBHVLBMOxclzG2g_uw-ecRJc2vk=&xkcb=SoDf-_M3NnQvDZQHNZ0IbzkdCdPP&p=3&fvj=0&vjs=3",
        "state": "Telangana"
    },
    {
        "Title": "Data Analyst",
        "Location": "Faridabad, Haryana",
        "Company": "Techginia Global Pvt. Ltd",
        "Salary": "600000",
        "Sponsored": "",
        "Description": "Job Description\nTitle: Data Analyst\nJob Location: Faridabad\nIndustry: Apparels\nJob Summary:\nWe are seeking a skilled and experienced Data Analyst with expertise in Excel, Power BI, Google Sheets, and Dashboards. The successful candidate will be responsible for collecting, analyzing, and interpreting complex data sets to generate insights and support decision-making processes. The ideal candidate should have at least 3 years of experience in data analysis and a strong proficiency in the mentioned skillsets.\nResponsibilities:\n· Collect, clean, and organize large data sets from various sources, ensuring accuracy and integrity.\n· Develop and maintain advanced Excel spreadsheets, utilizing formulas, functions, and macros to extract, manipulate, and analyze data.\n· Create visually appealing and interactive dashboards using Power BI and Google Sheets to present data insights in a clear and concise manner.\n· Analyze data trends, patterns, and correlations to identify key insights and provide recommendations for process improvement and business growth.\n· Collaborate with cross-functional teams to understand data requirements, develop data models, and provide data-driven solutions.\n· Conduct ad-hoc analysis and data mining to support business needs and answer specific queries.\n· Stay updated with the latest tools and techniques in data analysis and visualization to enhance efficiency and accuracy.\n· Ensure data privacy and compliance with relevant regulations throughout the data analysis process.\nQualifications:\n· Bachelor's degree in Computer Science or any related field\n· Minimum of 3 years of professional experience in data analysis\n· Expertise in Excel, including advanced functions, pivot tables, and data visualization techniques\n· Proficiency in Power BI and Google Sheets, with the ability to create dynamic dashboards and reports\n· Strong analytical and problem-solving skills, with the ability to translate complex data into actionable insights\n· Familiarity with data modeling concepts and the ability to structure and organize data effectively\n· Knowledge of statistical analysis methods and experience with tools such as R or Python is a plus\n· Excellent communication skills, both verbal and written, with the ability to present data insights to non-technical stakeholders\n· Detail-oriented mindset with a strong focus on accuracy and data integrity\nJob Types: Full-time, Regular / Permanent\nPay: ₹212,529.91 - ₹600,000.00 per year\nSchedule:\nDay shift\nAbility to commute/relocate:\nFaridabad, Haryana: Reliably commute or planning to relocate before starting work (Required)\nExperience:\ntotal work: 3 years (Required)\nExpected Start Date: 24/07/2023",
        "Job Link": "/company/Techginia-Global-Pvt.-Ltd/jobs/Data-Analyst-9489948e150470c2?fccid=16b6ddfbfdaad2e3&vjs=3",
        "state": "Haryana"
    },
    {
        "Title": "Data Scientist",
        "Location": "Bengaluru, Karnataka",
        "Company": "Techcovery Solutions",
        "Salary": "960000",
        "Sponsored": "",
        "Description": "-1 to 4 years of relevant experience\n-Bachelor’s or Master’s Degree in Computer Science, Computer Engineering, Data Science, Machine Learning, or a related field at the time of application.\n-Proficiency in Computer Science fundamentals such as object-oriented design, algorithm design, data structures, problem-solving, and complexity analysis.\n-Proficiency in Python programming language and its associated libraries for data manipulation and analysis.\n-Understanding of ML algorithms, frameworks and libraries, statistical modeling, and predictive analytics techniques\n-Knowledge of Natural Language Processing\n-Proficiency in working with large datasets and implementing data preprocessing techniques (e.g., data cleaning, normalization, feature extraction)\n-Experience with distributed, multi-tiered systems, algorithms, and relational databases.\n-Ability to effectively articulate technical challenges and solutions.\n-Adept at handling ambiguous or undefined problems and the ability to think abstractly.\nJob Types: Full-time, Regular / Permanent\nSalary: ₹600,000.00 - ₹2,000,000.00 per year\nSchedule:\nDay shift\nAbility to commute/relocate:\nBangalore City, Karnataka: Reliably commute or planning to relocate before starting work (Required)\nEducation:\nBachelor's (Required)\nExperience:\nData science: 1 year (Required)\nExpected Start Date: 01/07/2023",
        "Job Link": "/company/Techcovery-Solutions/jobs/Data-Scientist-d1eda02967133303?fccid=60675b6c61805ebb&vjs=3",
        "state": "Karnataka"
    },
    {
        "Title": "Data Science/Machine Learning",
        "Location": "Chandigarh, Chandigarh",
        "Company": "Orion eSolutions Pvt.Ltd",
        "Salary": "170000",
        "Sponsored": "",
        "Description": "We are seeking an experienced Data Science/Machine Learning Developerto join our team. The ideal candidate will have a minimum of 6-8yearsof experience in developing and implementing machine learning algorithms\nJob Type: Full-time\nSalary: Up to ₹1,700,000.00 per year\nSchedule:\nMonday to Friday\nSupplemental pay types:\nPerformance bonus\nQuarterly bonus\nYearly bonus\nAbility to commute/relocate:\nChandigarh, Chandigarh: Reliably commute or planning to relocate before starting work (Required)\nExperience:\ntotal work: 3 years (Preferred)\nWork Location: In person\nSpeak with the employer\n+91 6280449003",
        "Job Link": "/company/Orion-eSolutions-Pvt.Ltd/jobs/Data-Scientist-a4b84ade51ebfa52?fccid=a2677d8af75ca359&vjs=3",
        "state": "Chandigarh"
    },
    {
        "Title": "Data Science Intern",
        "Location": "Gurgaon, Haryana",
        "Company": "Instaspaces Realtech Private Limited",
        "Salary": "50000",
        "Sponsored": "",
        "Description": "Job Description of Data Scientist Intern\nAs a Data Science Intern, you will have the opportunity to apply your analytical and problem-solving skills to real-world data challenges.\nAbout the Company:\nInstaSpaces is the biggest booking platform for professional workspaces and meeting rooms bookable hourly. InstaSpaces is the biggest provider of virtual offices for GST/business registration & mailing address in the country with a presence in all 29 states. InstaSpaces is a platform to efficiently utilize the commercial real estate of the economy through collaborative consumption. InstaSpaces offers professional workspaces with flexibility and transparency. One can book from 1 hour to months just at the tap of a button, without any lock-in periods or hefty security deposits. Each InstaSpace comes with its standard brand promises and service guarantees.\nDuties and Responsibilities:\n1. Assist in collecting, cleaning, and analyzing large datasets from various sources to ensure data quality and integrity.\n2. Research and Experimentation: Stay up-to-date with the latest data science techniques, tools, and methodologies to suggest innovative approaches and solutions and explore their application to improve existing models and processes.\n3. Data Privacy and Security: Adhere to data privacy regulations and maintain the confidentiality and security of sensitive data throughout the internship.\n4. Recover the data that has been lost.\n5. Has to make process around no data loss.\n6. Makes system/software around data management.\n7. Has to study the reason of data loss.\nRequirements:\n1. Pursuing a bachelor's or master's degree in a quantitative field such as Data Science, Computer Science, Statistics, Mathematics, or a related discipline.\n2. Proficient in data manipulation, analysis, and interpretation.\n3. Data visualization\n4. Excellent verbal and written communication skills to present findings and insights to both technical and non-technical audiences.\n5. Strong organizational skills to manage multiple tasks and prioritize work effectively while maintaining accuracy and attention to detail.\n6. Continuous Learning: Eagerness to learn and adapt to new technologies, tools, and methodologies in the field of data science.\nPerks:\nCertificate\nLetter of recommendation\nFlexible working hours\nInformal dress code\n6 days a week\nStipend - Rs 5000/month\nDuration - 3 months\nLocation - Gurgaon\nJob Type: Full-time\nSalary: ₹5,000.00 per month\nSchedule:\nDay shift\nAbility to commute/relocate:\nGurgaon - 122001, Haryana: Reliably commute or planning to relocate before starting work (Required)\nEducation:\nBachelor's (Preferred)",
        "Job Link": "/company/Instaspaces-Realtech-Private-Limited/jobs/Data-Science-Intern-777aa21c8ef4c544?fccid=8ad3d2a0d3408f9d&vjs=3",
        "state": "Haryana"
    },
    {
        "Title": "Machine Learning Engineer",
        "Location": "Remote in Noida, Uttar Pradesh",
        "Company": "Pragra",
        "Salary": "800000",
        "Sponsored": "",
        "Description": "We are looking for a highly capable machine learning engineer to optimize our machine learning systems. You will be evaluating existing machine learning (ML) processes, performing statistical analysis to resolve data set problems, and enhancing the accuracy of our AI software's predictive automation capabilities.\nTo ensure success as a machine learning engineer, you should demonstrate solid data science knowledge and experience in a related ML role. A first-class machine learning engineer will be someone whose expertise translates into the enhanced performance of predictive automation software.\nMachine Learning Engineer Responsibilities:\nDesigning machine learning systems and self-running artificial intelligence (AI) software to automate predictive models.\nTransforming data science prototypes and applying appropriate ML algorithms and tools.\nEnsuring that algorithms generate accurate user recommendations.\nTurning unstructured data into useful information by auto-tagging images and text-to-speech conversions.\nSolving complex problems with multi-layered data sets, as well as optimizing existing machine learning libraries and frameworks.\nDeveloping ML algorithms to analyze huge volumes of historical data to make predictions.\nRunning tests, performing statistical analysis, and interpreting test results.\nDocumenting machine learning processes.\nKeeping abreast of developments in machine learning.\nMachine Learning Engineer Requirements:\nBachelor's degree in computer science, data science, mathematics, or a related field.\nMaster’s degree in computational linguistics, data analytics, or similar will be advantageous.\nAt least two years' experience as a machine learning engineer.\nAdvanced proficiency with Python, Java, and R code writing.\nExtensive knowledge of ML frameworks, libraries, data structures, data modeling, and software architecture.\nIn-depth knowledge of mathematics, statistics, and algorithms.\nSuperb analytical and problem-solving abilities.\nGreat communication and collaboration skills.\nExperience with ED-Tech Industry or ATS systems is a big plus.\nExcellent time management and organizational abilities.\nJob Types: Full-time, Permanent\nSalary: 8 Lacs - 12 Lcas (Based on Experience)\nSchedule:\n8 hour shift\nDay shift\nEvening shift\nMonday to Friday\nSupplemental pay types:\nBonus pay\nOvertime pay\nTips\nExperience:\nMachine Learning Engineer (preferred)\nWork Location:\nRemote\nJob Type: Full-time\nSalary: ₹800,000.00 - ₹1,200,000.00 per year\nBenefits:\nWork from home\nSchedule:\nDay shift\nAbility to commute/relocate:\nNoida, Uttar Pradesh: Reliably commute or planning to relocate before starting work (Required)\nExperience:\ntotal work: 3 years (Preferred)",
        "Job Link": "/company/Pragra/jobs/Machine-Learning-Engineer-4e2ec3857fb871ac?fccid=1f0d44cc719fc02c&vjs=3",
        "state": "Uttar Pradesh"
    },
    {
        "Title": "LNG Data Analyst",
        "Location": "Gurgaon, Haryana",
        "Company": "S&P Global",
        "Salary": "500000",
        "Sponsored": "",
        "Description": "S&P Global Commodity Insights\n\nThe Role: LNG Data Analyst\n\nThe Location: Gurgaon, India.\n\nGrade/Level ( relevant for internal applicants only ): 7\n\nThe Team: The liquefied natural gas (LNG) team research and analytics team provides timely insights and comprehensive data on the rapidly evolving LNG market, allowing clients to understand an increasingly complex market. We produce a high volume of insights and data on projects, LNG importers and exporters, market trends, and prices. Our subject matter expertise, combined with our data-driven interactive analytical platform, allows our customers to get scalable information to assist with any decision.\n\nThe Impact: This position provides key support to our data collection and data transformation operations. We are leaders in critical trade and fundamentals data to the LNG industry, and your contributions will directly impact our superior offerings.\n\nWhat’s in it for you: This is an excellent opportunity for entry-level candidates with little to no years of experience to pursue professional growth as a supporting member in a leading intelligence provider. Training on the energy industry and data techniques will be provided. The candidate will have the opportunity to learn from colleagues in region and globally with deep expertise in the LNG industry. This is an opportunity to be part of a global community, building an invaluable network of knowledge and support from your mentors, peer group and wider teams.\n\nResponsibilities:\nTracking LNG cargoes on the water from liquefaction plant to regasification terminal using various in-house software and quantitative tools\nData gathering, processing, and analysis of natural gas and LNG industry market fundamentals\nMaintaining and taking ownership of market data coverage for different LNG importing markets\nAuditing and quality control of client data deliverables\nOpportunities to build and maintain Power BI dashboards\nCollaborate with professionals in other global locations\n\nWhat We’re Looking For:\nStrong quantitative skills with attention to detail to confirm data correctness and validate accuracy\nMedium to advanced level expertise in MS-Excel and Power Point is required\nBeginner level Power BI a plus. Keen interest to advance data visualization and modeling skills regardless of pre-existing Power BI knowledge.\nVerbal and written fluency in English is essential, knowledge of other languages seen favorably\nWillingness to ask questions and initiate communication\nComfortable with high levels of individual responsibility and accountability\nDemonstrates personal integrity and an openness to continually learn and develop\nBachelor’s degree required; degree in business/engineering/sciences/math is a plus\nValid work permit or citizenship in India.\n\nFlexible Working (optional)\nWe pride ourselves on our agility and diversity, and we welcome requests to work flexibly. For most roles, flexible hours and/or an element of remote working are usually possible. Please talk to us at interview about the type of arrangement that is best for you. We will always try to be adaptable wherever we can.\n\nReturn to Work\nHave you taken time out for caring responsibilities and are now looking to return to work? As part of our Return to Work initiative (link to career site page when available), we are encouraging enthusiastic and talented returners to apply, and will actively support your return to the workplace.\n\nAbout Company Statement:\nS&P Global delivers essential intelligence that powers decision making. We provide the world’s leading organizations with the right data, connected technologies and expertise they need to move ahead. As part of our team, you’ll help solve complex challenges that equip businesses, governments and individuals with the knowledge to adapt to a changing economic landscape.\n\nS&P Global Commodity Insights enables organizations to create long-term, sustainable value with data and insights for a complete view on the global energy and commodities markets.\n\n-----------------------------------------------------------\n\nEqual Opportunity Employer\nS&P Global is an equal opportunity employer and all qualified candidates will receive consideration for employment without regard to race/ethnicity, color, religion, sex, sexual orientation, gender identity, national origin, age, disability, marital status, military veteran status, unemployment status, or any other status protected by law. Only electronic job submissions will be considered for employment.\n\nIf you need an accommodation during the application process due to a disability, please send an email to: EEO.Compliance@spglobal.com and your request will be forwarded to the appropriate person.\n\nUS Candidates Only: The EEO is the Law Poster http://www.dol.gov/ofccp/regs/compliance/posters/pdf/eeopost.pdf describes discrimination protections under federal law.\n\n----------------------------------------------------------- 20 - Professional (EEO-2 Job Categories-United States of America), DTMGOP203 - Entry Professional (EEO Job Group), SWP Priority – Ratings - (Strategic Workforce Planning)\n\nJob ID: 289772\nPosted On: 2023-07-13\nLocation: Gurgaon, Haryana, India",
        "Job Link": "/rc/clk?jk=4a14b8363f7c61ce&fccid=b716e44d2c6283e7&vjs=3",
        "state": "Haryana"
    },
    {
        "Title": "Data Science Engineer",
        "Location": "Remote in Bengaluru, Karnataka",
        "Company": "ATF Labs",
        "Salary": "2048230",
        "Sponsored": "",
        "Description": "A data science engineer with 4-6 years of experience typically plays a critical role in the development and implementation of data-driven solutions within an organization. They possess a solid understanding of data analysis, machine learning, and software engineering principles. Here's a comprehensive job description for a data science engineer with 4-6 years of experience:\nRole: Data Science Engineer Experience: 4-6 years\nResponsibilities:\nData Analysis and Modeling:Collaborate with stakeholders to understand business objectives and define project goals.\nDevelop and implement data collection and preprocessing strategies to ensure data quality and availability for analysis.\nPerform exploratory data analysis and generate insights from large and complex datasets.\nApply statistical techniques and machine learning algorithms to build predictive models, classification systems, recommendation engines, or other data-driven solutions.\nEvaluate and select appropriate models, algorithms, and tools based on project requirements and constraints.\nConduct feature engineering, dimensionality reduction, and model selection to optimize performance.\nSoftware Development and Engineering:Design, develop, and maintain data pipelines, ETL processes, and scalable infrastructure for data ingestion, processing, and storage.\nBuild robust and scalable data engineering solutions to handle big data and streaming data sources.\nCollaborate with software engineers and data scientists to integrate data science models and insights into production systems.\nOptimize and refactor code for efficiency, maintainability, and scalability.\nEnsure adherence to software development best practices, including version control, code documentation, and testing.\nMachine Learning and Model Deployment:Implement machine learning models and algorithms using programming languages such as Python, R, or Scala.\nDeploy models into production environments, ensuring scalability, reliability, and monitoring of model performance.\nCollaborate with DevOps and IT teams to integrate machine learning models into existing infrastructure and workflows.\nConduct A/B testing and validation to measure model performance and make data-driven improvements.\nStay updated with the latest developments in data science, machine learning, and related technologies.\nCommunication and Collaboration:Effectively communicate technical concepts and results to both technical and non-technical stakeholders.\nCollaborate with cross-functional teams, including data scientists, business analysts, software engineers, and project managers, to deliver data-driven solutions.\nParticipate in meetings, discussions, and brainstorming sessions to contribute to the overall data strategy and roadmap of the organization.\nMentor and provide guidance to junior data scientists and engineers.\nRequirements:\nBachelor's or master's degree in computer science, data science, statistics, or a related field.\nStrong programming skills in languages such as Python, R, or Scala.\nProficiency in data manipulation, analysis, and visualization libraries (e.g., Pandas, NumPy, Matplotlib, Seaborn).\nExperience with machine learning frameworks (e.g., scikit-learn, TensorFlow, PyTorch) and libraries.\nSolid understanding of statistical analysis, hypothesis testing, and experimental design.\nExperience with SQL and working knowledge of databases and data warehousing concepts.\nFamiliarity with big data technologies and distributed computing frameworks (e.g., Hadoop, Spark) is a plus.\nStrong problem-solving and analytical skills, with attention to detail.\nExcellent communication and interpersonal skills to collaborate effectively with team members and stakeholders.\nAbility to work in a fast-paced, agile environment and manage multiple priorities.\nJob Type: Full-time\nPay: ₹586,348.28 - ₹2,048,229.61 per year\nBenefits:\nPaid sick time\nWork from home\nSchedule:\nDay shift\nMonday to Friday\nUK shift\nAbility to commute/relocate:\nBangalore, Karnataka: Reliably commute or planning to relocate before starting work (Required)\nExperience:\nPython: 5 years (Preferred)\nSpeak with the employer\n+91 8218222484",
        "Job Link": "/company/ATF-Labs/jobs/Data-Scientist-49d1de38e8d30d16?fccid=3af4d90dceca077c&vjs=3",
        "state": "Karnataka"
    },
    {
        "Title": "Data Modeler/Data Analyst",
        "Location": "Noida, Uttar Pradesh",
        "Company": "Gigaforce",
        "Salary": "₹10,00,000 - ₹50,00,000 a year",
        "Sponsored": "",
        "Description": "GigaForce is a California based InsurTech provider of a SaaS-based, blockchain-optimized, claims platform\nwhich combines artificial intelligence (AI)-driven predictive models, specialized expertise, and customized\nservices to expedite subrogation, recovery, and salvage processing for insurance ecosystems, including insurers,\nlaw firms, and third-party adjusters. Gigaforce is a force to reckon with and is one of the most promising\nInsurtech companies on the horizon. Despite being young, we were one of the finalists in InsurtechNY, a\nhighly-respected community based organization which accelerates insurance innovation in the New York metro\narea. We were also selected from a large base of Insurtech companies, by Plug and Play Tech Center, the\nworld's largest early stage investor, accelerator, and corporate innovation platform with global headquarters in\nSunnyvale, California, as part of their recent Fall batch.\nWe work on cutting edge, truly relevant technologies such as Artificial Intelligence, Machine Learning,\nRobotics Processing Automation, Blockchain, Big Data, Cloud Computing, Java, Kotlin, Angular, Node Js\nand many others.\nWe are thought leaders in the insurance-in-technology space and are committed to hiring the very best\nworkforce to keep up with the pace of our rapidly growing company. We look forward to providing exceptional\nemployee experiences where everyone is valued and all ideas are welcome. We are passionate about giving\nyou an environment where you are inspired to explore your talents and constantly innovate. Some of the best\nin-class perks we offer include comprehensive medical insurance, paid time off, meals cards, a hybrid\nwork model, ESOPs, an opportunity to work in the US, among others. As an equal opportunity employer,\nwe welcome and encourage diversity in the workplace regardless of gender, race, color, ethnicity, origin, age,\nreligion, sexual orientation or any other characteristics protected by law.\nWe are seeking a Data Modeler to join our team of data scientists. You will work with data architects to design\nand implement our data infrastructure. You will be responsible for creating and maintaining data models for\ndatabases, developing scripts for data cleansing, and developing tools to automate data entry.\nJob Responsibilities:\nWork with the business intelligence team to gather requirements for the database design and model\nUnderstand the data needs of the company or client\nCollaborate with the development team to design and build the database model\nEngage the development team to implement the database\nDetermine the business needs for data reporting requirements\nAdjust access to the data and the reports as needed\nWork closely with the development team to implement data warehouse and reporting\nUnderstand the data migration needs\nWork with the development team to implement the migration\nWork with data scientists to determine metadata querying requirements\nHelp to implement the querying\nHelp determine and manage data cleaning requirements\nHelp determine data security needs and implement security solutionsJob Requirements:\nMust have the knowledge of any one of below mentioned tools IBM tools or ER studio or Erwin and knowledge of Draw.io will be the addition.\nKnowledge of relational databases and data architecture computer systems, including SQL\nMandatory work experience of 5+ years on a SAAS based plaform\nBachelor’s degree in computer science, data science, information technology, or data modeling\nKnowledge of ER modeling, big data, enterprise data, and physical data models\nFamiliarity with data modeling software\nExcellent presentation, communication, and organizational skills\nStrong attention to detail\nAbility to work in a fast-paced environment\nAbility to work both\nJob Type: Full-time\nSalary: ₹1,000,000.00 - ₹5,000,000.00 per year\nBenefits:\nCell phone reimbursement\nHealth insurance\nProvident Fund\nSchedule:\nDay shift\nSupplemental pay types:\nCommission pay\nPerformance bonus\nYearly bonus\nAbility to commute/relocate:\nNoida, Uttar Pradesh: Reliably commute or planning to relocate before starting work (Required)",
        "Job Link": "/company/Gigaforce/jobs/Data-Modeler-f28926810a579ab6?fccid=c5170d2c86d5b84a&vjs=3",
        "state": "Uttar Pradesh"
    },
    {
        "Title": "Data Engineer",
        "Location": "Noida, Uttar Pradesh",
        "Company": "FourthPointer Services Pvt. Ltd.",
        "Salary": "₹4,96,518 - ₹15,00,000 a year",
        "Sponsored": "",
        "Description": "Your Role\nWe at FourthPointer are looking for Software Development Engineer-II (Backend) to build the most amazing product experience. You’ll get to work with other engineers to build a delightful feature experience to understand and solve our customer’s pain points.\nA Day in the Life-\n-Building efficient and reusable applications and abstractions.\n-Identify and communicate back-end best practices.\n-Participate in the project life-cycle from pitch/prototyping through definition and design to build, integration, QA and delivery\n-Analyze and improve the performance, scalability, stability, and security of the product\n-Improve engineering standards, tooling, and processes\nWhat You Need\n-2.5 to 5 years of experience with a start-up mentality and high willingness to learn\n-Expert in Python and experience with any web framework (Django)\n-Experience in SQL\n-Aggressive problem diagnosis and creative problem-solving skill\n-Experience in RDBMS such as Postgres, (any OLAP database is good to have).\n-Knowledge of high-level concepts of async programming.\n-Bachelor's degree in Computer Science/Software Engineering.\nPreferred Skills:\n-Expert in Python and any web framework.\n-Any SQL or NoSQL database.\nJob Types: Full-time, Regular / Permanent\nSalary: ₹496,517.71 - ₹1,500,000.00 per year\nBenefits:\nHealth insurance\nPaid sick time\nProvident Fund\nSchedule:\nDay shift\nSupplemental pay types:\nPerformance bonus\nQuarterly bonus\nYearly bonus\nAbility to commute/relocate:\nNoida, Uttar Pradesh: Reliably commute or planning to relocate before starting work (Required)\nExperience:\nSQL: 3 years (Required)\nSpeak with the employer\n+91 8283012675\nApplication Deadline: 20/07/2023",
        "Job Link": "/company/FourthPointer-Services-Pvt.-Ltd./jobs/Data-Engineer-4fd422486b9eca61?fccid=8c90911a07891827&vjs=3",
        "state": "Uttar Pradesh"
    },
    {
        "Title": "Principal Software Engineer, Platform Lead - Enterprise Search",
        "Location": "Hyderabad, Telangana",
        "Company": "Bristol Myers Squibb",
        "Salary": "50K",
        "Sponsored": "",
        "Description": "Working with Us\nChallenging. Meaningful. Life-changing. Those aren’t words that are usually associated with a job. But working at Bristol Myers Squibb is anything but usual. Here, uniquely interesting work happens every day, in every department. From optimizing a production line to the latest breakthroughs in cell therapy, this is work that transforms the lives of patients, and the careers of those who do it. You’ll get the chance to grow and thrive through opportunities uncommon in scale and scope, alongside high-achieving teams rich in diversity. Take your career farther than you thought possible.\nBristol Myers Squibb recognizes the importance of balance and flexibility in our work environment. We offer a wide variety of competitive benefits, services and programs that provide our employees with the resources to pursue their goals, both at work and in their personal lives. Read more: careers.bms.com/working-with-us.\nPosition Summary\nSearch Engineer and Support Lead will be responsible for delivering Enterprise Search capabilities and Targeted applications to improve access to information and analytics. This role will provide enterprise & data search solutions that will help internal scientific community and users to easily find information for their everyday needs. He/She will work with a team of Bristol Myers Squibb resources and Service Providers responsible for the delivery (BUILD) and ongoing support (RUN) of search platforms across Bristol Myers Squibb. This Role will be responsible for working with the vendors and internal IT teams to ensure that the platform is properly supported and configured to support cross functional teams in their search needs. This role will deliver business performance by providing rock solid robust search platform services and deliver expected business outcomes on time and on budget.\nMajor Duties and Responsibilities\nSearch Engineer and Support lead will engineer and enhance the platforms services to scale and adapt to support variety of enterprise and data search needs while balancing TCO. He/She will be responsible for operations and full lifecycle management of an existing search services to support business needs and monitor successful execution. This role is part of Data Platform team, the team responsible for providing platform engineering and operations services to BMS.\nThis role offers the selected candidate the opportunity to interact with Bristol Myers Squibb professionals globally, partnering with other IT organizations and business organizations across the company. You will work with passionate and motivated individuals, gain insight into all faucets of Bristol Myers Squibb businesses from early discovery, to manufacturing & logistics to commercial and financial operations. You will be a valued member of the Enterprise Integration team focused on fulfilling the Bristol Myers Squibb mission to discover, develop and deliver innovative medicines that help patients prevail over serious diseases.\nKey Responsibilities\nResponsible for managing platforms with significantly complex integration points\nSocializes Search roadmap and capabilities and continue to drive expansion of search to solve business problems at BMS\nLeads relevancy tuning efforts of Enterprise search and targeted apps to ensure information presented by search is accurate and timely\nResponsible for Understanding BMS’s portfolio of Search tools, Operations services and how they are applied to solve client problems\nResponsible for Platform Engineering, support and operations which includes Incident and problem management, minor enhancements and break fixes.\nEnsures RUN operations are reliable, accessible, compliant, and secure\nEnsures RUN operations deliver as per SLA’s\nActively monitor and mitigate any performance, scalability or sustainability issues with platform or application components.\nProvides proactive and appropriate communication (written and verbally) to technical and non-technical stakeholders\nParticipate in Mission/Business critical Incident resolution activities\nEnsures compliance with required policies and governances\nQualifications & Experience\n10+ years of Information technology experience in implementation and support of enterprise systems\nTechnical skills and hands-on experience in Search technologies (AWS open search, Elastic Search etc.)\nExperience with web development tools (React, Angular) and cloud computing platforms\nWorking knowledge of NLP, NLU ,AI models and its application to improve search\nOperate independently within the guidelines of overall position and objectives\nAppropriately raise and escalate issues and/or risks and challenge assumptions\nDemonstrates a strong attention to detail and a commitment to process quality, continuous improvement and operational excellence.\nUnderstanding of Cloud Services Platforms\nProven experience of working on application development projects; exceptional working knowledge of common SDLC models\nProven experience with Incident resolution management (Includes communication with technical and non-technical stakeholders)\n5+ years Project and/or support experience\nExceptional customer interaction and communication skills, including interaction with non-technical audiences\nIf you come across a role that intrigues you but doesn’t perfectly line up with your resume, we encourage you to apply anyway. You could be one step away from work that will transform your life and career.\nUniquely Interesting Work, Life-changing Careers\nWith a single vision as inspiring as “Transforming patients’ lives through science™ ”, every BMS employee plays an integral role in work that goes far beyond ordinary. Each of us is empowered to apply our individual talents and unique perspectives in an inclusive culture, promoting diversity in clinical trials, while our shared values of passion, innovation, urgency, accountability, inclusion and integrity bring out the highest potential of each of our colleagues.\nOn-site Protocol\nPhysical presence at the BMS worksite or physical presence in the field is a necessary job function of this role, which the Company deems critical to collaboration, innovation, productivity, employee well-being and engagement, and it enhances the Company culture.\nBMS is dedicated to ensuring that people with disabilities can excel through a transparent recruitment process, reasonable workplace accommodations/adjustments and ongoing support in their roles. Applicants can request a reasonable workplace accommodation/adjustment prior to accepting a job offer. If you require reasonable accommodations/adjustments in completing this application, or in any part of the recruitment process, direct your inquiries to adastaffingsupport@bms.com. Visit careers.bms.com/eeo-accessibility to access our complete Equal Employment Opportunity statement.\nBMS cares about your well-being and the well-being of our staff, customers, patients, and communities. As a result, the Company strongly recommends that all employees be fully vaccinated for Covid-19 and keep up to date with Covid-19 boosters.\nBMS will consider for employment qualified applicants with arrest and conviction records, pursuant to applicable laws in your area.\nAny data processed in connection with role applications will be treated in accordance with applicable data privacy policies and regulations.",
        "Job Link": "/pagead/clk?mo=r&ad=-6NYlbfkN0C8DhssTksZ4tAWhh8LVIFF2qionQVVpONm6qYGpiaOiReQCnL4QXiieTURaHLEi86XdvHkMwU-dJfY4CWsRTUtGcvPwe2-vh-XKTWMHg__4tU_cN10DMcjJLH4OEj65Jgx3jTSBa2EgpThzfC-FePd8DLFBIdT-VGZmuJIgpLg-es817swHjQgni3egECvYGLNICfTseh1BDBhD-B9s94qum4-dH30c1MZIN934P8DkML-s02UsGdvf-bxcuuekVKgCPaYHBPO7pKEUSoXoyE5qTcyJ7H3nSkB0EfXWs1R7bh9GlhpgAfmcZQihU9Jzq8cx0hHyQCFJtdafekBOsGvxQqMxkHj4STWV2vRIE53X5SLy9eVd7Tdcd5Zc_qgHUqwR8FZSFyabfB57H5tE0r4WgZSFnaYPmBsRzydm5duk82swEjJaW94qaT67n_Bz6FLxqXe5rPqwQ3ILDAurtz8U_odprgI5AWYczb4pz-AIQ30OtiWF2r9IPQpOR8ltERepXheAP3c6ovcaDqfOTf-Nz8Rx4_6K0mogBLQXWyahJYgBHN7ReOiPJONQ_EyFbCjR-ZTcBm_Y7F8c5pHefjgIMe4_YdHUxc4-CP1J2aampzn1BeXdL37vfb2vgPQcDMRp2k--5BmK8XsEOZo-H2cWc3OJp6OmnFvqTySlmbSC5-AA46aZE9WnrOZq1U7GPiYbXWyFIBQikxGYE2bM_ihf6fFe5YK_hQ7SAmJaRa1IoNLgt4DYFTC9njgF-sevs16_IXq93OPfA==&xkcb=SoCC-_M3NnQvDZQHNZ0GbzkdCdPP&p=13&fvj=0&vjs=3",
        "state": "Telangana"
    },
    {
        "Title": "Big Data Solutions Data Science-India,REMOTE",
        "Location": "Remote in India",
        "Company": "Tookitaki Holding PTE LTD",
        "Salary": "50K",
        "Sponsored": "",
        "Description": "Job Title: Big Data Solutions Data Science\nReporting to: Director, Product management\nLocation: India (Remote)\nOur Ideal Candidate\nWe are seeking a highly skilled data scientist to join our team and lead the implementation of our proprietary Big Data Machine Learning solution in the financial crime space. You will be responsible for identifying and analyzing complex financial data, configuring predictive models, and implementing advanced analytical methods to test and validate output generated by the predictive models. The key responsibilities will include –\nResponsibilities:\nAnalyze and interpret complex financial data to identify & validate patterns, trends, and anomalies that may indicate fraudulent activity.\nUnderstand and implement the different configuration techniques across the financial crime solution suite.\nCollaborate and communicate data requirements and formats to customers.\nCollaborate with solution engineers, SMEs, product owners, product managers and development teams to get the optimal output for the customer.\nContinuously monitor and evaluate the performance of analytical models and algorithms and make recommendations for improvements.\nConduct research and stay up to date on industry trends, new technologies, and best practices related to financial crime detection and prevention.\nCommunicate insights and recommendations to both technical and non-technical stakeholders, including senior management.\nRequirements:\nBachelor's or advanced degree in Computer Science, Data Science, Statistics, Mathematics, or a related field\n5 years of experience in data science, machine learning, or related field, preferably in the financial services industry\nStrong proficiency in programming languages such as Python, R, and SQL, and experience with Big Data technologies such as Hadoop, Spark, and NoSQL databases.\nStrong knowledge of statistical modelling techniques, machine learning algorithms, and data visualization tools.\nExcellent analytical skills, with the ability to analyze complex financial data and identify patterns and trends.\nStrong communication skills, with the ability to explain complex technical concepts to customers in a simple manner.\nCompensation & Job Perks\nOpportunity to build AI and Analytics products for Global Markets.\nOpportunity to innovate, Learn and Grow.\nAttractive variable compensation package.\nFlexible working hours - everything is results-oriented.\nOpportunity to work with an award-winning organization in the hottest space in tech - artificial intelligence and advanced machine learning.",
        "Job Link": "/rc/clk?jk=85a76925dc745840&fccid=baa5a085a6dc8988&vjs=3",
        "state": "Remote in India"
    }
]