[
    {
        "Title": "Full Stack Game Developer with VR/AR Experience focusing on Meta App Level",
        "Location": "Kalkaji Devi, Delhi",
        "Company": "Credentia Enterprises",
        "Salary": "500000",
        "Sponsored": "",
        "Description": "We're seeking a Full Stack Game Developer who specializes in Virtual Reality (VR) and\nAugmented Reality (AR) to bring our innovative metaverse application to life. This role is ideal for a passionate, skilled developer who is able to manage both the aesthetics and the technical aspects of game development.\nKey Responsibilities:\n● Designing and implementing engaging 3D environments and experiences.\n● Front-end development, including 3D modeling, UI/UX design, and creating visual elements that users interact within the metaverse.\n● Back-end development, which includes server management, database integration, and crafting application logic.\n● Leveraging your expertise with game engines such as Unity or Unreal Engine, which are key to metaverse application development.\nRequired Skills & Experience:\n● Proficient in C# (for Unity) or C++ (for Unreal Engine).\n● Proven experience in VR/AR development.\n● Ability to work with both front and back end of game development.\n● Understanding of the unique design considerations and technical challenges that come with VR/AR development.\nPlease note: developing a metaverse application is a sophisticated process that demands a diverse range of specialized skills. We're looking for a committed developer who's ready to rise to the challenge.\nIf you are eager to push the boundaries of VR/AR technology and leave your mark on the metaverse, we'd love to hear from you. Apply today!\nJob Type: Full-time\nPay: ₹25,000.00 - ₹50,000.00 per month\nAbility to commute/relocate:\nKalkaji Devi, Delhi: Reliably commute or planning to relocate before starting work (Required)\nEducation:\nBachelor's (Required)\nExperience:\nC#: 1 year (Required)\nUnreal Engine: 1 year (Required)\nC: 1 year (Required)\nWork Location: In person",
        "Job Link": "/pagead/clk?mo=r&ad=-6NYlbfkN0ByPkKOYIWUEGkidNeCM1h-J-Dwcd3RmJERu6RA0WFRhYcF7MJAfvP9mzBxq5JasZBDITjhoDE0QZWU8kSdJ72GSYu7oz8bsm_bHYrwysuvzr5odwAnJp-2bGJDNZ2_KHh_zWEf2XzfzfVd9kAcyA7RRcXirYjrBYY7G9AJFwAXFU4Eyy2mELqP540fEkjTyZ6FUxie5tvPlkovB6DQu4uObpg3F_h3yWd4mO4xL58BGoudvVabCIvzViPtFS0RvT-SmJKcFs0pbOi203cj7lgyXLfe5l752KimJrotJYCkV9CBtg9MX6HaCrnL_DAi-akqWCONZIxr4tmg_2fWcpVg52-1AWrY1ySzpk511wiJ79W9VlOij2GwGjBYFt_MDhz0A5k340XHCs24D7XXggV3iOdsr1JjrpJ7gZzrbidCUUjrNieSxkD1jieB3i5Pf4HJwkpxCT2oikC4gI6QD2Ks33n5sxgOGoDiNxYc8vmRxVL0VwJUJxFid0-MrqUwVWJbsPreaOOllbruBoa0o2jIc04V8wLmJ-fxjuDBtWAl2YWinMEpZA7yZ8_k6kf7vAArAroo0RJNH8cQcLe1MpuE8843acLpEyE=&xkcb=SoDM-_M3NjYXfzRZcJ0LbzkdCdPP&p=0&fvj=1&vjs=3",
        "state": "Delhi"
    },
    {
        "Title": "Full Stack Developer",
        "Location": "Coimbatore South, Tamil Nadu",
        "Company": "GoZen Technologies",
        "Salary": "400000",
        "Sponsored": "",
        "Description": "About us\nGozen builds world-class b2b software-as-a-service solutions, rated 4.8/5 on Glassdoor by current and former employees with 100% recommendation rate to a friend. We are now hiring for the role of a Full-Stack Developer.\nKey Responsibilities:\nWork with development teams and product managers to ideate software solutions\nDesign client-side and server-side architecture\nBuild the front-end of applications through appealing visual design\nDevelop and manage well-functioning databases and applications\nWrite effective APIs\nTest software to ensure responsiveness and efficiency\nTroubleshoot, debug and upgrade software\nCreate security and data protection settings\nBuild features and applications with a mobile responsive design\nWrite technical documentation\nWorking with AWS\nJob Requirements\nProven experience as a Full Stack Developer or similar role\nExperience developing software and mobile applications\nFamiliarity with common stacks\nKnowledge of multiple front-end languages and libraries (e.g. HTML/ CSS, JavaScript, react )\nKnowledge of multiple back-end languages and JavaScript frameworks especially on Node.js\nFamiliarity with databases (e.g. MySQL, MongoDB), web servers (e.g. Apache), and UI/UX design\nWork Remotely\nNo\nJob Types: Full-time, Regular / Permanent, Fresher\nSalary: ₹20,000.00 - ₹50,000.00 per month\nBenefits:\nFlexible schedule\nFood allowance\nHealth insurance\nLeave encashment\nLife insurance\nPaid sick time\nPaid time off\nSchedule:\nDay shift\nFlexible shift\nMorning shift\nSupplemental pay types:\nJoining bonus\nPerformance bonus\nYearly bonus\nCOVID-19 considerations:\nYes, we ensure masks for all employees and do constant sanitisation of the office.",
        "Job Link": "/pagead/clk?mo=r&ad=-6NYlbfkN0A1Ck7zGmFO2Xb27jyGU7S5P8grr1TFhzF0o9ZFe1fVPtv0YFQtkPGjvGbKwqfXIdyYElA5oYmpxYvJsHHTQvpmTkUTQrjuefUUhXyndK5AO36eterfbnmLxDnGgzBRwONUFe8YNvIv-0s6zQCXl4W0vLiREJxbHGmNObmmp5ozyHP57CKaIU0ssTAtblscD0OM3SZEd0mETvX9ibJdBIcqyCKyIU-ppbKVJR0UJ5zsWO8-RC22-OT0m4ZjODt54r2uFjPsQKU92wbiC1rV2dtNfkaOoZHQXkSt-LgwgjhGflpzNN5sreFiHGAOZcGqb-WiapT97BZE6xJUo5fiayYwlZBtPpzpbZJLkUx-Wy5-Au9nFF_57_Q9m4nDrs-V0dKoqDO71_H2APRZbtv3pLwH4gX17dUdLShrzHt4TJl-XPS8cztm8Mxo4dmCEvQU7EXV-vUru22ZtcOTHarIDGRElZW4CEoKbTqOsBVq66uPEnGTQ_yZyTkDDYBns_2YnJkgs_U42tAOzg==&xkcb=SoB4-_M3NjYXfzRZcJ0KbzkdCdPP&p=1&fvj=1&vjs=3",
        "state": "Tamil Nadu"
    },
    {
        "Title": "Full Stack Developer",
        "Location": "Gurgaon, Haryana",
        "Company": "Indigo Airlines",
        "Salary": "600000",
        "Sponsored": "",
        "Description": "Position Summary\nAt Indigo, cloud computing continues to allow us to modernize and consolidate IT infrastructure, automate workloads, and pursue next-generation innovation. To continue this transformation, we’re seeking an full stack developers who will be part of our Cloud COE and perform cloud native development. The ideal candidate should be skilled in full lifecycle development and well versed with modern software development toolset, strategies. and ability to customize them to help our App innovation and modernization goals.\nObjectives of this Role\nWork in tandem with Cloud Engineering team to identify, refactor and migrate application workloads in the most optimal cloud-based platforms.\nEnsure application performance, uptime, and scale, maintaining high standards of code quality and thoughtful design.\nDevelop cloud native applications for new business requirements.\nJob Key Responsibilities\nDevelop and implement technical design for building and deployment applications, including large-scale data processing, computationally intensive statistical modelling, and advanced analytics\nParticipate in all aspects of the software development life cycle for Cloud solutions, including planning, requirements, development, testing, and quality assurance\nAutomating Deployment and Scale of IaaS/PaaS/SaaS based Solution, automate CI/CD pipeline, and scale workload deployments.\nRefactoring a monolith-based application to microservices.\nDefine best in class standards to aid in guiding microservices based architectural decisions.\nTest, evaluate and recommend technologies to improve our overall solutions.\nEmploy exceptional problem-solving skills, with the ability to see and solve issues before they affect business productivity\nRequired Skills and Qualifications\n3+ years of experience / training in developing and implementing solutions on full lifecycle software development.\nUnderstanding of and experience with the five pillars of a well-architected frameworks\nUnderstanding of 12 factor app methodology for building distributed applications that runs in the cloud and delivered as a service.\nExperience in several of the following areas:\nImplementation of low-latency, high-availability, highly scalable and performant applications.\nIntegrate software components into a fully functional software system\nImplementation of security and data protection\nDocument and maintain software functionality",
        "Job Link": "/rc/clk?jk=b43ce969338adb45&fccid=4993995581bf84f9&vjs=3",
        "state": "Haryana"
    },
    {
        "Title": "Full Stack Developer",
        "Location": "Gurgaon, Haryana",
        "Company": "heads up for tails",
        "Salary": "700000",
        "Sponsored": "",
        "Description": "Responsibilities :\n● Software development experience, one of Python (preferred) or ReactJS/NodeJS.\n● Experience with Messaging architectures - RabbitMQ (preference) or Kafka.\n● Experience with Cloud technologies\n● Experience with Apache NiFi (valued but not necessary)\n● Experience with designing or implementing horizontally scalable solutions\n● Experience working with RESTful APIs\n● CI/CD experience with GitHub actions\n● Experience with google cloud platform.\nQualifications, Skills and Competencies :\n● At least 2 years of experience in building large-scale software applications\n● Experience in building web applications\n● Bachelor’s degree (or equivalent) in computer science, information technology, or engineering\n● Interest in learning new tools, languages, workflows, and philosophies\n● Excellent debugging and optimization skills\n● Experience in unit/integration testing\nJob Type: Full-time\nSalary: ₹2,000,000.00 - ₹2,500,000.00 per year\nBenefits:\nHealth insurance\nSchedule:\nDay shift",
        "Job Link": "/company/Heads-Up-For-Tails/jobs/Full-Stack-Developer-d0beff22b5616167?fccid=92d9a054a20f1e02&vjs=3",
        "state": "Haryana"
    },
    {
        "Title": "Full Stack Developer",
        "Location": "Delhi, Delhi+1 location",
        "Company": "Campus Buddy",
        "Salary": "700000",
        "Sponsored": "",
        "Description": "We are seeking an experienced and passionate Full Stack Web Developer Teacher to join our team. As a Full Stack Web Developer Teacher, you will play a crucial role in educating and inspiring the next generation of web developers. Your primary responsibility will be to design and deliver comprehensive, hands-on courses that cover the fundamentals of full stack web development.\nResponsibilities:\nDevelop curriculum: Create engaging and up-to-date curriculum for full stack web development courses, covering both front-end and back-end technologies, frameworks, and best practices.\nCourse delivery: Conduct lectures, workshops, and practical sessions to teach students the principles and techniques of full stack web development, including HTML, CSS, JavaScript, server-side programming, databases, and deployment.\nProvide guidance and mentorship: Offer personalized guidance and mentorship to students, helping them overcome challenges and develop their skills to become proficient full stack web developers.\nAssess student progress: Design and implement assessments, projects, and assignments to evaluate student understanding and progress, providing constructive feedback and support for improvement.\nStay updated: Continuously research and stay up-to-date with the latest advancements and trends in full stack web development, incorporating relevant updates into the curriculum.\nCollaborate with team members: Work closely with other instructors, curriculum developers, and educational staff to ensure a cohesive and effective learning experience for students.\nSupport student success: Assist students in troubleshooting technical issues, debugging code, and solving problems related to full stack web development.\nFoster a positive learning environment: Create an inclusive, supportive, and collaborative classroom environment that encourages active participation, knowledge sharing, and student engagement.\nRequirements:\nProfessional experience: A minimum of 1 years of industry experience as a full stack web developer, with a proven track record of developing web applications using various technologies and frameworks.\nExpertise in full stack web development: Strong proficiency in front-end technologies (HTML, CSS, JavaScript) and back-end technologies (such as Node.js, Python, Ruby) along with experience working with popular frameworks and libraries (React, Angular, Express, Django, Flask, etc.).\nTeaching or mentoring experience: Prior experience teaching or mentoring individuals or groups in web development, with the ability to effectively explain complex concepts and guide students through hands-on exercises and projects.\nContinuous learning mindset: A passion for learning and staying updated with the latest web development trends, tools, and frameworks.\nCommunication skills: Excellent verbal and written communication skills, with the ability to convey technical concepts clearly and effectively to students of varying skill levels.\nProblem-solving abilities: Strong problem-solving skills and the ability to assist students in overcoming challenges and debugging code effectively.\nEducational background: A bachelor's or master's degree in computer science, software engineering, or a related field is preferred, but not mandatory.\nCollaboration and teamwork: Demonstrated ability to work collaboratively in a team environment, sharing knowledge, ideas, and best practices with colleagues.\nIf you are passionate about web development and have the drive to inspire and educate aspiring developers, this is an exciting opportunity to make a meaningful impact on the next generation of web developers. Join our team and help shape the future of full stack web development education!\nJob Types: Full-time, Part-time, Fresher\nSalary: ₹352,075.10 - ₹1,530,945.06 per year\nSchedule:\nDay shift\nSupplemental pay types:\nOvertime pay\nPerformance bonus\nYearly bonus\nAbility to commute/relocate:\nDelhi, Delhi: Reliably commute or planning to relocate before starting work (Required)\nEducation:\nBachelor's (Preferred)\nExperience:\nAngular: 1 year (Preferred)\ntotal work: 1 year (Preferred)\nJava: 1 year (Preferred)\nSpeak with the employer\n+91 9650250419",
        "Job Link": "/company/CAMPUS-BUDDY/jobs/Full-Stack-Developer-2f0d81a7098e2a67?fccid=7beda1eccd4f2f95&vjs=3",
        "state": "Karnataka"
    },
    {
        "Title": "Full Stack Developer",
        "Location": "Delhi, Delhi",
        "Company": "CoalShastra",
        "Salary": "900000",
        "Sponsored": "",
        "Description": "● Bachelor’s degree in computer science, information technology, or a similar field.\n● Previous experience working as a react.js developer.\n● In-depth knowledge of JavaScript, CSS, HTML, and front-end languages.\n● Knowledge of REACT tools including React.js, Webpack, Enzyme, Redux.\n● Experience with user interface design.\n● Knowledge of performance testing frameworks.\n● Experience with browser-based debugging and performance testing software.\n● Excellent troubleshooting skills.\n● Good project management skills.\nJob Type: Full-time\nSalary: ₹25,000.00 - ₹40,000.00 per month\nBenefits:\nPaid time off\nSchedule:\nDay shift\nSupplemental pay types:\nYearly bonus\nAbility to commute/relocate:\nDelhi, Delhi: Reliably commute or planning to relocate before starting work (Preferred)\nEducation:\nBachelor's (Preferred)\nExperience:\nFull-stack development: 1 year (Preferred)\ntotal work: 1 year (Preferred)",
        "Job Link": "/company/S.-S.-Polymers/jobs/Full-Stack-Developer-dc920125cb0cab0d?fccid=50388cfda0733b67&vjs=3",
        "state": "Delhi"
    },
    {
        "Title": "Full Stack Developer",
        "Location": "Bengaluru, Karnataka",
        "Company": "MUFG Global Service (MGS)",
        "Salary": "650000",
        "Sponsored": "",
        "Description": "About MUFG Global Service (MGS)\nMUFG Enterprise Solutions India Private Limited (MUFG Global Service) is the Global Capabilities Centre (GCC) of Mitsubishi UFJ Financial Group (MUFG), the world's fifth largest financial institution by assets. Launched in 2020, our operations has expanded to a team of over 400 employees across three offices in Bengaluru and Mumbai. We are a global integrated centre of excellence for strategic cross-functional business solutions by offering and creating value, including: IT performance: Development for applications and middleware, support for infrastructure, cyber security and network monitoring, architecture support for supply chain finance and payments products Risk Advisory: KYC Quality Assurance and Control, AML & KYC Advisory, Governance , Issue Management, Conformance Global Business Services: Business Administration and Credit Analysis support.\nJob Description\nRoles and Responsibilities:\nManage data and integration of disparate data with interfaces to systems along with workflows.\nDevelop solutions using programming languages as C#, Python, Java, Node, TypeScript, Angular and/or React.\nWork with cross functional team members to develop prototype, produce design artifacts, develop components, perform and support SIT and UAT testing, triaging and bug fixing\nProduce high functioning, testable code from software designs and specifications along with automated unittests and test-automation suites.\nEnsure timelines and deliverables are understood and communicated.\nMigrate in-house solutions to the cloud in cost-effective manner.\nImplement solutions on AWS native services.\nJob Requirements:\nBachelors' Degree (or foreign equivalent degree) in Information Technology, Information Systems, Computer Science, Software Engineering, or a related field. Experience in the financial services or banking industry is preferred.\n2+ years of programming experience atall levels of the application stack (front end/UI, middle/services, and back end/database) usinga modern language such as C#, Python, Java.\nExperience working with real time and interactive web applications using Nodejs,ReactJS and/or AngularJS.\nProficient in development of Unix Shell Scripting, SQL, and non-relational database such as DynamoDB.\nStrong DevOps focus and experience in Maven, NPM, Jenkins, Ansible, and Nexus Repository.\nExperience with container technologies such as Kubernetes or Docker.\nExperience with test-driven development and automated testing frameworks.\nGood understanding of AWS serverless application model and microservice design principles.\nThorough knowledge of cloud computing concepts as Lambda, Event Source mappings, AWS toolkit, API gateway.\nExperience within a technology organization in the financial services industry.\nExcellent organizational, interpersonal, and communication skills and flexible and adaptable to new environments.\nAbility to quickly learn new systems, products, and businesses.\n\n4-8 years\nJava / Python / C# / Node / Angular / React / DevOps / CICD / Jenkins / Kubernetes / Docker / SQL / AWS / Azure / GCP / Google Cloud Platform / Shell",
        "Job Link": "/pagead/clk?mo=r&ad=-6NYlbfkN0D5mXFGwCT9lo97i3gsfTR9iTAPBTm16RjVfbVH6M8QHLBEL5WYTIbi2SMoRK5m8ansgfz7fvtVHoGPtrat4q3z-3jOXRUOyObyFQ2g8CVcXYW3llC4k1ByPDRlo8nYKaiRY03Iskq2abquD4ilkVctfF2uGTegwCniKHG_5B3yZswQkPzm8aDMORsAX3ibh8E75ZvEwl8mqteDq_XaA-42vqOePKWpwez1-vKtc94YxLE0AGwgixL7YLZKAyT2SHOTB16tIp0ssoRbC0je2an5mSjNfdpkyadX9YuDqUektgoegBVPU0Z_Rbb5loKE38esf1Gethrqj8MpG0dRJCZjmZGaY5cF9mVD0eZbwh6bPqD24DDYBUp3Vj3DJdnu5q56h2NNpiGmy8gDDwh38sOXS3lwcfQRc5gMkwWM6SDicMn-ygBa0DJM5O6G4ylhZfersZLPu_ynRuXfHCN8UmGM19SkhG7tzFBiBPKgNfFy6DvxD_6rqIW1s68ZV8A2wmwp-7dcyCH8dqo3FilDIDZNwgETQlVyeN6w63lpNCA0pFL7D77VbIxj&xkcb=SoD2-_M3NjYXfzRZcJ0NbzkdCdPP&p=6&fvj=0&vjs=3",
        "state": "Karnataka"
    },
    {
        "Title": "Full Stack Developer (Remote)",
        "Location": "Remote",
        "Company": "Lucien Solutions",
        "Salary": "450000",
        "Sponsored": "",
        "Description": "The Full-Stack Software Developer will be responsible for designing, developing, and maintaining software applications that run on both the frontend and backend. Along with developing you will lead the backend and frontend developers technically. The ideal candidate should have expertise in building scalable and robust web applications using modern frontend and backend frameworks.\nResponsibilities:\nCollaborate with the development team to design and develop software applications\nLead\nDevelop and maintain software applications using Node.js, React and Flutter\nMaintain cluster of MongoDB\nWrite efficient and clean code that meets the project requirements\nOptimize applications for maximum speed and scalability\nEnsure that the software is properly tested and documented\nTroubleshoot and debug software issues\nStay up to date with the latest trends and technologies in software development\nRequirements:\nStrong understanding of both frontend and backend development frameworks, specifically Node.js, React and Flutter\nExperience with database systems, such as MySQL, MongoDB, and PostgreSQL\nExcellent programming skills\nFamiliarity with software development tools, such as Git and Asana\nAbility to work in a fast-paced environment and deliver high-quality software within tight deadlines\nStrong problem-solving skills and attention to detail\nExperience with AWS and deploying software to it\nKnowledge of DevOps practices and tools, such as Docker and Kubernetes\nFamiliarity with CI/CD pipelines and automation tools\nJob Type: Full-time\nPay: ₹800,000.00 - ₹1,000,000.00 per year\nBenefits:\nPaid time off\nSchedule:\nDay shift\nExperience:\nBack-end development: 2 years (Preferred)\nFront-end development: 2 years (Preferred)\nLaunching Software Applications: 2 years (Preferred)",
        "Job Link": "/company/Lucien-Solutions/jobs/Full-Stack-Developer-f5dd2df6434faac4?fccid=46a731f406a77461&vjs=3",
        "state": "Karnataka"
    },
    {
        "Title": "Full Stack Developer",
        "Location": "Noida, Uttar Pradesh",
        "Company": "FourBrick Technology OPC Pvt. Ltd.",
        "Salary": "550000",
        "Sponsored": "",
        "Description": "Full Stack Engineer job description includes using a range of different technologies and languages (such as Java, JavaScript, HTML, React, PHP, C#) to develop applications. Full Stack Developers approach software holistically since they cater to both user experience and functionality.\nKnowledge of multiple front-end languages and libraries (e.g. HTML/ CSS, JavaScript, XML, jQuery)\nKnowledge of multiple back-end languages (e.g. C#, Java, Python) and JavaScript frameworks (e.g. Angular, React, Node.js)\nFamiliarity with databases (e.g. MySQL, MongoDB), web servers (e.g. Apache) and UI/UX design\nExcellent communication and teamwork skills\nGreat attention to detail\nOrganizational skills\nAn analytical mind\nDegree in Computer Science, Statistics or relevant field\nJob Type: Full-time\nSalary: ₹15,000.00 - ₹75,000.00 per month\nSchedule:\nDay shift\nAbility to commute/relocate:\nNoida, Uttar Pradesh: Reliably commute or planning to relocate before starting work (Required)\nEducation:\nBachelor's (Preferred)\nExperience:\nFull-stack development: 2 years (Preferred)\nReact: 2 years (Preferred)",
        "Job Link": "/company/Fourbrick-Technology-OPC-Pvt.-Ltd./jobs/Full-Stack-Developer-1290f51395128714?fccid=f34210c4e9aca989&vjs=3",
        "state": "Uttar Pradesh"
    },
    {
        "Title": "Full Stack Developer",
        "Location": "Remote in Delhi, Delhi",
        "Company": "Bennett Technologies",
        "Salary": "450000",
        "Sponsored": "",
        "Description": "Part time remote work with Bennett Technologies.\nResponsibilities include:\nDevelopment\nSkills required:\nReact.js/Nodejs\nStrong UI/UX experience\nExperience: 4+ years of experience\nJob Types: Part-time, Freelance\nContract length: 12 months\nPart-time hours: 20 per week\nSalary: ₹400.00 - ₹600.00 per hour\nSchedule:\nWeekend availability\nWeekend only\nApplication Question(s):\nHave you ever worked as part-time or freelance before?\nWill you be able to give 15-20 hours per week (including weekends) for the project?\nExperience:\nReact: 2 years (Required)\ntotal work: 3 years (Required)\nNode.js: 2 years (Preferred)\nWork Location: In person\nExpected Start Date: 01/07/2023",
        "Job Link": "/company/Bennett-Technologies/jobs/Full-Stack-Developer-612b3f637fbec7a1?fccid=f209261744c0a47f&vjs=3",
        "state": "Delhi"
    },
    {
        "Title": "Full Stack Developer",
        "Location": "Bengaluru, Karnataka",
        "Company": "Mercedes-Benz Research and Development India...",
        "Salary": "700000",
        "Sponsored": "",
        "Description": "Aufgaben\nBecome part of a team which is responsible for the global system landscape for diverse functions such as Finance & Controlling, Procurement, Corporate Audit, Legal, Compliance, Treasury, Corporate Strategy and more. Our responsibility extends from consulting and the conceptualization and realization of projects to managing the existing IT system landscape.\n\nAs part of our new team Finance Mercedes Analytics Solutions, you will develop and run advanced analytics solutions end-to-end for our Finance & Controlling units at Mercedes-Benz Cars, from Ideation over Proof-of-Concept, Professionalization to Operations. With Advanced Analytics, we develop insights into Financial KPIs for data-driven decision-making, thereby shaping the digital future of Daimler.\n\nJoin our team of experts in Advanced Analytics, Artificial Intelligence, Big Data Architecture, API and Data Management.\n\nDesign overall architecture of the analytics applications for applications\n\no Work collaboratively with local and remote IT teams to deploy and operate the systems\n\no Help automate and streamline the operations and processes.\n\no Build and maintain tools for deployment, monitoring and operations.\n\no Provide Technology leadership to the team around architecture and implementation\n\no Maintain quality and ensure responsiveness of applications.\n\no Collaborate with the local, remote and business teams to design and launch new features.\n\no Maintain code integrity and organization.\n\no Help evaluate and establish appropriate technology stack\nQualifikationen\nFrontend development\n\no Strong skills in the de facto Web 2.0 stack (as HTML5, CSS3, Vanilla JavaScript) and ability to develop cross-browser, multilingual, interactive, responsive and animated content\n\no Strong skills in working with the most known JavaScript frameworks such as Angular(2+), React\n\no Experience with UI components and ability to decompose a wireframe into sub-elements; components reusability and UI multi-theming\n\no Experience with REST and APIs\n\no Experience with JS Libs (Advantages are D3.js, Graph.js, _.JS, lodash, Redux)\n\no Knowledge about Vue.js: single page applications\n\no Knowledge about state-of-the-art Dev tools (like NPM, Git/SVN, Webpack, Gulp/Grunt) and ability to transform code into solid products within short time\n\no Knowledge about mobilizing an application with React Native and/or Ionic is an advantage\n\n\nBackend development/ Database expertise\n\no Strong skills in a modern language and framework combination such as Java/Spring\n\no Strong skills in a SQL technology, such as Postgres, MySQL or similar\n\no Experience working with version control tools such as Git\n\no Knowledge of NoSQL technologies\n\no Experience with container platforms such as Docker\n\no Experience with continuous integration practices and tools such as Jenkins\n\no Experience building web/mobile back-ends and APIs\n\n\nSystem architecture\n\no Define which platform components to use for each use case and how\n\no Integration of data sources and systems\n\n\nIT Operations (Maintenance, Support, others)\n\nTesting & Automation (e.g. CI/CD, API, others)\n\nNice to Have:\n\nDeveloper with already existing Daimler IT background/experience would be very beneficial\nAffinity for advanced analytics, statistics, mathematics. Understanding of R and Python code. Knowhow about Cloudera stack and analytics workbenches (e.g. Dataiku) are an advantage.\n\nOther qualifications needed:\n\nDegree in Computer Science, Software Engineering or similar qualification and relevant work experience\n\nGood English language skills (German language skills are an advantage, but not necessary)\n\nWillingness to travel (up to 50%)\n\nGood team player. Eager to take over responsibility, to learn. Flexibility\n\n“Technology lovers”, innovative mindset",
        "Job Link": "/rc/clk?jk=251e0e38e75364bb&fccid=9ab138c02aaca829&vjs=3",
        "state": "Karnataka"
    },
    {
        "Title": "Java Full Stack Developer",
        "Location": "Remote in Gurgaon, Haryana",
        "Company": "Big Leap Digital Services Pvt Ltd",
        "Salary": "600000",
        "Sponsored": "",
        "Description": "Develop applications using Python, ReactJS and JavaScript.\nExperience in designing and integrating RESTful APIs\nExperience with Database MySQL.\nAbility to solve problems and device solutions.\nExcellent debugging and optimization skills\nShowcase excellence in delivering code.\nFollow coding standards and conventions strictly.\nWillingness to learn new technologies.\nJob Type: Full-time\nSalary: ₹500,000.00 - ₹1,000,000.00 per year\nBenefits:\nHealth insurance\nPaid sick time\nPaid time off\nWork from home\nSchedule:\nDay shift\nMonday to Friday\nSupplemental pay types:\nPerformance bonus\nAbility to commute/relocate:\nGurgaon, Haryana: Reliably commute or planning to relocate before starting work (Required)\nApplication Question(s):\nWhat is your current CTC?\nEducation:\nBachelor's (Preferred)\nExperience:\nAngular: 3 years (Preferred)\ntotal work: 4 years (Preferred)\nJava: 3 years (Preferred)\nWork Location: In person",
        "Job Link": "/company/Big-Leap-Digital-Services-Pvt-Ltd/jobs/Full-Stack-Developer-a73a0dcfb386bd6b?fccid=0b41a07423aca7b4&vjs=3",
        "state": "Haryana"
    },
    {
        "Title": "Full Stack Developer",
        "Location": "Remote",
        "Company": "Unique Inspiration",
        "Salary": "100000",
        "Sponsored": "",
        "Description": "Responsibilities:\nDeveloping Web Applications architecture for frontend as well as backend.\nDeveloped and deployed production quality code in tech stacks - React + Redux, JavaScript/Typescript, Node.js, MySQL etc.\nCreating servers and databases for functionality.\nDesigning and developing APIs.\nDevelop and manage well-functioning databases and applications\nShould be good in sockets, payment gateways\nTest applications to ensure responsiveness and efficiency\nRequirements:\nStrong in Node.js, JavaScript, React.js, Express.js, MongoDB\nProficiency in fundamental front-end languages such as HTML, CSS, and JavaScript.\nProficiency in server-side languages such as Node.js and related\nFamiliarity with database technology such as MySQL, Oracle, and MongoDB.\nJob Types: Part-time, Freelance\nSalary: ₹300,000.00 - ₹600,000.00 per year\nBenefits:\nFlexible schedule\nLeave encashment\nSupplemental pay types:\nPerformance bonus\nEducation:\nBachelor's (Preferred)\nExperience:\nNode.js: 2 years (Required)\ntotal work: 3 years (Required)\nReact: 2 years (Required)\nSocket.IO: 2 years (Required)\nChatbot: 2 years (Required)",
        "Job Link": "/company/Unique-Inspiration/jobs/Full-Stack-Developer-db96e05257b06efa?fccid=dd616958bd9ddc12&vjs=3",
        "state": "Delhi"
    },
    {
        "Title": "Lead Developer - RPA",
        "Location": "Bengaluru, Karnataka",
        "Company": "lululemon India Tech Hub",
        "Salary": "500000",
        "Sponsored": "",
        "Description": "About lululemon India Tech Hub\nlululemon is an innovative performance apparel company for yoga, running, training, and other athletic pursuits. Setting the bar in technical fabrics and functional design, we create transformational products and experiences that support people in moving, growing, connecting, and being well. We owe our success to our innovative products, commitment to our people, and the incredible connections we make in every community we're in. As a company, we focus on creating positive change to build a healthier, thriving future. In particular, that includes creating an equitable, inclusive and growth-focused environment for our people. As we continue to elevate our shopping experience, our India Tech Hub plays a key role in expanding our technology capabilities in Product Systems, Merchandising and Planning, Digital Presence, distribution and logistics, and corporate systems. Our team in India works as an extension of the global team on projects of strategic importance.\nJob Description\nWho we are?\nlululemon is a yoga-inspired technical apparel company up to big things.\nThe practice and philosophy of yoga informs our overall purpose to elevate the world through the power of practice.\nWe are proud to be a growing global company with locations all around the world, from Vancouver to Shanghai, and places in between. We owe our success to our innovative product, our emphasis on our stores, our commitment to our people, and the incredible connections we get to make in every community we are in.\nQualifications\nApproximately 3-5 years of related work experience with uiPath\nA degree in computer science, technology, engineering, and math STEM degree preferred or equivalent industry experience\nMinimum 5 years of experience in web-based technologies\nUiPath Advanced RPA Developer certification or UiARD certification preferred\nExposure to the full software development life cycle, including design, configuration, integration, testing and support including, but not limited to, gathering requirements, designing the future state solution, the development work breakdown, as well as supporting quality assurance and post-production efforts.\nDesired Qualifications:\nPreferred technical stack:\n.Net framework and .Net Core\nUnderstanding of relational databases\nUi Path Studio and workflow management\nExperience working with APIs\nTools: Gitlab, Jira, Confluence\nExperience with unit testing frameworks\nStrong skills at performance application tuning A day in the life:\nDevelop, test and implement efficient automation solutions with a focus on scalability and reusability\nEnsure design solutions meet business requirements\nSet up the RPA environment (software installation, installation of related technologies, migrations and upgrades of the infrastructure)\nConfigure new/existing processes and objects using core workflow principles that are efficient, well structured, maintainable using Robotics technologies such as UiPath\nParticipate in RPA Architecture design and solutioning\nValidate process design documents and report on technical feasibility\nTranslate business and process documents into RPA process workflows\nDirect efforts to define technical, operational, and user requirements\nConduct UAT phases to identify and to fix bugs or changes\nComply with and help to enforce design and coding standards, policies, and procedures\nBe actively involved in designing new RPA features and functionality, improving scalability and maintainability\nSupport a complex (cloud to cloud) infrastructure environment; evaluate (with recommendations) to enable proper operability of applications on both infrastructure and software levels\nSupport team in defining technical requirements to facilitate design, development, testing, implementation, and ongoing support of applications within scoped teams\nEnsure timely resolution of blocker issues\nSupport existing processes in production, addressing issues in a timely fashion, respecting agreed upon service level objectives\nBe an active voice in defining and implementing best practices, standards and procedures including quality and delivery methodologies\nEnsure compliance with the documented software processes and procedures throughout the life cycle of software products\nEnsure the governance models for the RPA processes are being defined and followed\nProvide level 3 support for robot production issue\n\n10-15 years\nRPA / UiPath / Rest / Rest API / Git / Jira / Confluence",
        "Job Link": "/pagead/clk?mo=r&ad=-6NYlbfkN0D5mXFGwCT9lo97i3gsfTR9iTAPBTm16RjVfbVH6M8QHLBEL5WYTIbi2SMoRK5m8ansgfz7fvtVHqCs6BFNQZbtX8yg8xJLwq61Hr5lmWu0XJi25WEH3Hhfd6ku6tIXHHKXlWsP8h2t14xjaa8NuyCjlF3_z9VyV-B_EjoF56x0E4tubih5hY8wDr8vvfNKbyz1XMgHWy30kFt_LNj6YQ3hET9N9Cph21l7kvySWu33-OktqvCcz_1C0JcDnFs3toMXAGhW0D3w2guKKcKdiEE8QL_XBqmhoEjH7yMZ6AN70PsyPK_UuLrpzxwXf7qeflbCHcZ4mnEvdhQ7-kY5TjyK8nwCrGVj0XvDbQwkcbVoX_roTP4OmO4_R2TQDgo3vzL2gd-aZzobve3OYKEQfWtLWhK-zQUhZdZh-w48bZI9fbyr2vY1bWMUAuy44NtBBawEfobJKEJxY7H8QBrpOEzlp_qv9TC_ztVagy8Mxz7wt1j4pKFbbyGQvLZ2PD-nUeLsjEcMk0Jf77oNXm0K2U-EJOdKFHN0rYpnc63dd6OOxROpIIGupPdigScPPMl63kQIWHWye1Afk2vCRnr9cDcFiFmt1oFtUAA92j2kbGYXaQ==&xkcb=SoCR-_M3NjYXfzRZcJ0FbzkdCdPP&p=13&fvj=0&vjs=3",
        "state": "Karnataka"
    },
    {
        "Title": "Full-Stack Web Development",
        "Location": "Remote",
        "Company": "GRE Development Ltd.",
        "Salary": "800000",
        "Sponsored": "",
        "Description": "Overview\nWe are looking for an experienced Back-end developer to join our IT team! As a Back-end Developer, you will be responsible for the server-side web application logic using Pure PHP.\nIf you have outstanding programming skills and a great passion for developing beautiful, innovative applications, then you will love this job.\nDuties and responsibilities\nBe involved and participate in the overall application lifecycle\nMain focus on coding and debugging\nCollaborate with Front-end developers\nDefine and communicate technical and design requirements\nBuild high-quality reusable code that can be used in thew future\nDevelop functional and sustainable web applications with clean codes\nTroubleshoot and debug applications\nLearn about new technologies\nStay up to date with current best practices\nManage cutting-edge technologies to improve applications\nCollaborate with multidisciplinary team of designers, developers and system administrators\nFollow new and emerging technologies\nRequirements and qualifications\nA minimum of 3 years of experience as a Back-end developer\nIn-depth understanding of web development\nA minimum of 3 years of experience with PHP programming language\nFamiliarity with front-end languages such as HTML, JavaScript and CSS\nCritical thinker and problem-solving skills\nGood knowledge in Git & Github\nJob Types: Full-time, Part-time, Temporary, Contract\nContract length: 3 months\nPart-time hours: 32 per week\nSalary: ₹42,975.56 - ₹114,601.48 per month\nBenefits:\nFlexible schedule\nWork from home\nSchedule:\nDay shift\nEvening shift\nFixed shift\nSupplemental pay types:\nOvertime pay\nPerformance bonus\nApplication Question(s):\nWhat's the expected MONTHLY salary for working 8 hours per day (except Friday)?\nExperience:\nBack-end development: 4 years (Required)\nLanguage:\nEnglish (Required)\nWork Location: Remote",
        "Job Link": "/company/GRE-Development-Ltd./jobs/Full-Stack-Developer-1125ecb0d35bc70c?fccid=9181fa1a4351557e&vjs=3",
        "state": "Delhi"
    },
    {
        "Title": "Full Stack Developer",
        "Location": "Noida, Uttar Pradesh",
        "Company": "4Bell Technology",
        "Salary": "",
        "Sponsored": "",
        "Description": "Design and develop the stories assigned within the estimated time and with high quality. Write appropriate unit test cases.\nUnit tests those stories and deploys them in various environments for SQM to verify.\nParticipate and get involved in agile ceremonies like scrum, PBR, review, and retrospective.\nParticipate in discussions with stakeholders from all over. Sometimes the discussions happen during late hours.\nLog daily 8 hrs of effort in ADO/JIRA while working on these stories.\nJob Types: Full-time, Regular / Permanent\nSalary: ₹700,000.00 - ₹1,900,000.00 per year\nBenefits:\nHealth insurance\nPaid sick time\nProvident Fund\nSchedule:\nDay shift\nEvening shift\nMonday to Friday\nSupplemental pay types:\nPerformance bonus\nQuarterly bonus\nYearly bonus\nAbility to commute/relocate:\nNoida, Uttar Pradesh: Reliably commute or planning to relocate before starting work (Required)\nEducation:\nBachelor's (Preferred)",
        "Job Link": "/company/4Bell-Technology/jobs/Full-Stack-Developer-6e1a772ce56ce6ff?fccid=796a5f1c8bee66df&vjs=3",
        "state": "Uttar Pradesh"
    },
    {
        "Title": "Full Stack Developer (PHP)",
        "Location": "India+1 location",
        "Company": "Product Pandas",
        "Salary": "",
        "Sponsored": "",
        "Description": "Work Timings: 5:00 PM-2 AM Indian Time Monday to Friday\nThis is a Full-time long-term contract position with paid leaves, health insurance, and other benefits\nThe budget for this position is between 14-17 LPA\n\nAt ProductPandas, we are seeking an experienced Full Stack Developer with a strong focus on PHP to join our team. The ideal candidate will have a minimum of 5 years of PHP experience and should have completed at least one project involving the migration of code from an older PHP version to a newer version. Experience with PHP 8.1 version is highly desirable. The successful candidate will also have a solid understanding of HTML, CSS, JavaScript, and MySQL, with a minimum of 2 years of exposure to these technologies.\n\nResponsibilities:\nDevelop, maintain, and enhance web applications using PHP, HTML, CSS, and JavaScript.\nCollaborate with cross-functional teams, including UX/UI designers, backend developers, and project managers, to develop high-quality web applications.\nParticipate in code reviews to ensure code quality and adherence to coding standards.\nTroubleshoot and resolve software defects and issues in a timely manner.\nCollaborate with stakeholders to gather and analyze requirements, and provide technical expertise in designing and implementing solutions.\nStay up-to-date with industry trends and best practices, and continuously improve technical skills.\nRequirements:\n\nIdeal Candidate Profile\nMinimum of 5 years of professional PHP development experience.\nProven experience with at least one project involving migration of code from an older PHP version to a newer version.\nStrong experience working on PHP 8.1 version is required\nProficient in HTML, CSS, and JavaScript with a minimum of 2 years of experience.\nStrong understanding of MySQL and database design.\nExperience with version control systems, such as Git.\nExcellent problem-solving skills and ability to work in a fast-paced environment.\nStrong communication skills, both written and verbal.\n\nIf you are a highly skilled Full Stack Developer with a focus on PHP and have experience with HTML/CSS/JavaScript and MySQL, we would love to hear from you",
        "Job Link": "/rc/clk?jk=62eaf10a2ed8aedf&fccid=049e9d2825fc3adf&vjs=3",
        "state": "Punjab"
    },
    {
        "Title": "Full Stack Developer",
        "Location": "Remote in Ahmedabad, Gujarat",
        "Company": "Innovatis Technologies Inc",
        "Salary": "",
        "Sponsored": "",
        "Description": "About Us\nBit01 is a Technology Company, specialized in Enterprise Mobile Apps and Enterprise Web Solutions. The company takes pride in providing the best technology for their client's needs to ensure they stay ahead of competitors with cutting-edge solutions that take them through digital transformation.\nWe are looking for talented individuals in MEAN Stack & MERN Stack who have an \"I can do this\" attitude to join our team pool!\nRequirements\nKnowledge and Experience\nExperience between 1 years to 4 years specially working on MEAN/MERN Stack Projects.\nStrong experience working on large & complex systems that runs over real time environment.\nStrong experience working on NodeJS, Express, Angular or ReactJS.\nStrong understanding of JavaScript & TypeScript is MUST.\nStrong experience working with SQL & NoSQL database system like MySQL & MongoDB.\nAbility to build & consume secured REST APIs.\nAbility to build reusable components and libraries for future use.\nExperience or Knowledge with Elastic Search, Redis, AWS or GCP Cloud will be a plus point.\nSelf-learning abilities are must.\nFamiliarity with upcoming new technologies is a strong plus\nRoles and Responsibilities\nWork within an Agile project to build, design and implement business solutions.\nGather the requirements and specifications to understand the client requirements in a detailed manner and translate the same into system requirements.\nEnsuring high performance of the software on desktop and mobile.\nDevelopment of high quality, robust business solutions to meet business expectations.\nCollaborate in a team for learning and sharing knowledge.\nEngage in the development of applications to a production environment.\nPersonal Competency\nStrong communication skills are MUST\nSelf-motivated, detail-oriented\nStrong organizational skills\nAbility to prioritize workloads and meet deadlines\nFluent English speaker\nReady to learn new technologies & frameworks\nBenefits\nNo Bond Policy\nFlat hierarchy\n5 days a week\nFlexible in terms of office time.\nEmployee friendly environment.\nPerformance based rating system and appraisal.\nOpen work culture.\nOffering career development certification course.\nJob Type: Full-time\nPay: ₹1,400,000.00 per year\nBenefits:\nCell phone reimbursement\nHealth insurance\nPaid sick time\nProvident Fund\nWork from home\nSchedule:\nDay shift\nFixed shift\nMonday to Friday\nSupplemental pay types:\nPerformance bonus\nYearly bonus\nAbility to commute/relocate:\nAhmedabad, Gujarat: Reliably commute or planning to relocate before starting work (Required)\nEducation:\nBachelor's (Preferred)\nExperience:\nDatabase development: 1 year (Preferred)\nTypeScript: 1 year (Preferred)\nJavaScript: 1 year (Preferred)\nWork Location: In person",
        "Job Link": "/company/Innovatis-Technologies-Inc/jobs/Full-Stack-Developer-a7eda5840de89593?fccid=2ea983230f65d60c&vjs=3",
        "state": "Gujarat"
    },
    {
        "Title": "Full Stack Developer",
        "Location": "Chennai, Tamil Nadu+1 location",
        "Company": "JOBBYCART TECHNOLOGIES",
        "Salary": "",
        "Sponsored": "",
        "Description": "We are looking for a Full Stack Developer with 2-5 years of experience, responsible for managing the interchange of data between the server and the users. Your primary focus will be the development of all server-side logic, definition, and maintenance of the central database, and ensuring high performance and responsiveness to requests from the front-end and back end.\nResponsibilities:\n- Responsible for the overall architecture of the application.\n- Solid experience with Responsive Web Design\n- Implementation of a robust set of services and APIs to power the web application.\n- Building reusable code and libraries for future use.\n- Optimization of the application for maximum speed and scalability.\n- Implementing security and data protection.\n- Integration of the front-end and back-end aspects of the web application.\nSkills Sets Required: Angular, Node JS , React JS & mongo DB\nMust Do:\nCreating database schemas that represent and support business processes\nImplementing precise code\nProficient understanding of code versioning tools, such as Git\nJob Type: Full-time\nSalary: ₹50,000.00 - ₹90,000.00 per month\nBenefits:\nHealth insurance\nInternet reimbursement\nLife insurance\nSchedule:\nMorning shift\nSupplemental pay types:\nYearly bonus\nApplication Question(s):\nAre you Ready to relocate Trichy?\nEducation:\nBachelor's (Preferred)\nExperience:\ntotal work: 2 years (Preferred)",
        "Job Link": "/company/Inymart-institute-of-digital-learning/jobs/Full-Stack-Developer-51dd2c61657fe195?fccid=0f86de548dfc72bd&vjs=3",
        "state": "Tamil Nadu"
    },
    {
        "Title": "Full Stack Developer",
        "Location": "Gurgaon, Haryana",
        "Company": "heads up for tails",
        "Salary": "",
        "Sponsored": "",
        "Description": "Responsibilities :\n● Software development experience, one of Python (preferred) or ReactJS/NodeJS.\n● Experience with Messaging architectures - RabbitMQ (preference) or Kafka.\n● Experience with Cloud technologies\n● Experience with Apache NiFi (valued but not necessary)\n● Experience with designing or implementing horizontally scalable solutions\n● Experience working with RESTful APIs\n● CI/CD experience with GitHub actions\n● Experience with google cloud platform.\nQualifications, Skills and Competencies :\n● At least 2 years of experience in building large-scale software applications\n● Experience in building web applications\n● Bachelor’s degree (or equivalent) in computer science, information technology, or engineering\n● Interest in learning new tools, languages, workflows, and philosophies\n● Excellent debugging and optimization skills\n● Experience in unit/integration testing\nJob Type: Full-time\nSalary: ₹2,000,000.00 - ₹2,500,000.00 per year\nBenefits:\nHealth insurance\nSchedule:\nDay shift",
        "Job Link": "/company/Heads-Up-For-Tails/jobs/Full-Stack-Developer-d0beff22b5616167?fccid=92d9a054a20f1e02&vjs=3",
        "state": "Haryana"
    },
    {
        "Title": "PowerBI Developers [I/E2-JM2]",
        "Location": "Gurgaon, Haryana",
        "Company": "vinove",
        "Salary": "",
        "Sponsored": "",
        "Description": "JOB SYNOPSIS\nWe are looking for multiple PowerBI developers with vast experience in data preparation, data gateway and data warehousing projects Along With familiarity with Microsoft Business Intelligence Stack having Power BI, SSAS, SSRS, SSIS. As a Power BI developer and administration , you have expertise on Building Analysis Services reporting models. Developing visual reports, dashboards and KPI scorecards using Power BI desktop. Connecting to data sources, importing data and transforming data for Business Intelligence.\n\nJOB RESPONSIBILITIES\nGood experience with Ingesting data from a variety of corporate data sources and performing required transformations in the Power BI query editor using a mixture of utilizing the UI and writing M code.\nUtilizing effectively the navigation features in Power BI (e.g. bookmarks, drill-through) to guide readers through a compelling data-driven story.\nProvide technical support and guidance through prototyping, testing, build, and launch of Power BI products.\nShould be familiar and experienced in SQL, writing stored procedures and query optimization\nDeveloping visual reports, dashboards and KPI scorecards using Power BI desktop.\nConnecting to data sources, importing data and transforming data for Business Intelligence.\nExcellent in analytical thinking for translating data into informative visuals and reports.\n\nJOB REQUIREMENTS\nAble to implement row level security on data and have an understanding of application security layer models in Power BI.\nProficient in making DAX , M code, Power Bi Queries, Dynamic SQl queries in Power BI desktop.\nExpertise in using advance level calculations on the data set.\nUnderstanding how the full suite of Power BI products work is essential (embedded, Reporting Services)\nExperience in writing ETL process SSIS, SSAS, Fact & dimension tables along with Snake and snowflake schema\nResponsible for design methodology and project documentation.\nAble to develop tabular and multidimensional models that are compatible with warehouse standards.\nAdept in developing, publishing and scheduling Power BI reports as per the business requirements.\nAble to properly understand the business requirements and develop data models accordingly by taking care of the resources.\nShould have knowledge and skills for secondary tools such as Microsoft Azure, SQL data warehouse, PolyBase, Visual Studio, etc. NoSQL will be considered as additional skills.\nAble to integrate Power BI reports into other applications using embedded analytics like Power BI service (SaaS), or by API automation. Also, one must be experienced",
        "Job Link": "/rc/clk?jk=ec62e9011d8ace36&fccid=eebdf1900b847659&vjs=3",
        "state": "Haryana"
    },
    {
        "Title": "Full Stack Developer",
        "Location": "Gurgaon, Haryana",
        "Company": "Bribooks",
        "Salary": "",
        "Sponsored": "",
        "Description": "Job Description: Full-stack Developer\nAre you a passionate Full-stack Developer? We have an exciting opportunity for you to join our dynamic team in Gurgaon!\nResponsibilities:\n✅ Develop efficient, testable, and reusable modules, websites, admin panels, and web apps using PHP.\n✅ Create database schemas that represent and support business processes.\n✅ Utilise online tools for collaboration, bug tracking, project tracking, and Git repository management.\n✅ Handle various development tasks during the web development life cycle from start to finish.\nRequirements:\n✨ Strong knowledge of PHP web frameworks such as Laravel, CodeIgniter, etc.\n✨ Minimum 2-4 years of experience in the related field.\n✨ Solid understanding of HTML, Next-JS, CSS Less, and JavaScript for building websites and web apps.\n✨ Familiarity with SQL/NoSQL databases and their declarative query languages.\n✨ Proficient understanding of code versioning tools, such as Git.\n✨To apply, please send your resume and cover letter to hcm@bribooks.com\nWe look forward to reviewing your application.\nJob Type: Full-time\nSalary: ₹600,000.00 - ₹800,000.00 per year\nBenefits:\nHealth insurance\nSchedule:\nDay shift\nSupplemental pay types:\nPerformance bonus\nAbility to commute/relocate:\nGurugram, Haryana: Reliably commute or planning to relocate before starting work (Required)\nEducation:\nBachelor's (Preferred)\nSpeak with the employer\n+91 9818056013",
        "Job Link": "/company/Bribooks/jobs/Full-Stack-Developer-232891bb813bdd05?fccid=e1fac1c4e401132b&vjs=3",
        "state": "Haryana"
    },
    {
        "Title": "Full Stack Developer",
        "Location": "Remote",
        "Company": "MyNextFilm Private Limited",
        "Salary": "",
        "Sponsored": "",
        "Description": "Job title: Full Stack Developer UI (React + Django)\nLocation: Remote\nTerms: Full Time Internship\nSalary/rate: As per industry norms\nAbout us:\nMy Next Film (MNF) is a technology start-up which initiate s at developing we based products for filmmakers to automate film making processes and make filmmaking processes easier.\nResponsibilities and Requirements\n1) Degree in Computer Science or related fields\n2) Hands on experience with Full Stack Development UI (React + Django)\n3) Worked with relational databases , non-relational is a plus\n4) Knowledge of front end - backend communication. Front end knowldge of javascript, css and html\n5) Potential leadership skills and excellent team player\n6) Has worked in Agile - Scrum in Sprints , using Jira.\n6) Understanding of deployment using git etc.\nJob Type: Full-time\nSalary: ₹8,000.00 - ₹20,000.00 per month\nBenefits:\nWork from home\nSchedule:\nDay shift\nSupplemental pay types:\nPerformance bonus\nExperience:\ntotal work as a full stack developer : 2 years (Preferred)\nJob Type: Full-time\nSalary: ₹8,000.00 - ₹20,000.00 per month\nBenefits:\nWork from home\nSchedule:\nDay shift\nSupplemental pay types:\nPerformance bonus\nExperience:\nFull-stack development: 2 years (Preferred)\nFull Stack Developer (React+Djano): 2 years (Preferred)",
        "Job Link": "/company/MyNextFilm-Private-Limited/jobs/Full-Stack-Developer-d219f5611303089d?fccid=fabba1f29c63ecbc&vjs=3",
        "state": "Remote"
    },
    {
        "Title": "Full Stack Developer",
        "Location": "Noida, Uttar Pradesh",
        "Company": "Girikon Solutions Pvt Ltd",
        "Salary": "",
        "Sponsored": "",
        "Description": "We are looking for a Full Stack Developer to produce scalable web applications. As a Full Stack Developer, you should be comfortable around both front-end and back-end coding languages, development frameworks, and third-party libraries. You should also be a team player.\nRequirements and skills\nExperience developing Web and mobile applications (Must have)\nExperience in integration with third-party systems (Must have)\nExperience in implementing Natural Language Processing (NLP) for text processing and categorization/recommendation (Must have)\nKnowledge of multiple front-end languages and libraries (e.g., Angular (must have), React (must have), HTML/ CSS, JavaScript, XML, jQuery)\nKnowledge of multiple back-end languages (Node.js (must have), python)\nFamiliarity with database (Postgres), web servers (e.g., express, nginx, or IIS), and UI/UX design\nGood communication and teamwork skills.\nJob Type: Full-time\nSalary: ₹1,000,000.00 - ₹1,500,000.00 per year\nBenefits:\nFlexible schedule\nHealth insurance\nLife insurance\nPaid sick time\nProvident Fund\nSchedule:\nUK shift\nSupplemental pay types:\nPerformance bonus\nAbility to commute/relocate:\nNoida, Uttar Pradesh: Reliably commute or planning to relocate before starting work (Required)\nEducation:\nBachelor's (Preferred)\nExpected Start Date: 15/07/2023",
        "Job Link": "/company/Girikon-Solutions-Pvt-Ltd/jobs/Full-Stack-Developer-785d748ff3dbb087?fccid=0ad88fbba0e9e819&vjs=3",
        "state": "Uttar Pradesh"
    },
    {
        "Title": "Full Stack Developer",
        "Location": "Remote in India",
        "Company": "Maniten Services",
        "Salary": "",
        "Sponsored": "",
        "Description": "Any Batch.\nFresher or Experienced.\nSkills: HTML, CSS, Bootstrap, JavaScript, jQuery, PHP, MySQL.\nCandidates having basic knowledge and willing to learn can be considered.\nSalary upto 3.1 lpa.\nLocation: Across India.\nWork from home",
        "Job Link": "/rc/clk?jk=fca924a3aead4a19&fccid=8a2ab47aa363074d&vjs=3",
        "state": "Remote"
    },
    {
        "Title": "Full Stack Developer Intern",
        "Location": "Chennai, Tamil Nadu",
        "Company": "Renambl Technologies",
        "Salary": "",
        "Sponsored": "",
        "Description": "About Renambl Technologies\nRenambl Technologies Private Limited, provides payment and marketing tools for small and medium scale businesses. Mykaasu is the brand under Renambl Technologies, where customers could scan using QR code and pay to merchants. Please refer to mykaasu.comand renambl.comfor additional details.\nSelected intern's day-to-day responsibilities include:\n1. Develop websites using JavaScript and Node.js\n2. Develop Android and IOS applications using React Native\n3. Integrate Front end applications with back end microservices and database.\nOnly Those Candidates Can Apply Who\nAre available for full time (in-office)\nHas computer background during college and has completed degree, preferably 2023 pass out\nCan attend internship between July to October. Selected candidates will be eligible for full time position\nJob Type: Full-time\nSalary: ₹5,000.00 - ₹49,697.85 per month\nSchedule:\nDay shift\nAbility to commute/relocate:\nChennai, Tamil Nadu: Reliably commute or planning to relocate before starting work (Required)\nExperience:\ntotal work: 10 years (Preferred)\nWork Location: In person\nSpeak with the employer\n+91 9597950113",
        "Job Link": "/company/Renambl-Technologies/jobs/Full-Stack-Developer-9b744a3a29717607?fccid=fd86e73a01602f9a&vjs=3",
        "state": "Tamil Nadu"
    },
    {
        "Title": "ReactJS Developer",
        "Location": "Faridabad, Haryana",
        "Company": "hireeasi",
        "Salary": "",
        "Sponsored": "",
        "Description": "We are looking for a ReactJS developer with experience in building SSR using Next.js. You will be our first dedicated React JS engineer and will be responsible for re-engineering a huge\nChunk of our front-end applications. This is a position of responsibility where you will be taking key architectural decisions that define the direction of the future of our front-end tech stack.\nWrite, clean, and commented code as per the agreed-upon coding standards, Peer review code, Write unit test/integration tests (where required), API/technical documentation\nUnderstanding of Oauth and social login using various third-party OAuth providers like Google, Facebook, Twitter etc.\nThe ability to build React components, hooks and experience with functional programming is a must.\nUnderstanding of static site, as well as server-side rendering using React and Next JS, is a must.\nCandidates shouldWe are looking for a ReactJS developer with experience in building SSR using Next.js. You will be our first dedicated React JS engineer and will be responsible for re-engineering a huge\nChunk of our front-end applications. This is a position of responsibility where you will be taking key architectural decisions that define the direction of the future of our front-end tech stack.\nWrite, clean, and commented code as per the agreed-upon coding standards, Peer review code, Write unit test/integration tests (where required), API/technical documentation\nUnderstanding of Oauth and social login using various third-party OAuth providers like Google, Facebook, Twitter etc.\nThe ability to build React components, hooks and experience with functional programming is a must.\nUnderstanding of static site, as well as server-side rendering using React and Next JS, is a must.\nCandidates should understand various deployment tools and platforms for deploying Next JS applications such as Vercel.\nExperience with secure coding practices is a plus.\nExperience in working with typescript and ES6 is a plus.\nKnowledge of CSS and material design is a requirement.\nKnowledge of building Frontend applications using RESTful APIs is a requirement.\nPrior experience working at a start-up is a plus advantage.\nWriting documented, usable, testable, efficient code is a requirement. understand various deployment tools and platforms for deploying Next JS applications such as Vercel.\nExperience with secure coding practices is a plus.\nExperience in working with typescript and ES6 is a plus.\nKnowledge of CSS and material design is a requirement.\nKnowledge of building Frontend applications using RESTful APIs is a requirement.\nPrior experience working at a start-up is a plus advantage.\nWriting documented, usable, testable, efficient code is a requirement.\nJob Types: Full-time, Regular / Permanent\nPay: ₹300,000.00 - ₹700,000.00 per year\nSchedule:\nDay shift\nMorning shift\nAbility to commute/relocate:\nFaridabad, Haryana: Reliably commute or planning to relocate before starting work (Required)\nEducation:\nBachelor's (Preferred)\nExperience:\ntotal work: 1 year (Preferred)\nNext JS: 1 year (Preferred)\nHTML5: 1 year (Preferred)\nSpeak with the employer\n+91 8607667706",
        "Job Link": "/company/hireeasi/jobs/Developer-bc84b7151d0256f6?fccid=330666761dfcf2f4&vjs=3",
        "state": "Haryana"
    },
    {
        "Title": "Lead Developer - RPA",
        "Location": "Bengaluru, Karnataka",
        "Company": "lululemon India Tech Hub",
        "Salary": "",
        "Sponsored": "",
        "Description": "About lululemon India Tech Hub\nlululemon is an innovative performance apparel company for yoga, running, training, and other athletic pursuits. Setting the bar in technical fabrics and functional design, we create transformational products and experiences that support people in moving, growing, connecting, and being well. We owe our success to our innovative products, commitment to our people, and the incredible connections we make in every community we're in. As a company, we focus on creating positive change to build a healthier, thriving future. In particular, that includes creating an equitable, inclusive and growth-focused environment for our people. As we continue to elevate our shopping experience, our India Tech Hub plays a key role in expanding our technology capabilities in Product Systems, Merchandising and Planning, Digital Presence, distribution and logistics, and corporate systems. Our team in India works as an extension of the global team on projects of strategic importance.\nJob Description\nWho we are?\nlululemon is a yoga-inspired technical apparel company up to big things.\nThe practice and philosophy of yoga informs our overall purpose to elevate the world through the power of practice.\nWe are proud to be a growing global company with locations all around the world, from Vancouver to Shanghai, and places in between. We owe our success to our innovative product, our emphasis on our stores, our commitment to our people, and the incredible connections we get to make in every community we are in.\nQualifications\nApproximately 3-5 years of related work experience with uiPath\nA degree in computer science, technology, engineering, and math STEM degree preferred or equivalent industry experience\nMinimum 5 years of experience in web-based technologies\nUiPath Advanced RPA Developer certification or UiARD certification preferred\nExposure to the full software development life cycle, including design, configuration, integration, testing and support including, but not limited to, gathering requirements, designing the future state solution, the development work breakdown, as well as supporting quality assurance and post-production efforts.\nDesired Qualifications:\nPreferred technical stack:\n.Net framework and .Net Core\nUnderstanding of relational databases\nUi Path Studio and workflow management\nExperience working with APIs\nTools: Gitlab, Jira, Confluence\nExperience with unit testing frameworks\nStrong skills at performance application tuning A day in the life:\nDevelop, test and implement efficient automation solutions with a focus on scalability and reusability\nEnsure design solutions meet business requirements\nSet up the RPA environment (software installation, installation of related technologies, migrations and upgrades of the infrastructure)\nConfigure new/existing processes and objects using core workflow principles that are efficient, well structured, maintainable using Robotics technologies such as UiPath\nParticipate in RPA Architecture design and solutioning\nValidate process design documents and report on technical feasibility\nTranslate business and process documents into RPA process workflows\nDirect efforts to define technical, operational, and user requirements\nConduct UAT phases to identify and to fix bugs or changes\nComply with and help to enforce design and coding standards, policies, and procedures\nBe actively involved in designing new RPA features and functionality, improving scalability and maintainability\nSupport a complex (cloud to cloud) infrastructure environment; evaluate (with recommendations) to enable proper operability of applications on both infrastructure and software levels\nSupport team in defining technical requirements to facilitate design, development, testing, implementation, and ongoing support of applications within scoped teams\nEnsure timely resolution of blocker issues\nSupport existing processes in production, addressing issues in a timely fashion, respecting agreed upon service level objectives\nBe an active voice in defining and implementing best practices, standards and procedures including quality and delivery methodologies\nEnsure compliance with the documented software processes and procedures throughout the life cycle of software products\nEnsure the governance models for the RPA processes are being defined and followed\nProvide level 3 support for robot production issue\n\n10-15 years\nRPA / UiPath / Rest / Rest API / Git / Jira / Confluence",
        "Job Link": "/pagead/clk?mo=r&ad=-6NYlbfkN0D5mXFGwCT9lo97i3gsfTR9iTAPBTm16RjVfbVH6M8QHLBEL5WYTIbi2SMoRK5m8ansgfz7fvtVHqCs6BFNQZbtX8yg8xJLwq61Hr5lmWu0XJi25WEH3Hhfd6ku6tIXHHKXlWsP8h2t14xjaa8NuyCjlF3_z9VyV-B_EjoF56x0E-7ASmbPs7S_9s7QViz2TNmQWRxNoM79hODnJdrfH0PGrGnN9-JDwd20kD3b-DMSaxVQyuowavbT0wxN-ICOoQ44gfjRxrOuYHbJPdAKn4ggHaqBGbaxOAbOmlgSQ89zr2IrH741u1ihnMFDMPqTv8DkzSXs9Q1ioDj8nziQjeU38z62Qfk-KMgQXIIGBzyri8FIbtK8YSJMABde4MwxfJBCmGnvo-U5kPWIlG_FZiJ1DKB6bNRpfZNdp2NeFehzLUKLPJIZe9FRnh0F2kE3N0UL74PXWyUUmoyreXvwESbvy0ntjMqE_cQh2oKlaxJm7UK_KrfEBRH6JcE60qXCe3v_F_gsJ3VCsOldaFtym4LqSLP4-LjQdNSiljULteMk8GgGgjz36R3_cDcBd2A6tqRceUPlUKxfAHBnMOnIDDSKB7kfkEdiSIYsZIYOi0ljkA==&xkcb=SoD0-_M3NjYTJASFgR0HbzkdCdPP&p=12&fvj=0&vjs=3",
        "state": "Karnataka"
    },
    {
        "Title": "Full Stack PHP Developer",
        "Location": "Noida, Uttar Pradesh",
        "Company": "Crewman Solution Private Limited",
        "Salary": "",
        "Sponsored": "",
        "Description": "Key Responsibilities:\nCollaborate with stakeholders to understand project requirements, user needs, and business goals.\nDesign and develop responsive and user-friendly web applications, ensuring seamless integration of front-end and back-end components.\nWrite clean, efficient, and well-documented code using appropriate programming languages, frameworks, and libraries.\nCreate and maintain efficient database schemas, design data models, and optimize database queries.\nImplement intuitive user interfaces using HTML, CSS, and JavaScript, CodeIgniter frameworks to deliver exceptional user experiences.\nCollaborate with DevOps teams to streamline deployment processes, implement continuous integration, and monitor application performance.\nStay updated on emerging technologies, best practices, and industry trends, and apply them to improve development processes and enhance product quality.\nCollaborate with team members through code reviews, knowledge sharing, and mentorship to maintain code quality and ensure adherence to coding standards.\nTroubleshoot and resolve technical issues, both independently and in collaboration with the team.\nQualifications and Skills:\nBachelor's degree in Computer Science, Software Engineering, or a related field (preferred).\nProven experience as a Full Stack Developer or similar role.\nProficiency in front-end technologies such as HTML, CSS, JavaScript, JQ, Bootstrap, API integration and popular frameworks like Codeigniter.\nStrong knowledge of server-side programming languages PHP.\nExperience with database systems (SQL and/or NoSQL), data modeling, and query optimization.\nFamiliarity with RESTful APIs, microservices architecture, and version control systems (e.g., Git).\nUnderstanding of web application security principles and best practices.\nSolid understanding of software development principles, agile methodologies, and design patterns.\nStrong problem-solving skills and ability to debug and resolve complex issues.\nExcellent communication and collaboration skills, with the ability to work effectively in a team environment.\nJob Types: Full-time, Regular / Permanent\nSalary: From ₹30,000.00 per day\nBenefits:\nHealth insurance\nProvident Fund\nSchedule:\nDay shift\nAbility to commute/relocate:\nNoida, Uttar Pradesh: Reliably commute or planning to relocate before starting work (Required)\nEducation:\nBachelor's (Preferred)\nExperience:\nPHP: 1 year (Required)\ntotal work: 1 year (Required)\nCodeigniter: 1 year (Required)\nSpeak with the employer\n+91 7827508545",
        "Job Link": "/company/Crewman-Solution-Private-Limited/jobs/Full-Stack-Developer-a444d0ca0ece6d7a?fccid=181988c7f3b81c00&vjs=3",
        "state": "Uttar Pradesh"
    },
    {
        "Title": "Full Stack Developer",
        "Location": "Panaji, Goa",
        "Company": "Perky",
        "Salary": "",
        "Sponsored": "",
        "Description": "As a full stack developer, you will be involved in all stages of the software development life cycle, from design and development to deployment and maintenance.\nResponsibilities:\nDesigning and implementing the overall architecture of web applications.\nDeveloping front-end interfaces using HTML, CSS, and JavaScript, ensuring responsive and user-friendly designs.\nCreating server-side applications and APIs using Python and Django framework.\nIntegrating back-end systems with third-party APIs and services.\nCollaborating with designers, product managers, and other developers to translate requirements into technical solutions.\nWriting clean, reusable, and efficient code, following best practices and coding standards.\nConducting thorough testing and debugging of applications to ensure high-quality and bug-free software.\nPerforming data analytics tasks, such as data extraction, transformation, and analysis using appropriate tools and libraries.\nOptimizing applications for maximum speed, scalability, and performance.\nDeploying applications to production environments and monitoring their performance.\nTroubleshooting and resolving technical issues and providing support when necessary.\nKeeping up to date with the latest trends, technologies, and best practices in full stack development.\nSkills Required:\nProficiency in Python programming language.\nExperience with the Django web framework.\nStrong knowledge of front-end technologies, including HTML, CSS, and JavaScript.\nFamiliarity with front-end frameworks and libraries like React, Angular, or Vue.js.\nUnderstanding of database systems and SQL queries.\nKnowledge of data analytics concepts and tools for data extraction, transformation, and analysis.\nExperience in designing and developing RESTful APIs.\nFamiliarity with version control systems, such as Git.\nStrong problem-solving and debugging skills.\nExcellent communication and teamwork abilities.\nAttention to detail and a focus on delivering high-quality work.\nAbility to learn new technologies and adapt to changing project requirements.\nJob Types: Full-time, Contractual / Temporary\nContract length: 12 months\nSalary: ₹40,000.00 - ₹80,000.00 per month\nBenefits:\nFlexible schedule\nSchedule:\nDay shift\nMonday to Friday\nAbility to commute/relocate:\nPanjim, Goa: Reliably commute or planning to relocate before starting work (Required)\nApplication Question(s):\nShare your GitHub or some of your best work code example link\nEducation:\nBachelor's (Preferred)\nExperience:\nDjango: 1 year (Required)\nPostgreSQL: 1 year (Required)\nAPIs: 1 year (Required)\nWork Location: In person\nApplication Deadline: 14/07/2023",
        "Job Link": "/company/PERKY/jobs/Full-Stack-Developer-7f504ad53191ff1b?fccid=07a8a82402ffd84e&vjs=3",
        "state": "Goa"
    }
]